{"reviewerID": "AO94DHGC771SJ", "asin": "0528881469", "reviewerName": "amazdnu", "helpful": [0, 0], "reviewText": "We got this GPS for my husband who is an (OTR) over the road trucker.  Very Impressed with the shipping time, it arrived a few days earlier than expected...  within a week of use however it started freezing up... could of just been a glitch in that unit.  Worked great when it worked!  Will work great for the normal person as well but does have the \"trucker\" option. (the big truck routes - tells you when a scale is coming up ect...)  Love the bigger screen, the ease of use, the ease of putting addresses into memory.  Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck.  I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!", "overall": 5.0, "summary": "Gotta have GPS!", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"}
{"reviewerID": "AMO214LNFCEI4", "asin": "0528881469", "reviewerName": "Amazon Customer", "helpful": [12, 15], "reviewText": "I'm a professional OTR truck driver, and I bought a TND 700 at a truck stop hoping to make my life easier.  Rand McNally, are you listening?First thing I did after charging it was connect it to my laptop and install the software and then attempt to update it.  The software detected a problem with my update and wanted my home address so I could be sent a patch on an SD card.  Hello?  I don't think I'm all that unusual; my home address is a PO box that a friend checks weekly and that I might get to check every six months or so.  I live in my truck and at truck stops.  If you need to make a patch available on an SD card then you should send the SD cards to the truck stops where the devices are sold.  I ran the update program multiple times until the program said that the TND 700 was completely updated.I programmed in the height (13'6\"), the length (53') and the weight (80,000#) of my rig and told it that I preferred highways.  I was parked at a truck stop in the Cincinnati OH area.  My next pickup was about 15 miles down the same freeway but on the other side of it a couple of blocks.  My cell phone GPS (Sprint) said to get on the freeway to get to my pickup.  The TND 700 routed me thru 23 miles of residential streets before finally getting me to my pickup.  Very exciting, especially since every time I refused to turn down a street posted \"No Trucks\" the TND 700 took almost 5 minutes to figure a re-route, and it happened multiple times on that short trip.I decided to give it another chance.  After my pickup on the north side of Cincinnati just off of I-75 I needed to head to Phoenix AZ via I-71.  Easy route is to just hop on I-75 and drive west and south to the intersection of I-71.  Indeed, that is what my cell phone advised.  The TND 700, however, wanted to route me over surface streets across the city and pick up I-75 on the other side of the city.  I turned it off and the next time I passed a truck stop of the same chain I purchased it at I returned it and got my money back.I then spent $30 on a cheap printer.  Now I take a minute to set up my route on Google and print it out.  Hasn't gotten me lost yet over several cross country trips.", "overall": 1.0, "summary": "Very Disappointed", "unixReviewTime": 1290643200, "reviewTime": "11 25, 2010"}
{"reviewerID": "A3N7T0DY83Y4IG", "asin": "0528881469", "reviewerName": "C. A. Freeman", "helpful": [43, 45], "reviewText": "Well, what can I say.  I've had this unit in my truck for about four days now.  Prior to that I had a Garmin 755T non-truck GPS.  One of my favorite features in that unit was the ability to plan a route by determining mileage using the stop or via feature.  What I would do is using a map I would route myself several different ways forcing the unit by putting in stops or vias at different locations along the route, otherwise, like most GPS 's, it determines what it thinks is the best route.  I could add up to 10 Via's or stop points for each route and then based on mileage and other factors determine which is the best route to take.  Multiple stops and the ability to route was the most important reason for having the Garmin.  However it was not truck specific.  And considering I am now hauling strictly hazmat I wanted something that would take that into consideration.  After perusing various forums, review sites, and word-of-mouth my choices boiled down to the Garmin 465T or the RAND McNally Intelliroute TND 700.  Even though it was quite a bit more than the Garmin I chose the TND 700 for several reasons.  The main one being the extra screen size, and its ability to coordinate with the RAND McNally truck atlas and also its ease of updating.Now on to my first impression of the TND 700.  It seems to be an aesthetically pleasing and durably built unit.  The first thing I noticed was it's very slow to boot compared to my old Garmin.  Whether this is unique to the TND 700 or is common amongst all truck specific gps units I cannot tell, but it's really not that big of a deal.  The second thing I noticed was the overwhelming wealth of information put forth.  That might explain why the manual (available via the TND dock) is well over 100 pages long.....  There is somewhat of a learning curve with this unit.  The next thing I noticed was the complexity of entering routes.  As previously mentioned I like to force it into my preferred routing by the use of stops or vias.  That was a big no go with this unit.  While you can enter multiple stops or vias it is nowhere near as user-friendly as my old Garmin.  Furthermore there is no way you can determine total mileage on the route that you have chosen, as I could with the Garmin.  Totally flummoxed by what appeared to be an omission of one of the best routing tools a trucker could have I went online and verified through an expert source connected with RAND McNally that no, that feature was a couple updates down the line and was not available at this point.  Unbelievable.  Also forcing the unit to follow a specific route can be very challenging.  For a unit of this price, and feature laden, I find this totally unacceptable.  I am still mulling over selling this unit  and buying the Garmin 465T.  I really do like this GPS, the screen is magnificent, and the volume is awesome.Another thing I've noticed, which I do not think is unique to this unit, is some of the weird routing that it does.  I've never owned a truck specific GPS before but after playing with this one for a couple of days I get the impression that what RAND MacNally (and the others that use Navteq) has done is take a plain old car specific Navteq map and a road atlas with truck restrictions and made notifications on the map.  In most databases there is not a 100% thorough listing of every road in the country.  What I mean is that this unit will route you down roads you don't belong on.  Today while coming home it tried routing me on several  9 ton County roads.  What that means is that a truck is limited to 73280 unless the road is posted at 10 tons.  County roads do not have that restriction listed in the RAND McNally road atlas, so I believe that is why it is not listed.....  Also unacceptable in a unit of this price and sold as truck specific.  However I'd be willing to bet the other truck specific units are the same way as no one has ever done a truck specific version of NavTeq.Another bone I have to pick is the POI's. Not only the truck specific ones but the others all seem to be somewhat outdated.  I think the Garmin, at least the ones that I have used, are more current.  It would also be nice if I could add my own POI'sTo sum it up I will keep this unit a little longer to see if I can make it workable.  If not I will go back to Garmin.  I like the concept and I like the unit but at this point I'll have to say I am somewhat unimpressed.pros:Large screenterrific imagesoutstanding volumecons:inability to determine route mileage by multiple stops and viasa somewhat outdated POI information.Non-truck specific routings.Cost.", "overall": 3.0, "summary": "1st impression", "unixReviewTime": 1283990400, "reviewTime": "09 9, 2010"}
{"reviewerID": "A1H8PY3QHMQQA0", "asin": "0528881469", "reviewerName": "Dave M. Shaw \"mack dave\"", "helpful": [9, 10], "reviewText": "Not going to write a long review, even thought this unit deserves one. I've driven well over 1-mil miles and done most of my own routing so I pretty know whats the fastest and shortest. Have been using a basic garmin for the past three years and with ANY Gps unit they'll ALL get you in trouble if you let them. I was really excited about this unit, due to the size and the features. Allot of great grafics and on screen info thats usefull. But the most basic item that it was lacking was the gps tracking. I gave this unit allot of leadway on its mistakes due to the fact that it had allot of cool stuff that it did, but its ability to track you and route you was not even close to what the basic garmin could due. Its like the prossesor that they installed in the TND 700 was 10 years old. Example if I needed to make a simple route change I.E. in town down to the next street due to the fact that I couldn't make the turn or the street was blocked off, it would take the TND 700 upwards of 45 seconds to a minute and a half to reroute me. Here I'm sitting at a stop light waiting for directions and waiting that long with cars on my backside didn't make me happy. This is a problem that happened evertime you had to reroute, weather it was a simple street change or a major highway change. Also from the time you turned the unit on it would take twice as long to boot itself up. At least a dozen times with in a week it put me on the wrong roads and when I made a wrong turn it got it self lost....I.E. take left on xyz street, and it was some ones drive way. Or turn left in 800 yards and the turn was less than 10 feet away. You might think in a conjested city situation I might get a little mixed up, but this is out in the country. Twice it put me under 12'6\" bridges when I'm 13'6\". Of course I made sure all my truck setting where they were supposed to be. I also updated the OS version,via Rand McNally. All in all I expected alot out of this unit and got a unit that should of been field tested with some people that drive allot. It just had to many route mistakes. Going back to the basic garmin. This isn't just my complaints, I have three friends that bought the same unit and have the same complaints. All of us returned the units.", "overall": 2.0, "summary": "Great grafics, POOR GPS", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
{"reviewerID": "A24EV6RXELQZ63", "asin": "0528881469", "reviewerName": "Wayne Smith", "helpful": [0, 0], "reviewText": "I've had mine for a year and here's what we got. It tries to route be down non truck routes while telling me the truck route is illegal for me. This is such a bad problem that even Interstate 25 in Denver Colorado is listed (according to this GPS) as a non- truck route and will route you through the city instead. There are several drivers within our company who own one and more than half (of about 50) have crashed to an un-recoverable state. Our company representative said that Rand McNally informed them that the GPS was not designed to say on for a long period of time. Really? it's a truck driver GPS. We have one driver with a $2400 dollar ticket due to this GPS routing him down the wrong road. The companies response was to update the unit. I've had mine for a year, I never noticed one update that corrected functionality, they only seem to keep messing the tools. I want a GPS that routes, if I wanted tools I'd buy software for my computer.My suggestion is to by a nice Garmen. My one rated for cars actually routes me better than this one rated for trucks.Wayne", "overall": 1.0, "summary": "Major issues, only excuses for support", "unixReviewTime": 1317254400, "reviewTime": "09 29, 2011"}
{"reviewerID": "A2JXAZZI9PHK9Z", "asin": "0594451647", "reviewerName": "Billy G. Noland \"Bill Noland\"", "helpful": [3, 3], "reviewText": "I am using this with a Nook HD+. It works as described. The HD picture on my Samsung 52&#34; TV is excellent.", "overall": 5.0, "summary": "HDMI Nook adapter cable", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A2P5U7BDKKT7FW", "asin": "0594451647", "reviewerName": "Christian", "helpful": [0, 0], "reviewText": "The cable is very wobbly and sometimes disconnects itself.The price is completely unfair and only works with the Nook HD and HD+", "overall": 2.0, "summary": "Cheap proprietary scam", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "AAZ084UMH8VZ2", "asin": "0594451647", "reviewerName": "D. L. Brown \"A Knower Of Good Things\"", "helpful": [0, 0], "reviewText": "This adaptor is real easy to setup and use right out of the box. I had not problem with it at all, it is well worth the purchase. I recommend this adaptor very much for viewing your Nook videos on your HDTV. I just disagree with other reviews on the length of the adaptor, I found it to be fairly adequate as to how and where it is connected to my TV. For me it was just right not too long or too short, I was able to place my Nook right below the connection on the TV stand, it did not fall or anything else, it is fine. Use your own judgement, I'm too busy watching my movies :)", "overall": 5.0, "summary": "A Perfdect Nook HD+ hook up", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"}
{"reviewerID": "AEZ3CR6BKIROJ", "asin": "0594451647", "reviewerName": "Mark Dietter", "helpful": [0, 0], "reviewText": "This adapter easily connects my Nook HD 7&#34; to my HDTV through the HDMI cable.  This is good for traveling because it makes any hotel TV a potential smart TV so long as there is an accessible HDMI port.  It is also good for sharing photos from FB on a bigger screen. A bit pricey, but a good accessory to have.  Be sure to note that this is ONLY for the Nook HD and HD+ series.  It will not work with a standard Nook.", "overall": 4.0, "summary": "A nice easy to use accessory.", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A3BY5KCNQZXV5U", "asin": "0594451647", "reviewerName": "Matenai", "helpful": [3, 3], "reviewText": "This product really works great but I found the following items you need to keep in mind:- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device.", "overall": 5.0, "summary": "This works great but read the details...", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A2JXAZZI9PHK9Z", "asin": "0594451647", "reviewerName": "Billy G. Noland \"Bill Noland\"", "helpful": [3, 3], "reviewText": "I am using this with a Nook HD+. It works as described. The HD picture on my Samsung 52&#34; TV is excellent.", "overall": 5.0, "summary": "HDMI Nook adapter cable", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A2P5U7BDKKT7FW", "asin": "0594451647", "reviewerName": "Christian", "helpful": [0, 0], "reviewText": "The cable is very wobbly and sometimes disconnects itself.The price is completely unfair and only works with the Nook HD and HD+", "overall": 2.0, "summary": "Cheap proprietary scam", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "AAZ084UMH8VZ2", "asin": "0594451647", "reviewerName": "D. L. Brown \"A Knower Of Good Things\"", "helpful": [0, 0], "reviewText": "This adaptor is real easy to setup and use right out of the box. I had not problem with it at all, it is well worth the purchase. I recommend this adaptor very much for viewing your Nook videos on your HDTV. I just disagree with other reviews on the length of the adaptor, I found it to be fairly adequate as to how and where it is connected to my TV. For me it was just right not too long or too short, I was able to place my Nook right below the connection on the TV stand, it did not fall or anything else, it is fine. Use your own judgement, I'm too busy watching my movies :)", "overall": 5.0, "summary": "A Perfdect Nook HD+ hook up", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"}
{"reviewerID": "AEZ3CR6BKIROJ", "asin": "0594451647", "reviewerName": "Mark Dietter", "helpful": [0, 0], "reviewText": "This adapter easily connects my Nook HD 7&#34; to my HDTV through the HDMI cable.  This is good for traveling because it makes any hotel TV a potential smart TV so long as there is an accessible HDMI port.  It is also good for sharing photos from FB on a bigger screen. A bit pricey, but a good accessory to have.  Be sure to note that this is ONLY for the Nook HD and HD+ series.  It will not work with a standard Nook.", "overall": 4.0, "summary": "A nice easy to use accessory.", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A3BY5KCNQZXV5U", "asin": "0594451647", "reviewerName": "Matenai", "helpful": [3, 3], "reviewText": "This product really works great but I found the following items you need to keep in mind:- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device.", "overall": 5.0, "summary": "This works great but read the details...", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A7S2B0I67WNWB", "asin": "0594481813", "reviewerName": "AllyMG", "helpful": [2, 2], "reviewText": "This item is just as was described in the original description, works without any issues to be seen. Good product", "overall": 4.0, "summary": "As expected", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3HICVLF4PFFMN", "asin": "0594481813", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "bought for a spare for my 9&#34; Nook HD and it fit perfectly.  Very satisfied with the price much less than on the BN site", "overall": 5.0, "summary": "great fit", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "ANSKSPEEAKY7S", "asin": "0594481813", "reviewerName": "Gena", "helpful": [1, 1], "reviewText": "My son crewed my HD charger cord so I needed another one, this is exactly like the one my son destroyed.", "overall": 5.0, "summary": "Works Great", "unixReviewTime": 1372032000, "reviewTime": "06 24, 2013"}
{"reviewerID": "A2QBZA4S1ROX9Q", "asin": "0594481813", "reviewerName": "Jake", "helpful": [0, 1], "reviewText": "This is a good beefy 2 amp charger, but it covers two outlets on a power strip. It's ok in a regular wall outlet. The best thing is it uses a standard USB connector so it can charge more than just a Nook (I have a Kindle Fire HD+).", "overall": 3.0, "summary": "It Works", "unixReviewTime": 1369440000, "reviewTime": "05 25, 2013"}
{"reviewerID": "ANY6JUFM0GH8U", "asin": "0594481813", "reviewerName": "J. Clement", "helpful": [2, 2], "reviewText": "I lost my B&N original cable.  I looked around for an new one.  I tried  a different, cheaper model but it didn't fit my device properly so back to the drawing board.  I ordered this one.  I am satisfied.  It works exactly as expected and fits perfectly.  I would recommend this product to anyone looking for a spare or in lieu of the original usb cable adapter.", "overall": 5.0, "summary": "Great replacement for original power cable", "unixReviewTime": 1394323200, "reviewTime": "03 9, 2014"}
{"reviewerID": "AT09WGFUM934H", "asin": "0594481813", "reviewerName": "John", "helpful": [0, 0], "reviewText": "It does 2A and charges a DEAD Nook in a few hours. It does so with a LOT of heat, compared to most wall worts. I have a dual charger where 1 port is 2.1A and the other is 1A for total output of 3.1A that doesn't run as hot as this. And i use that to power a raspberry pi to avoid needing a powered hubIt does the job adequately as it's designed to. Just hot. I would always unplug it if not using (even though it cools off) because of the amount of heat made. The nook hd+ runs hot too right where you hold it on the left side in portrait, but not so much when charging. I guess it's better to have it at the plug.", "overall": 3.0, "summary": "This is the oem charger you get with the nook hd+", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "AGAKHE014LQFU", "asin": "0594481813", "reviewerName": "Nicodimus", "helpful": [3, 5], "reviewText": "Go to Target or Barnes and Noble instead, and pay $25 (which is still a huge markup, considering they make the thing for 50 cents.) This is the worst option if you need one of these. It's price gouging, pure and simple.", "overall": 3.0, "summary": "$45 for a power cord? Good luck with that.", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1S6B5QFWGVL5U", "asin": "0594481813", "reviewerName": "T. Vaughan", "helpful": [2, 2], "reviewText": "Works well, a little pricey I think for a charging cable, but then again, not losing the original would be a lot cheaper than any replacement", "overall": 4.0, "summary": "Good replacement", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
{"reviewerID": "A20XXTXWF2TCPY", "asin": "0972683275", "helpful": [0, 0], "reviewText": "This is a great buy, compared to a $60 or more a retail store.", "overall": 5.0, "summary": "Excelant mount for Tv. Would buy more if I needed them.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
{"reviewerID": "A2IDCSC6NVONIZ", "asin": "0972683275", "reviewerName": "2Cents!", "helpful": [1, 1], "reviewText": "This mount is just what I needed.  It is strong and sturdy.  It folds almost flat to enable the television to sit square and flat against the wall if desired and extends and rotates for angle turns.  A perfect fit as long as you match the correct visa pattern for your television.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A1EDI0X3GI1SK7", "asin": "0972683275", "reviewerName": "AGW", "helpful": [0, 1], "reviewText": "Great deal, easy to mount and it appears to be fairly sturdy. I mounted a 32 in tv on it and it works great.", "overall": 5.0, "summary": "32 In TV Mount", "unixReviewTime": 1323993600, "reviewTime": "12 16, 2011"}
{"reviewerID": "A3BMUBUC1N77U8", "asin": "0972683275", "reviewerName": "ahoffoss", "helpful": [0, 0], "reviewText": "This mount works really well once you get it up and going.  Only problem is just the arms are a little goofy getting them all in the right spot.  But that's really not too big an issue considering all the different TV's and their mounting hole locations.", "overall": 4.0, "summary": "Pretty simple, but definitely good!", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AVRFGGCCCR6QU", "asin": "0972683275", "reviewerName": "Alberto Dieguez \"premiere purchaser of random...", "helpful": [3, 4], "reviewText": "This wall mount does everything it's supposed to do.  The piece that attaches to the wall isn't overly long, which made it easier to mount the arm in the tight space I needed to mount it in.  The only issues I saw was that the joints were VERY tight initially and as we moved the arm around to install it, the joints loosened up to the point where I had to take the included allen wrench and tighten them up again.", "overall": 4.0, "summary": "Fairly good wall mount", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "A3UOSOCRKS3WIH", "asin": "0972683275", "reviewerName": "Allen Coberly", "helpful": [0, 0], "reviewText": "for the price you just cant beat this item. I bought it for a house I was selling so I could hang some tv and it worked great. Good quality for the price.", "overall": 5.0, "summary": "Cant Beat it!", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A371ZZ95ZQEIZV", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I received the mount, which was well packaged for shipping.  The installation instructions were Moderately clear.  No issues following them, they were just a little disjointed depending on the wall surface you were installing on.My shipment had a mis-cut piece, and was missing 4 screws.  I contacted the Manufacturer, and they shipped me a replacement part and screws the very next day (Shipped out of Texas, so normal mailing times applied)I like how the Mount fits together, and I easily mounted my 60lbs TV by myself.  The part that attaches to the TV has a hook that will hold the TV on the Arm till you bolt it on.It's very adjustable, and pushes almost flush with the wall.I'm very happy, but took one star for the miscut piece.", "overall": 4.0, "summary": "Sturdy Mount, good customer service", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A7060R14RJF3I", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Took a bit of work, but used this to fit an older vizio 32&#34; monitor to the wall to use as a compute monitor. Stable and like the ability to move the tv to different angles. The vizio was older and did not have the standard holes, this product fit and holds the tv very stable.", "overall": 4.0, "summary": "Works", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A26QCCO0101CO1", "asin": "0972683275", "reviewerName": "Amazon Customer \"jkhinch\"", "helpful": [7, 9], "reviewText": "I used this for my 47&#34; Samsung. Its fit/feel is great. Easy installation. Appears strong; although I personally spent way too much on the tv to risk leaving it fully outstretched with too little lag bolts for a long time! It is very convenient to be able to move it away from the wall however and I would feel very comfortable tilt or swiveling if needed. The movement is fluid and easily adjustable.I am very pleased with my purchase.", "overall": 5.0, "summary": "Just what I'd hoped", "unixReviewTime": 1361404800, "reviewTime": "02 21, 2013"}
{"reviewerID": "APBF796U7GUTV", "asin": "0972683275", "reviewerName": "Amazon Customer \"steve-mc2\"", "helpful": [1, 1], "reviewText": "This item serves its purpose as well as any other mount.  Its most appealing attribute is its large range of motion.  I am using this to corner-mount a 32\" TV and it works perfectly to hide the mount, receptacles, and cables behind the TV.  Very easy installation as well.", "overall": 5.0, "summary": "Nice Mount", "unixReviewTime": 1331942400, "reviewTime": "03 17, 2012"}
{"reviewerID": "A2HLNXOYLMERTC", "asin": "0972683275", "reviewerName": "anthony smith", "helpful": [0, 0], "reviewText": "I love this mount.  This is the 4th one I've bought and it works great every time.  excellent seller and excellent product", "overall": 5.0, "summary": "Buy this mount its the best", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3CCITVF0WL6KE", "asin": "0972683275", "reviewerName": "A. Ramos", "helpful": [0, 0], "reviewText": "I am very glad for buying it.  It is heavy duty and good quality for the price.  It was very easy to install.", "overall": 5.0, "summary": "VideoSecu Swing Arm TV Wall Mount", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
{"reviewerID": "AYQNWE3AX4H08", "asin": "0972683275", "reviewerName": "arl6969 \"arl6969\"", "helpful": [0, 0], "reviewText": "this holds up my 55inch sony with ease. make sure u mount this with ur own lag screws into the heart of the 2x4 ur mounting to and u won't have any problem--u may have to make a modificatoin or two but use ur brain and figure it out-- it'll be there till the house falls!!!3inch lag screws is the way to go don't be cheap go buy em.---how much did u pay for the tv????", "overall": 5.0, "summary": "work great", "unixReviewTime": 1374105600, "reviewTime": "07 18, 2013"}
{"reviewerID": "A3P24ZSF9IQRJJ", "asin": "0972683275", "reviewerName": "average customer", "helpful": [0, 0], "reviewText": "Nice quality still works great... very happy with this purchase... need to add 10 more words.. so what can I say its a wall mount that I haven't had any problems with", "overall": 5.0, "summary": "great", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
{"reviewerID": "A1JI3XL5ME8CWM", "asin": "0972683275", "reviewerName": "Beakeagles", "helpful": [0, 0], "reviewText": "Great bracket for small TVs.  I used it on a 19\" LCD and it worked well.  The large mounting plate may block some connections on some TVs.  Installed easily and could be adjusted to make level.  The links were very tight and need to be loosened for initial installation.  When the TV is in the desired position, you can tighten them up.", "overall": 4.0, "summary": "Great product for money", "unixReviewTime": 1336435200, "reviewTime": "05 8, 2012"}
{"reviewerID": "AQBLWW13U66XD", "asin": "0972683275", "reviewerName": "Benjamin Belanger \"v dbl u\"", "helpful": [0, 0], "reviewText": "I bought this for a 22\" TV for my son. I mounted this onto the corner stud and it works great! I love the angles it can achieve. Fees Very sturdy and well built. It works perfect for my application. Very happy with this purchase!", "overall": 5.0, "summary": "High Quality/Low Price", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "AUKEU9CW56TT4", "asin": "0972683275", "reviewerName": "B. Kilpatrick", "helpful": [0, 0], "reviewText": "I am using this mount for a 39 inch Vizio TV and it has been great. The installation process was quick and easy and we LOVE the variety of angles that you can get from this mount. We have it on a side wall in our bedroom and we can pull the tv out and move it completely perpendicular to the wall on which it is mounted if we want to. (We don't usually move it quite perpendicular, but it works to do this.)My only complaint is that the joints are a little on the stiff side. It takes quite a bit of force to move the TV from one position to another. It's a little hard for my wife to do-- especially with the TV mounted about 6ft up on the wall. It may be possible to loosen these pivot points, but I have not tried. I'm a little nervous about making it less stable if I do.Overall, it's a great mount. Highly recommended.", "overall": 5.0, "summary": "Easy to Mount; Rock-solid", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"}
{"reviewerID": "A23A7OH3AM0PDA", "asin": "0972683275", "reviewerName": "B. Onat", "helpful": [0, 0], "reviewText": "I installed this for my sister who had a 22\" Philips LCD. Nice sturdy mount, with all of the nuts, bolts, screws included. Only problem was that since my tv was so small, and I was using the most inner mounting hols on the mount, the outside edges of the mount covered both the cable connection, and the power cable connection. Instead of returning, (then paying $70 from a local store) I simply went to a hardware store, got a 1 & 1/2 inch boring tool that attaches to a hand drill, and drilled holes into the mount. It was pretty easy, but a bit messy. It is not visible after mounting the TV, so who cares?? It is one thing to consider before buying this, there may be another mount that does not cover your TV connections. Otherwise swivels well, does not sag, good value.", "overall": 4.0, "summary": "Nice Mount, beware of cable connections", "unixReviewTime": 1296086400, "reviewTime": "01 27, 2011"}
{"reviewerID": "A12AU3CNAWYO5D", "asin": "0972683275", "reviewerName": "bonbon", "helpful": [0, 0], "reviewText": "Didn't think it would work as well as it has,because the metal was a lighter guage thanwe expected, but it hardly deflected from theweight of the TV, even extended straight out.", "overall": 5.0, "summary": "Works like a charm so far", "unixReviewTime": 1356220800, "reviewTime": "12 23, 2012"}
{"reviewerID": "A5O0P0JV6PLU3", "asin": "0972683275", "reviewerName": "bone", "helpful": [0, 0], "reviewText": "very heavy duty construction, extends, tilts perfectlya steal at this pricewill be happy to buy another 1 or 2 if needed", "overall": 5.0, "summary": "deal!", "unixReviewTime": 1353801600, "reviewTime": "11 25, 2012"}
{"reviewerID": "A27X48PMUGK6U4", "asin": "0972683275", "reviewerName": "Boyd", "helpful": [0, 0], "reviewText": "Well constructed wall mount for TV sets up to 37 inches. The mounting  plate has numerous holes for varius sets. Plenty of extra hardware provided. Price was about 1/8th of what it would cost on the open market. I recommend it highly.", "overall": 5.0, "summary": "HD TV wall mount", "unixReviewTime": 1290211200, "reviewTime": "11 20, 2010"}
{"reviewerID": "A2KQDWZZUBBNOJ", "asin": "0972683275", "reviewerName": "Bradley Pool", "helpful": [0, 0], "reviewText": "I used it to mount a 32\" LCD TV to the wall... about 28LBS.  I installed it in less than 1/2 hour and am very happy with the results.PROS:-Comes with all of the hardware you'll need-Comes with some extra hardware of which I have NO IDEA what it is there for.  I suspect it's a 'universal' hardware pack for several models and not all hardware is used for all models, but it's nice to have a little 'extra' (which is always better than not enough!)-The included Level is nice... well it's cheap but it works!-The instructions did a decent enough job of explaining how to install the unit.CONS:-Metal is just a tad on the flimsy side.  I have no problems trusting it with my &lt;30lb television but if I were to mount something closer to its maximum rated weight of 55lbs, I think I would be quite a bit nervous about it holding up.-The holes in the base were just a little bit too wide for my wall stud.  I think the particular stud I was installing it onto was a typical 2X4 and if centered, the left and right side holes were just a little too far to grab both sides of the stud.  I had to reposition it so that the center holes were aligned to the left side of the stud, and that the right side holes were aligned to the right side of the stud.  As a result, I was only able to install four of the six bolts to hold it in place, but I don't feel it will be an issue with my 28LB television.  If your house uses wider studs this probably wouldn't even be an issue.-The metal does sag just a little bit with the weight of the television on it.  I mounted the base just a little bit \"off level\" to help compensate for this, and had no problems getting the television level using the adjustments available to me.CONCLUSION:  All in all It's not a bad unit.. ESPECIALLY for the price.  Yes I would have liked to see a sturdier unit, but when you take into account the &lt;$30 price tag, it's an excellent bargain.  I don't think I'll have any issue with a static mounting of my TV in the corner of the bedroom *BUT* if you are considering installing this unit for a television that will see a lot of traffic, constant repositioning, etc... then you might want to spend more money on something sturdier.", "overall": 4.0, "summary": "It works!", "unixReviewTime": 1306800000, "reviewTime": "05 31, 2011"}
{"reviewerID": "A27XULAA9X5ZGQ", "asin": "0972683275", "reviewerName": "Branon Young", "helpful": [0, 0], "reviewText": "This mount is excellent. It is very well built and sturdy. I used it to mount a 32\" TV and it fit the need perfectly. The price was also very good and much, much cheaper than what an inferior mount would cost in a retail store. I would definitely recommend.", "overall": 5.0, "summary": "Very Pleased", "unixReviewTime": 1329436800, "reviewTime": "02 17, 2012"}
{"reviewerID": "A3IIGCFLKVFW8M", "asin": "0972683275", "reviewerName": "Brian M. Kaplan \"Brian M. Kaplan\"", "helpful": [0, 0], "reviewText": "Works great and is so much cheaper than the more expensive versions at the Big box stores. It is super easy to install yourself too. You just need a drill and a ratchet set to get it into the stud (oh yea a stud finder too).", "overall": 5.0, "summary": "Holds a lot", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"}
{"reviewerID": "A20VSTDILG9K7H", "asin": "0972683275", "reviewerName": "Busy Momma", "helpful": [0, 0], "reviewText": "We bought this for the tv in our gym as it gets moved around a bit.  It's definitely sturdy and works well.  Our tv in there is 24&#34;,", "overall": 4.0, "summary": "Works well", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
{"reviewerID": "A3VKO21KYDJQ2W", "asin": "0972683275", "reviewerName": "C. Aaland", "helpful": [0, 0], "reviewText": "For the price, you can't beat it. Mine didn't come with any of the screws for the TV, but luckily I had some leftover from another mount so I didn't want to bother returning it. Also, not sure what they mean by tilt, but mine doesn't. The arm extends in and out as said, tv swivels left to right, but does not tilt up and down as was my expectation. Otherwise, can't beat it for the price as in Target/Best Buy etc., these are going for $60+.", "overall": 3.0, "summary": "Great for the price.", "unixReviewTime": 1310428800, "reviewTime": "07 12, 2011"}
{"reviewerID": "A1MSO6LERG39PC", "asin": "0972683275", "reviewerName": "cajunjake", "helpful": [1, 1], "reviewText": "Cannot beat this deal anywhere else on the web!  All other retailers are over-priced for what you are getting - a couple pieces of fabricated metal to hold a TV that articulates! This mount is reasonably priced.Pros:  Easy to install (helps to have a cordless driver to drill 6 pilot holes, and to drive in 6 lag screws. You also need to have a stud finder).- Well fabricated- Mount does everything advertised (i.e. articulates - you made need to loosen up some nuts)Con's: Really stretching here since this is a good deal: Instructions could use some help for the \"novice\" DIY'ersInstall tip:  It really helps if you have a second person assisting you for the final step of mounting the flat panel to the TV mountInstalled a 15.5 lbs, 26 Inch Flat Panel LCD (VESA 200mm X 100mm) to this mount. Mount works beautifully! I originally had the TV sitting a little high on a stand, but then the picture was not as good because of the upward viewing angle of the screen (inherent problem with cheaper LCD's - not being directly in front of a LCD screen) - this mount corrected this issue by allowing me to \"tilt down\" the screen.  I would strongly recommend this mount if you are in the market.", "overall": 5.0, "summary": "Outstanding Articulating Wall Mount!", "unixReviewTime": 1347494400, "reviewTime": "09 13, 2012"}
{"reviewerID": "A20Q4FIBCAG2ZV", "asin": "0972683275", "reviewerName": "cameron", "helpful": [0, 0], "reviewText": "This mount is easy to install and very sturdy and is very functional and very affordable for the price. A+", "overall": 5.0, "summary": "great product", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "A1980MGZXSGJP", "asin": "0972683275", "reviewerName": "Captain \"Captain America\"", "helpful": [0, 0], "reviewText": "Works like a charm! Lies flat on the wall when I want it too and pulls out and swivels like a charm when I need it too!The instructions call for it to be mounted into a stud in the wall, however mine is mounted directly into the drywall using heavy duty anchors and it works perfect as well! This is a great product for an amazing price!", "overall": 5.0, "summary": "Great product for a great price!", "unixReviewTime": 1361059200, "reviewTime": "02 17, 2013"}
{"reviewerID": "A1GLL5CJ1SFAMS", "asin": "0972683275", "reviewerName": "Carolyn D \"Carolyn D\"", "helpful": [0, 0], "reviewText": "Easey to put together and install. Used to mount a 37\" LED flat screen. Instuction say to mount the complete unit but if you mount the TV to the back plate on the ground first its a one person job. Well built product for being made in China.wish you could buy American made, better luck next time.", "overall": 5.0, "summary": "wall mount", "unixReviewTime": 1326326400, "reviewTime": "01 12, 2012"}
{"reviewerID": "A2683OJ85CLWFA", "asin": "0972683275", "reviewerName": "Castle", "helpful": [0, 0], "reviewText": "I hung this in my house with great ease and it held up my 8 year old son because I wasn't going to put the 55&#34; flat screen on it to find out that it failed. Fully extends out 2 feet. This was worth the money.", "overall": 5.0, "summary": "Booyah!", "unixReviewTime": 1360454400, "reviewTime": "02 10, 2013"}
{"reviewerID": "A3M6S7Y1FNPOLD", "asin": "0972683275", "reviewerName": "Charlie Troutman \"Charlie\"", "helpful": [0, 0], "reviewText": "Wanted the monitor off of the desk, so we mounted on the wall.  I would have rather had a vertical adjustment as well, but for the price, this unit does the job.", "overall": 3.0, "summary": "for 25&#34; monitor, it worked well", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "AOU1TM9UA1BZF", "asin": "0972683275", "reviewerName": "chicago mom", "helpful": [0, 0], "reviewText": "very secure, we did have to use concrete bolts thought since we were putting it on an outside wall made of lath and plaster with concrete brick on the outside.  One of the best features is there is one piece that attaches to the tv and another that attaches to the wall.  the piece on the tv actually hooks onto the piece on the wall.  I am really happy with this purchase.", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A3S5643F4JNLQQ", "asin": "0972683275", "reviewerName": "chitownrun", "helpful": [0, 1], "reviewText": "I live in a studio condo and I needed something to rotate to see from my bed and my couch on the other side of the main room. Once you figure out which instructions to use (several varieties are included to accommodate different scenarios and tvs), they are pretty thorough. Don't be afraid to tighten specific &#34;joints&#34; and loosen others to get it how you want it.Originally had bought a different one, and be careful of this, but it didn't didn't have near the amount of swing as this one does.", "overall": 5.0, "summary": "Just what I was needing.", "unixReviewTime": 1373587200, "reviewTime": "07 12, 2013"}
{"reviewerID": "AJIA55AVU0CUS", "asin": "0972683275", "reviewerName": "Chris C \"Chris C\"", "helpful": [0, 0], "reviewText": "Holds the TV fine and the articulation is great.  We use it in a downstairs bedroom where we can move it to be seen from the bed or the treadmill.  Has cable mgmt as well.", "overall": 4.0, "summary": "For 22\" LCD", "unixReviewTime": 1364947200, "reviewTime": "04 3, 2013"}
{"reviewerID": "A3C51ESBUD8QAJ", "asin": "0972683275", "reviewerName": "chuckn", "helpful": [0, 0], "reviewText": "Another great buy from Amazon. The local stores wanted twice the money and the other mounts were cheaply made. this mount is made well and you get a free hdmi cable and level with it", "overall": 4.0, "summary": "videosecu articulating wall mount", "unixReviewTime": 1324598400, "reviewTime": "12 23, 2011"}
{"reviewerID": "A3IC6OB22INS9", "asin": "0972683275", "reviewerName": "C. Johansen", "helpful": [0, 0], "reviewText": "Just to know that the TV will sit off center of where the base is placed. Other than that it has held up and worked.", "overall": 4.0, "summary": "product worked as advertised.", "unixReviewTime": 1369353600, "reviewTime": "05 24, 2013"}
{"reviewerID": "A3ISZ8KLXYYI7P", "asin": "0972683275", "reviewerName": "C. Lackey \"Great Product\"", "helpful": [0, 0], "reviewText": "This is the best mount I have ever found, especially for the price.Home Depot has a nearly identical mount for $90.This mount comes with every fastener you could need from Lags, Hollow Wall Anchors, Spacers, to varying lengths of Metric Fasteners to most if not all TVs.They mount easy and are sturdy; I have a 60&#34; LED TV on one without issue.I also have 32&#34;, 42&#34;, 46&#34;, and 50&#34; TVs on them; I have used these to mount every LED/LCD TV I or friends have mounted.", "overall": 5.0, "summary": "Best Mount Ever", "unixReviewTime": 1390348800, "reviewTime": "01 22, 2014"}
{"reviewerID": "A3QH8VQDE7HZCR", "asin": "0972683275", "reviewerName": "costaricachris", "helpful": [15, 19], "reviewText": "Quality was excellent. Instructions were clear. It was not clear about a tilt feature, but there was enough to level it when I finished. Be careful to get the wall bracket real vertical. (I was using it for a 23 inch computer screen so I really need it to be level for reading.) Everything I needed plus lots of extra hardware for different situations.", "overall": 5.0, "summary": "Real value for the money", "unixReviewTime": 1286236800, "reviewTime": "10 5, 2010"}
{"reviewerID": "A6J8D9V5S9MBE", "asin": "0972683275", "reviewerName": "Curtis G", "helpful": [0, 0], "reviewText": "In the process of turning our master bedroom into a fortress of solitude for my wife, we decided to mount ourPanasonic TC-L32X2 32-Inch 720p LCD HDTVon the wall, above the dresser, to save some space. (You can never have enough dresser space for displaying tchotchkes, amirite, fellas?) My wife wanted a fixed wall mount but I thought the viewing angle required some articulation. (In hindsight, fixed would have worked, too.) This unit was highly rated and the price was right. Sold.The installation was straightforward and fairly simple. The only point at which I needed some help was in balancing the TV while I attached it to the arm; otherwise it was all me. I think it looks great; my wife says it reminds her of being in the hospital. (Sorry, Honey.) When we mount thePanasonic VIERA TC-P42S30 42-Inch 1080p Plasma HDTVin the living room, I'll definitely use a flat mount.You could spend four times this much on an articulating TV mount, but I don't see why you would.", "overall": 5.0, "summary": "Simple and effective. Just the way I like it.", "unixReviewTime": 1306886400, "reviewTime": "06 1, 2011"}
{"reviewerID": "A39Z4OU2C7ENWH", "asin": "0972683275", "reviewerName": "Dave C", "helpful": [1, 1], "reviewText": "I gave this mount 3 stars.5 to start because out of the box, and mounted on the wall, I really liked it for my daughter's room. The ability to move her 26\" TV around so she can play in other areas of the room is a welcomed addition.I subtracted 1 star because of the tacky instructions and poor cable management for something that moves at maximum, about 2 feet away from the wall.1 more star fell off because now that the TV is mounted, the mount seems to sag, even though there are two huge lag bolts in a stud mounting it. That parts not the problem, the problem is where the tv mounts to the plate itself, it seems no matter how many washers you use, it just does not make full contact. Also if you move the TV to a new position the mounts seems to want to \"fall\" in that direction on its hinges. SO it must be releveled by yanking on it every time it moves.Otherwise, it works I guess. But for $50 I'd rather have a stationary mount that I never have to worry about. I would not set a tv larger than a 30\" or so on this. I just don't trust it.", "overall": 3.0, "summary": "Works, but I don't trust it", "unixReviewTime": 1328572800, "reviewTime": "02 7, 2012"}
{"reviewerID": "A2E5IK9TUH8UPD", "asin": "0972683275", "reviewerName": "David", "helpful": [0, 0], "reviewText": "For the price, this wall mount is great.  Not too hard to install.  The only reason I didn't give it a 5 star is wire management.  I could not get the little loop to work.  Not a big deal at all however.  Overall, I highly recommend this product.  Well worth the money.", "overall": 4.0, "summary": "Easy to install.  Wire managment is not the best.", "unixReviewTime": 1331078400, "reviewTime": "03 7, 2012"}
{"reviewerID": "AEQR0VUFBZXUY", "asin": "0972683275", "reviewerName": "D. Durbin \"Student of Poetry, Student of Life\"", "helpful": [0, 0], "reviewText": "Needed a corner mounted Flatscreen. This did the job well, easy to install. I had to mount in a metal stud, so I used two support boards in the back to distribute the weight more evenly. Expectations of item met at a fraction of the cost from competitors.", "overall": 5.0, "summary": "Good corner mount", "unixReviewTime": 1363737600, "reviewTime": "03 20, 2013"}
{"reviewerID": "A13BWQDECDDVIZ", "asin": "0972683275", "reviewerName": "D. Jacobs", "helpful": [0, 0], "reviewText": "I'd never bought one of these, mainly due to the high prices in the retail stores.  I hadn't looked online much, and hadn't really needed a monitor mounting device until recently.This thing is well built, and it does the job.  It's not fancy but if you are just looking for an inexpensive way to hang a monitor (TV or PC) on the wall this will do the job.  It comes with a nice bag of heavy-duty hardware.  It is primarily designed for mounting TV sets, but you can get it to work with a PC monitor, as long as it has the VESA mounting.It mainly articulates side-to-side and in-and-out.  It'll pivot a bit up and down, but that's limited.", "overall": 4.0, "summary": "VideoSecu", "unixReviewTime": 1296950400, "reviewTime": "02 6, 2011"}
{"reviewerID": "A12XCRHPREC51Y", "asin": "0972683275", "reviewerName": "DnP", "helpful": [0, 0], "reviewText": "Only gave this four stars because it's only supporting a 32&#34; TV. I think I would be scared to mount a 55&#34; TV on it. If you sprang for a 50&#34; or bigger TV, spend a little more on a properly rated mount. As with any TV mount, make sure you're hitting wall studs with the main screws, don't just use anchors in drywall or you're asking for trouble. LOTS of hardware included in the kit, so mounting any style or brand of TV shouldn't be a problem.", "overall": 4.0, "summary": "Nice mount for the money.", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "A3QPJS71FU70MX", "asin": "0972683275", "reviewerName": "Donald Jones", "helpful": [0, 0], "reviewText": "Nothing fancy, just decent quality and simple installation.  As may have been mentioned, one must discard the provided Phillips screws that the manufacturer provides to affix the bracket to the wall stud.  Use your own.  The TV I mounted with it is an older flat-panel, so it's a little heavier than the news ones.  This thing isn't fazed, and stays where I put it.", "overall": 4.0, "summary": "These mounts are amazing", "unixReviewTime": 1380240000, "reviewTime": "09 27, 2013"}
{"reviewerID": "A2A3B0JX2JRS6S", "asin": "0972683275", "reviewerName": "Dustan Dennington", "helpful": [0, 0], "reviewText": "Amazing how easy it is to move my 46&#34; around on this mount and able to hang off one stud. Nice quality feel to metal it is made of.", "overall": 5.0, "summary": "in love with this mount", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1ZPEZMQBCTZQN", "asin": "0972683275", "reviewerName": "Dusty", "helpful": [0, 0], "reviewText": "Very sturdy. The arm is very stiff at first so you have to work it lose.  However, the mount works great, just make sure you get that stud just right. I was impressed with the quality and happy with the price.", "overall": 4.0, "summary": "Works great.", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A2OGXHE7PVLTOE", "asin": "0972683275", "reviewerName": "D. Wallas", "helpful": [0, 0], "reviewText": "Don't have anything to really complain about.  EXCEPT there doesn't seem to be a way, or i'm missing it to tilt the TV up or down (ie. mounted high on the wall and pointed down towards the chair).  and i am quite savvy with tools/assembly/etc. And it is difficult to get to the bolt heads on the back of the TV to adjust the angle.  No reason to not buy it though.", "overall": 4.0, "summary": "no problems with it.  works as intended.", "unixReviewTime": 1324080000, "reviewTime": "12 17, 2011"}
{"reviewerID": "A3OYE7X2O08LNT", "asin": "0972683275", "reviewerName": "dwilly910", "helpful": [0, 0], "reviewText": "Bought the mount for my 30&#34; Dell U3011 monitor.  It fits the Dell quite well, and I bought it for it's reach from the wall, it's ability to manipulate, and it's weight capacity.  And in all those respects, I'm quite happy.However, there is a noticeable tilt/sag to the monitor when I have the arm extended.  I'm not so concerned with sag perpendicular to the wall, as that was expected, but the rotational sag that I sometimes get.", "overall": 4.0, "summary": "Works good, but has some sag", "unixReviewTime": 1360195200, "reviewTime": "02 7, 2013"}
{"reviewerID": "A2LR9WP2JGDT8E", "asin": "0972683275", "reviewerName": "E. Coronel", "helpful": [0, 2], "reviewText": "The mount plate and the extender arms need to be screwed together and there are two holes for each arm to attach to the corner of the plate. The holes don't align so I couldn't put two screws in. I just used one screw which is not the most secure attachment. Then I used zip ties to secure the arm better. I did this because I had to install the tv ASAP and could not wait for a replacement. Also, the mounting bracket that attaches to the wall has a larger screw hole on the bottom. This means that the bottom can wiggle and the bracket will be misaligned. Again, I did a quick fix. I gave this 2 stars and not 1 because it actually stayed up on the wall and is now holding my tv, albeit due to my own ingenuity and not the quality of the mount. I should not have to do quick fixes on a product like this.", "overall": 2.0, "summary": "screw holes don't align", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "A18FTRFQQ141CP", "asin": "0972683275", "reviewerName": "ela92", "helpful": [0, 0], "reviewText": "VERY HAPPY, it looks great, I'm so happy we got it. Holds good, it is a lil hard to get it to the wall. Other then that its fine I love how we have more room in our room. My husband is so happy I ordered this, it only cost us $28 free shipping and FAST(: VERY THANKFUL TO THE SELLER.", "overall": 5.0, "summary": "SAMSUNG 32in PLASMA(: DOES THE WORK FOR US ( FAST SHIPPING!!!!!!!!)", "unixReviewTime": 1332028800, "reviewTime": "03 18, 2012"}
{"reviewerID": "A1XEYWWDJ09OEA", "asin": "0972683275", "reviewerName": "Eric Fleckenstein", "helpful": [0, 0], "reviewText": "I wasn't willing to pay $100 for simply mounting a TV, so I bought this item to give it a shot. I have no real complaints.  It holds the TV up, which is all I wanted.  It does not have smooth pivot points, so if you're planning on moving it around a lot, don't use this one, but if it's going to stay in a static area, this is your mount.", "overall": 4.0, "summary": "Great mount for the price", "unixReviewTime": 1297468800, "reviewTime": "02 12, 2011"}
{"reviewerID": "A2JMN2JA9LSHVL", "asin": "0972683275", "reviewerName": "Eric G. Gruner", "helpful": [1, 2], "reviewText": "Bought NEW but I could tell right away that mine had been repackaged and refurbished.  Plus the was missing the 4 arms but had some other random hardware included.  I made mine work for my 32&#34; set and it serves it's purpose. Just wish the seller was upfront on the condition, I could have bought a used one for $5 less.", "overall": 1.0, "summary": "Bought NEW Stand for $25, but mine had the 4 arms missing and was refurbished", "unixReviewTime": 1354320000, "reviewTime": "12 1, 2012"}
{"reviewerID": "A3ATF868IEP191", "asin": "0972683275", "reviewerName": "Eric", "helpful": [0, 0], "reviewText": "This is a rather good tv mount. This tv mount works exactly as expected and described. I would buy again.", "overall": 4.0, "summary": "good mount", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}
{"reviewerID": "A14O9P3DV5EHKO", "asin": "0972683275", "reviewerName": "E. Solch", "helpful": [0, 1], "reviewText": "I had to use a hacksaw to cut away part of this to hang my 24&#34; LED TV in my bedroom. Other than that, seems to work fine.", "overall": 3.0, "summary": "A little big for 24&#34; TV's", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "AVHB9LLVCTEKY", "asin": "0972683275", "reviewerName": "Evan Caltrider", "helpful": [0, 0], "reviewText": "I have a 42&#34; Hannspree LCD TV. It weighs 42.5 lbs. Most other reviews said they had a TV smaller than this so I was a little skeptical but got it because of the good price and it said it could hold 60 or so lbs. Most of my reservation was because it was the first time I've mounted a TV and worried it would fall within a week. I've had it over a month and its nice to have it be able to swing out, extend, and angle. I like the fact that I can get a bigger TV and still use this mount as its in my living room. It was not too hard to install. I bought a stud finder because I didn't have one and most everything else I already had to install it. I do highly recommend recruiting some help with the install, at least for when putting the TV on. This would be extremely hard by yourself, especially if you have a bigger TV. Overall, very happy with this mount.", "overall": 5.0, "summary": "Good and versatile", "unixReviewTime": 1375142400, "reviewTime": "07 30, 2013"}
{"reviewerID": "A2GPNXFUUV51ZZ", "asin": "0972683275", "reviewerName": "Farmer-Al", "helpful": [0, 0], "reviewText": "Installed easy and in no time at all (finding the stud was the hardest part for me).  Articulates well with the 40&#34; TV on it. I would not hesitate to look for this brand when it is time for the next TV mount.", "overall": 5.0, "summary": "Easy install, great price, good performance.", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A3CLWR1UUZT6TG", "asin": "0972683275", "reviewerName": "FD Firefighter 121 \"Remember the 343\"", "helpful": [0, 0], "reviewText": "I have two of these now in different rooms. Works well with my Samsung TV'S  for the size noted above", "overall": 5.0, "summary": "Works well", "unixReviewTime": 1373587200, "reviewTime": "07 12, 2013"}
{"reviewerID": "A1V8UZ63FQD382", "asin": "0972683275", "reviewerName": "FL Guy \"FL Guy\"", "helpful": [0, 0], "reviewText": "We got this one recently and its a great wall mount. The unit is pretty heavy, so you will need a helper. It also includes a variety of screws to mount also. Our TV documentation stated it was a 400x400 pattern. But after putting hte plate over the back, seems we didn't need the extra extenders as its 200x200. This is on a Samsung 40&#34; 5000 series LEDTV.The arm is hard to push and pull, but that is more due to being new and stiff. Make sure you adjust the tilt angle screws as our unit came with them loose so we had to tighten them.I initially was scared to mount it (what if it falls if I screw up!!!) but its pretty easy. Not only did i use a stud finder to get the general location of the stud, but i also used nails to get the actual edges (those basic studfinders are never &#34;exact&#34;). make sure you do the same.not bad for $30-ish", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1376870400, "reviewTime": "08 19, 2013"}
{"reviewerID": "A3Q7DHKIU7TMBI", "asin": "0972683275", "reviewerName": "follownobody", "helpful": [0, 0], "reviewText": "this is a good product.  It went up easily.  I did it myself.  I wish I might have gotten one with a little more adjustment.  It's very rigid.", "overall": 4.0, "summary": "for my office tv", "unixReviewTime": 1357171200, "reviewTime": "01 3, 2013"}
{"reviewerID": "AOOQGCJEV25VT", "asin": "0972683275", "reviewerName": "Frankie", "helpful": [0, 0], "reviewText": "I have purchased 3 of these wall mounts and they hold my 37 and 32 inch flat screens perfectly. I love these and highly recommend them.", "overall": 5.0, "summary": "One of the best wal mount sets ever!!", "unixReviewTime": 1355184000, "reviewTime": "12 11, 2012"}
{"reviewerID": "A24OHQK700QEIW", "asin": "0972683275", "reviewerName": "Fredy", "helpful": [0, 0], "reviewText": "Very good item; I am happy wit it, and delivery time was excellent!!  I recomended; is a good support for your LED TV. It is easy to install, and it have extra screws for different sizes TV.", "overall": 5.0, "summary": "Very good!!", "unixReviewTime": 1335916800, "reviewTime": "05 2, 2012"}
{"reviewerID": "A3T3M5EYGCWSUA", "asin": "0972683275", "reviewerName": "Frequent Amazon Customer", "helpful": [0, 0], "reviewText": "This was perfect for my 24\" LED monitor, I had it up in just a few mins and with no problems.  It included a small bubble level and it also came with a 6' HDMI cable which I was not expecting.", "overall": 5.0, "summary": "Strong/Easy install/ and comes with HDMI cable also!", "unixReviewTime": 1309564800, "reviewTime": "07 2, 2011"}
{"reviewerID": "A38FGQVJM18OWV", "asin": "0972683275", "reviewerName": "George S. Mitchell \"gsmitchell\"", "helpful": [8, 18], "reviewText": "I checked around Amazon as well as some other sites, and decided these were what I needed.  I read the reviews, looked at the pictures and bought two of these.  I received them today.  I unpacked one of them, read the instructions and immediately filled out the return request for Amazon.  These mounts are very, very heavy and require 6, yes SIX, screws to mount to the wall.  Are you kidding me?  The TVs are only 22 lbs!  Two screws in the studs and then more damage to the wall than is necessary.  What a joke!  And Lag bolts?  Ever heard of screws?  The other issue is that these are very hard to move.  I bought an articulating wall mount for a reason, and I expect them to be able to move without a wrench in my hand.", "overall": 1.0, "summary": "What a piece of junk!", "unixReviewTime": 1291161600, "reviewTime": "12 1, 2010"}
{"reviewerID": "A1CA40102FA5N0", "asin": "0972683275", "reviewerName": "Gerald Wendel", "helpful": [0, 0], "reviewText": "Installed easily, has a nice long reach.  Attached a 32&#34; TV for the grandkids and it works out great. accomodates many different size TV's and was a very good price.", "overall": 5.0, "summary": "Nice reach", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "A12PFARGH9ELDI", "asin": "0972683275", "reviewerName": "G. Kelly", "helpful": [0, 0], "reviewText": "For the price.....can't be beat.  I have two TV's hanging in the living room.  No issues, easy to hang.  I would recommend to a friend.", "overall": 5.0, "summary": "For the price, can't be beat.", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}
{"reviewerID": "A1P560UNX4SBE7", "asin": "0972683275", "reviewerName": "goatbear2", "helpful": [2, 2], "reviewText": "Works Great. Holds my 40 inch TV effortlessly. Very well built. Definitely worth the price. Easy to install TV to the mount. Has cord clips. TV can be tilted up or down and sideways. Extends from the wall 24 inches. I highly recommend this brand..", "overall": 5.0, "summary": "Samsung TV wall Mount", "unixReviewTime": 1382400000, "reviewTime": "10 22, 2013"}
{"reviewerID": "A28RVT20CEXA8B", "asin": "0972683275", "reviewerName": "Golfore", "helpful": [0, 0], "reviewText": "Used this with a Panasonic 22 inch LCD. Very durable and works as advertised.It was advertised as fitting 22\"-37\" televisions, but the size of the t.v mounting plate is so large that it covers some of the plug connections on the back of the television. I will have to cut the metal plate to get to the P.C connector if i choose to connect a computer.Haven't decided if i will keep or send back to get something with a smaller mounting plate.Other than that, it's a great product and meets my need for a hanging television.", "overall": 4.0, "summary": "Durable", "unixReviewTime": 1295654400, "reviewTime": "01 22, 2011"}
{"reviewerID": "A27OMVFGJXH1VB", "asin": "0972683275", "reviewerName": "Goneanddidit", "helpful": [0, 0], "reviewText": "I have a 47&#34; TV and had no place to put it in my bed room. With this mount it use the space i had a poster hanging. Very easy to install, came with all hard ware.", "overall": 5.0, "summary": "Got Room?", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A3E4YU6APQLRKE", "asin": "0972683275", "reviewerName": "Green_Steve", "helpful": [0, 0], "reviewText": "Great Mount, so many areas of articulation. This was a great gift idea my mother loves it. I have purchased two of them and they are sturdy and give a touch of class to every room you put them in. A must have any video file or those who want to save space in a bedroom or office.", "overall": 5.0, "summary": "One more elegant solution for the home or office.", "unixReviewTime": 1384646400, "reviewTime": "11 17, 2013"}
{"reviewerID": "A1N4DKWTQ9YP1Q", "asin": "0972683275", "reviewerName": "Heidi L. Rathbone \"HLR61\"", "helpful": [0, 0], "reviewText": "This is perfect for what I needed it for. I can move the screen from side to side if I need to and I don't have the TV sitting on my desk.....", "overall": 5.0, "summary": "Wall Mount", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
{"reviewerID": "AD0VA39FRVNKN", "asin": "0972683275", "reviewerName": "HM", "helpful": [0, 1], "reviewText": "have not had the opportunity to install the tv mount as of yet - will follow up once mounted in place. great price and quick shipping", "overall": 5.0, "summary": "Vide Swing Arm tv mount", "unixReviewTime": 1360627200, "reviewTime": "02 12, 2013"}
{"reviewerID": "ABM9CL72EGWKN", "asin": "0972683275", "reviewerName": "Hold Fast", "helpful": [0, 0], "reviewText": "Why pay the $$$$ at Best Buy when you can get the same products for a fraction of the prices here.  The VideoSecu Long Arm TV Wall Mount Low Profile Full Motion works great.", "overall": 4.0, "summary": "Good Product", "unixReviewTime": 1383782400, "reviewTime": "11 7, 2013"}
{"reviewerID": "A3A7ZJ4QS65X15", "asin": "0972683275", "reviewerName": "Isaac LePes", "helpful": [0, 0], "reviewText": "Pro's: Easy to setup.  Supports many different VESA formats. Has some articulation.  Sturdy construction.  Can be installed by one person w/o too much effort.Con's: Cable guides fall off easily.  The joints are a bit too stiff; you really have to man-handle it to get it fully extended, and you have to push fairly hard to get it to compact again.  So far I have not noticed any wear from this firm pulling/pushing, but I worry because it is only attached to the studs buy 2 bolts.", "overall": 3.0, "summary": "Bought to mount 46\" LCD", "unixReviewTime": 1360281600, "reviewTime": "02 8, 2013"}
{"reviewerID": "A110S8IJ3ZID0D", "asin": "0972683275", "reviewerName": "Jake", "helpful": [0, 0], "reviewText": "We bought this for a 55&#34; Vizio and it worked perfectly. I would buy it again and recommend it. Good quality.", "overall": 5.0, "summary": "Worked great for 55\" Vizio", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A11NR4AJK9TNQM", "asin": "0972683275", "reviewerName": "jaldeborgh \"jaldeborgh\"", "helpful": [0, 0], "reviewText": "I am impressed with the solid design of this TV Wall Mount.  I think this weights more than the 26\" TV it is supporting.  It also has lots of logical adjustments so leveling the TV isn't too difficult.  The one semi negative is that it takes a fair amount of force to reposition the TV.  This does assure the TV stays put but if you plan to move the TV on the stand a lot this may be a negative.  Overall I am pleased with the stand - it seems like a good value.", "overall": 4.0, "summary": "Solid Design - Adjustable", "unixReviewTime": 1311552000, "reviewTime": "07 25, 2011"}
{"reviewerID": "A13M65IGNEQXW1", "asin": "0972683275", "reviewerName": "James", "helpful": [0, 0], "reviewText": "I bought the uint for a 32 &#34; Tando.  I couldn't get the parts to line up so I bought another fixed type.", "overall": 3.0, "summary": "Didn't fit as I expected", "unixReviewTime": 1359158400, "reviewTime": "01 26, 2013"}
{"reviewerID": "A180BZHVJIRWBZ", "asin": "0972683275", "reviewerName": "James Mac", "helpful": [0, 0], "reviewText": "Very well made, strong mount the only problem I have is the instructions are very poorly written or detailed. Pictures do not distinguish between Stud mount and concrete. Also the instructions do not tell you the size of the included boltsFor those of you who have never worked in the home building industry wall studs are usually 1.5 inches wide so this mount only requires 2 lag bolts in the middle holes to secure it to the wall to support a 23 lb TV. The four outboard holes on the wall mount are 1.3\" apart so don't try to use them in a wall stud measuring 1.5\" wide.Helpful hint: I have help install at least 6 other wall mounts because of family or friends so I cannot say that I am an expert but my suggestion is to drill pilot holes which the instructions do not tell you to do.After comparing the instructions on this unit to others I have installed I still must say that the pictures should have a lot more detail. Some complain that the back plate was too big for the TV they used but it's fits perfect on theLG 32LK450 32-Inch 1080p 60Hz LCD HDTVI am using it on.Works perfectly for the area of the room I am using it in which allows me to rearrange the room without the need to move the TV.", "overall": 4.0, "summary": "Very well made, strong mount.", "unixReviewTime": 1319241600, "reviewTime": "10 22, 2011"}
{"reviewerID": "A1R2514DVWIIMV", "asin": "0972683275", "reviewerName": "Jamie Richardson", "helpful": [1, 1], "reviewText": "Perhaps I misunderstood how to install the mount, but I:1) Installed the mount to the wall (easy enough)2) Attach TV the mount with some screws (difficult for one person)With one arm I held the TV (heavy!). The other arm was trying to attach some small screws connecting the TV to the mount. It took quite an effort to hold the TV for that long. Certainly having two people installing this would be waaaay easier :-)I have another similar mount where the TV back plate and the mount are separate parts. So once the back plate is installed, you slide the connecting parts together. Much easier! :-)", "overall": 4.0, "summary": "Solid, but not the best mount I've had", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}
{"reviewerID": "A1KM3IPZ9H0JKZ", "asin": "0972683275", "reviewerName": "J. A. Quayle", "helpful": [0, 0], "reviewText": "It took about 10 mins to install this TV Wall Mount with a 48 inch Samsung TV.  It does the job, there are much more expensive arms, but this does the trick.", "overall": 4.0, "summary": "Easy to install, cheap, easy to use", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "AZ6SUJ5T0KBE5", "asin": "0972683275", "reviewerName": "Jason", "helpful": [0, 1], "reviewText": "I used this to hang my 40&#34; LCD that I bought back in 07, so it's a heavy TV that outweighs my new 50&#34;.  Everything seems to be made well, it was easy to install myself, and the TV has been hanging for 2 months now from a brick wall at it's full reach.  I can't imagine paying $100 for other TV wall mounts, as well as this one performs.", "overall": 5.0, "summary": "Great bargain!", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A7EVWY97FPSIA", "asin": "0972683275", "reviewerName": "Jasson from GA", "helpful": [0, 0], "reviewText": "you can't beat the price and the installation was simple as can be. We installed it in our office and it is perfect! no problems and was completed in a matter of minutes", "overall": 5.0, "summary": "Awesome!", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "A1VM0DU10K0DE6", "asin": "0972683275", "reviewerName": "J. Davis \"WildBlue High-speed Satellite Fan\"", "helpful": [0, 0], "reviewText": "Totally love this product!! I bought two - one for living room, one for bedroom.  I decided to try my hand in the bedroom first (in case I got frustrated and didn't finish the project).I've gotten items needing to be assembled before with all the hardware in one bag -- not so with this product!!  I'm impressed! Every nut, bolt, screw, washer, etc. is clearly packaged (individually by size and labeled!)The Arm also comes assembled -- which I disassembled for easier handling (the wall plate is attached to the Arm with two Carriage Bolts / easy to remove and makes holding in place while bolting to the wall a breeze).Took me 1-1/2 hours from start (gathering my tools) to finish (hanging the TV)  Oh, and I'm a 56 yr old disabled female.  I do have a  lot of construction/tool knowledge however.", "overall": 5.0, "summary": "What's the word for better than great???", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1VA1QF8KZNBLL", "asin": "0972683275", "reviewerName": "Jeff Lawrence", "helpful": [0, 0], "reviewText": "UPDATE: I have now have purchased 3 of these for work and home and with the lighter LED TV's this is a perfect mount for most sizes - this is a great mount - easy to install - easy to use - easy to expand - easy to mount TVs. I havent found another one that is so useful - even if you dont need it to extend this is still a great mount--- I guess for the price I was expecting something cheaper but I was quite surprised. It was easy to install and works for what I need it for - it may be over kill for a 22 inch LED LCD TV but I like the way it can be moved around.", "overall": 5.0, "summary": "the only mount I will buy", "unixReviewTime": 1293580800, "reviewTime": "12 29, 2010"}
{"reviewerID": "A1QKUDP9EUHJXH", "asin": "0972683275", "reviewerName": "Jennifer Ingberg", "helpful": [0, 0], "reviewText": "Used this for the bedroom. Put it in the corner but was only able to hit the stud with a couple bolts.", "overall": 4.0, "summary": "Insignia", "unixReviewTime": 1367193600, "reviewTime": "04 29, 2013"}
{"reviewerID": "A3TAS1AG6FMBQW", "asin": "0972683275", "reviewerName": "Jeri Zerr \"formerly a Road Warrior of the Nth...", "helpful": [0, 0], "reviewText": "The VideoSecu line of articulating wall mounts has become our standard of choice for high quality articulating wall mounts within our home.  The value is such that the convenience of having an articulating wall mount for connecting or reconnecting cables is well worth the few bucks required to mount our HDTVs conveniently to the wall.  Highly recommend this great quality product. This wall mount will secure any of the HDTVs using the VESA 100 or VESA 200 mount pattern. We like to use a mount on the larger end than actually needed so if we later upgrade the HDTV with a larger size there's a much better chance we won't need to replace the articulating mount.", "overall": 5.0, "summary": "High quality construction, comes with plenty of easy to install hardware.", "unixReviewTime": 1353456000, "reviewTime": "11 21, 2012"}
{"reviewerID": "A2T4OX8NH9LIIC", "asin": "0972683275", "reviewerName": "J. Hornback \"twister\"", "helpful": [0, 0], "reviewText": "you can spend a ton of money on one of these, or you can buy this one.  hung a 32 inch tv with it with no problems.", "overall": 5.0, "summary": "works great", "unixReviewTime": 1358553600, "reviewTime": "01 19, 2013"}
{"reviewerID": "A3VSGMP5KCQ4Q2", "asin": "0972683275", "reviewerName": "Jim A", "helpful": [0, 0], "reviewText": "This is a really well made and engineered product which should be twice the price. It has every kind of leveling and tilting adjustment you could want, and a nice finishing piece that goes over the wall plate and lag bolts.  The mounting process can't be rushed and planning everything out before you start makes all the difference. Just make sure you find the middle of a wall stud for the lag bolts.It easily managed a 47&#34; led lcd which weighs 35lbs, and it might take the extra 10-12 lbs of a 55&#34; led lcd if it's not pulled too far from the wall. Since it can swing out over 20&#34; I'd be carefull about going bigger than the 35lb 47&#34; tv that I mountedThe only thing which was dissappointing were the two plastic wire holders which are junk (very flimsy, one was broken in the package) and shouldn't be included when simple black wire ties work far better.", "overall": 5.0, "summary": "Great quality tv mount at bargain price", "unixReviewTime": 1366243200, "reviewTime": "04 18, 2013"}
{"reviewerID": "A2RUN82QPU60PN", "asin": "0972683275", "reviewerName": "Jimbo", "helpful": [0, 1], "reviewText": "My flat screem computer monitor is very light and didn't need such a heavy duty mount.  The product is fine and would work for monitors much larger and heavier than my 20&#34; LED", "overall": 3.0, "summary": "Much heavier than I expected", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A2W75LE521OOTH", "asin": "0972683275", "reviewerName": "Jim", "helpful": [0, 0], "reviewText": "The mount I purchased is great. It is designed for TV's 32&#34; and under. The link here, and image are not correct. But, I really thought the mount was build well, was easy to install, and the price was fantastic.", "overall": 5.0, "summary": "Great product, but review and image not linked to the unit I purchased.", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "A1PYNMFFQ9IBNL", "asin": "0972683275", "reviewerName": "Jim", "helpful": [0, 0], "reviewText": "Tv has been on wall for a long time.  Hasn't fallen off.  It's metal and considerably cheaper than kits available in stores.", "overall": 5.0, "summary": "Tv mount", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "ANJY75Z24A6AG", "asin": "0972683275", "reviewerName": "Jimmy Wissman", "helpful": [1, 1], "reviewText": "This is exactly what I needed.  It was easy to mount and supports my 40 inch TV (26 lbs) without any issue.  I haven't tested the extension brackets, but the rest of the device is very solid.  I will say that the hinges can be a bit tight, and it's not designed to be easily adjustable on the fly (you'll need a few tools).  If you plan on swinging your TV around a lot, this might not be the best choice, but it works perfectly fine if you only need to adjust it every now and then.  My favorite part is the small base.  I didn't have a lot of wall space to mount a TV, and this met my needs without eating all my money.  Keep in mind that you'll want at least two people to mount the TV on this device.  I attached my TV alone by precariously balancing it on a stack of boxes while I inserted the screws.  Speaking of which, I've mounted two TVs on this, and the box included screws which fit both (in addition to many more).  However, you may need a few more washers.", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1363305600, "reviewTime": "03 15, 2013"}
{"reviewerID": "AYYNNAEWP3W5Y", "asin": "0972683275", "reviewerName": "JMH", "helpful": [0, 0], "reviewText": "This TV mount I bought for just $25 easily outdoes similar ones that cost over $100! It comes preassembled, is easy to mount on the wall, and has clear instructions. It also features a wire holder and cover for the screws on the wall. The joints are a little bit stiff, but with use and maybe a drop of oil this shouldn't be a problem. Definetely a great buy at a agreat price!", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1322870400, "reviewTime": "12 3, 2011"}
{"reviewerID": "A2XXCJLS58H1A7", "asin": "0972683275", "reviewerName": "J. Miller", "helpful": [0, 0], "reviewText": "I have purchased this mount twice now - one for my bedroom TV, and one for my living room TV.  The bedroom TV is a 35\" LCD, and the TV in the living room is a 55\" LED.  (Surprisingly enough, they both weigh 50 pounds...)  This mount works very well for both of them.  It's relatively simple to install - you just need to find a stud and screw the support in to it.  (I will admit that my bedroom TV has been attached not to a wall stud, but a jury-rigged support brace on a cabinet.  It's still there and attached after 6 months.)I will say that the joints in the arms are quite stiff - it can take a little muscle to move the TV.  But I think I prefer that - it certainly doesn't feel flimsy, and it stays wherever I put it.A tip for would-be purchasers: make sure your TV supports this mount.  You can usually find your compatible VESA patterns in your user's manual.  (Or a quick online search, perhaps.)  As I often say - when buying online, it pays to do your homework.", "overall": 5.0, "summary": "If I had 3 TVs, I'd buy a 3rd", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A3DOQ1AI1MU74K", "asin": "0972683275", "reviewerName": "jmindito", "helpful": [0, 0], "reviewText": "Amazon as always 5 stars in service and shipping.The mount was for a VIZIO E260MV 26-Inch. Product comes adequate with a lot of screws, an Alan key and standard nut key that fits all the nuts. The bubble level (with magnet on the side) and cable are a nice addition.Had to cut 1 inch from the top and bottom of the base that gets screwed no to the TV, since it covered some of the inputs. Other wise very practical for my bedroom/Study that has more width so the convenience of swirling is why we wanted this and it does a good job.For the price ($25 and free shipping), its is a really good deal. Would recommend this.", "overall": 4.0, "summary": "Nice Flexiable mount, had to cut to fit VIZIO E260MV 26\"", "unixReviewTime": 1320883200, "reviewTime": "11 10, 2011"}
{"reviewerID": "A2I87F2QCJ6RK3", "asin": "0972683275", "reviewerName": "John Culpepper", "helpful": [1, 1], "reviewText": "This device is somewhat weak even for the 46 inch TV weighing only 31lbs that I'm using it with. after some adjusting it's working ok.", "overall": 3.0, "summary": "Somewhat weak", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "A2EOJNVW4NF4AE", "asin": "0972683275", "reviewerName": "John F", "helpful": [0, 0], "reviewText": "Easy to install and the TV is still on the wall after three weeks! I consider this a good value for the money", "overall": 4.0, "summary": "Good value for the money", "unixReviewTime": 1300665600, "reviewTime": "03 21, 2011"}
{"reviewerID": "AB31FF0JMPOUP", "asin": "0972683275", "reviewerName": "Johnson", "helpful": [0, 0], "reviewText": "Very easy to setup, simple instructions, has all the mounting hardware and fits a huge different variety of TV's with great support.", "overall": 5.0, "summary": "Very easy to setup.", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "A10S9NK38WEQ65", "asin": "0972683275", "reviewerName": "John Vesik", "helpful": [0, 0], "reviewText": "Very concerned over hanging a 46&#34; tv on the wall.  Got this mount due to low price.  Very impressed.  No doubt it will handle a 30# TV.  Allows full 90 degree rotation with 21&#34; from wall to centerline at maximum extension.", "overall": 4.0, "summary": "Very sturdy.  As advertised", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A56AUIA2KJ3KQ", "asin": "0972683275", "reviewerName": "Jonathan C. Ross", "helpful": [0, 0], "reviewText": "Another gem hidden amoungst the Amazon halls. This works well for my LED tv's. I used the heavy duty mount bolts for mounting my tv on the back porch. I hung on the sucker and it's not coming down. And I'm 190lbs!", "overall": 5.0, "summary": "Perfect, sturdy, and works well.", "unixReviewTime": 1355443200, "reviewTime": "12 14, 2012"}
{"reviewerID": "A22UL4BXTSXSCB", "asin": "0972683275", "reviewerName": "jongbhak", "helpful": [0, 0], "reviewText": "It needs improment. I wish it has one more hole to put a screw on the wall.It looks shaky for 55 inch TV. However, it still holds it.", "overall": 4.0, "summary": "It is holding 55\" samsung TV, still.", "unixReviewTime": 1374192000, "reviewTime": "07 19, 2013"}
{"reviewerID": "AD3L2C20LB7EP", "asin": "0972683275", "reviewerName": "jose", "helpful": [0, 0], "reviewText": "quickly shipped to my house and mounted myself. i ordered this for my 32 inch Phillips LCD tv and for the price i paid its a great value. does the job that any other higher priced wall mounts can do. would recommand", "overall": 5.0, "summary": "VideoSecu Tv wall mount", "unixReviewTime": 1303084800, "reviewTime": "04 18, 2011"}
{"reviewerID": "A2UT34LEOXUR33", "asin": "0972683275", "reviewerName": "Jose Robaina", "helpful": [0, 0], "reviewText": "Very good materials, very lightweight,  cheaper than others brands. I have a 47&#34; LG Led tv and it fit at 100%, and I'm capable of sell my tv, buy an 55&#34; and use the same mount without problems.", "overall": 5.0, "summary": "Very good material.", "unixReviewTime": 1374278400, "reviewTime": "07 20, 2013"}
{"reviewerID": "A39KBWLS6TURMR", "asin": "0972683275", "reviewerName": "Julie Miller", "helpful": [0, 0], "reviewText": "Made in china, but this time , its well made. nice and sturdy and lots of options to mount differenct type of LCD. It has a good viewing set of angles and can be adjusted just about any view you want. the value for cost here is big, since most of these sale for over 75.00, or over 100.00 at wm. im pleased with it.", "overall": 5.0, "summary": "Made in R.o.C., but good for once", "unixReviewTime": 1334966400, "reviewTime": "04 21, 2012"}
{"reviewerID": "ALVJCD5NY28G4", "asin": "0972683275", "reviewerName": "Just a dude", "helpful": [0, 0], "reviewText": "Mount went up easily and seems sturdy enough.  However, adjusting the TV sometimes leaves the TV crooked.  Also, it is almost impossible to adjust tilt without using the provided tools.  Even after using the tools, we couldn't really adjust the tilt to the full amount.", "overall": 4.0, "summary": "Good sturdy mount, however could be better", "unixReviewTime": 1292803200, "reviewTime": "12 20, 2010"}
{"reviewerID": "ATWPVC644K29Z", "asin": "0972683275", "reviewerName": "Just a Regular Guy", "helpful": [0, 0], "reviewText": "Great functionality, really incredible price, and a snap to install.  Honestly, ridiculously good product - wish they were all so easy.", "overall": 5.0, "summary": "Can't beat it", "unixReviewTime": 1370822400, "reviewTime": "06 10, 2013"}
{"reviewerID": "A2LME30OB5OHTN", "asin": "0972683275", "reviewerName": "Jwalsh62", "helpful": [0, 0], "reviewText": "Quick and easy installation - very solid product. Very pleased with this purchase.When in need of this type mount again I will certainly purchase this brand/model again.Great price on Amazon makes it very easy.", "overall": 5.0, "summary": "Quick and Easy - very solid", "unixReviewTime": 1335484800, "reviewTime": "04 27, 2012"}
{"reviewerID": "A1EWQ5Y6HHSJGX", "asin": "0972683275", "reviewerName": "J. Watts \"JLW\"", "helpful": [0, 0], "reviewText": "Excellent buy! We are very pleased with this item. It performs very well. The instructions were clear. It was easy to assemble. It holds a 47&#34; TV very well.", "overall": 5.0, "summary": "Great Wall Mount", "unixReviewTime": 1386460800, "reviewTime": "12 8, 2013"}
{"reviewerID": "A120ULF73SUTI9", "asin": "0972683275", "reviewerName": "J. W. Kennedy \"kennedy610\"", "helpful": [2, 2], "reviewText": "Warning, Do your homework before ordering a tv wall mount!!Mom and dad bought a 32 inch Seiki TV and needed it angled on the wall for optimum viewing. That is where I the eldest son came into the picture(pun intended).I knew in advance the location had plywood backing behind the drywall, which meant this mount would be easy to install as wood screws would be secure anywhere on the wall. But what if it was a typical installation, would there be a stud in the wall centered where needed to hold the tv and mount securely? It seems unlikely most people would, so what are the options?Option #1. Buy a different mount with a mounting plate rather than small 2 hole bracket as on this model. If you don't know what I am talking about, look at other tv wall mounts and you will see on many of these a large wall plate that can easily cover an area with at least one stud, and addtionally allow drywall anchors elsewhere on the plate to handle the weight of any tv. This model has only a small wall bracket with holes for 2 screws or anchors.Option #2. Use wall anchors. Again, there are only 2 holes in this bracket so take into account the weight of the tv and the rating of the anchors. Proceed at your own risk.Option #3. Install a stud. You're on your own with this...The mount is well made, everything fits and it looks good but as mentioned, a little homework will save you time and make installation easy.I hope this review is useful. :-)", "overall": 4.0, "summary": "Well made, Excellent Value", "unixReviewTime": 1363305600, "reviewTime": "03 15, 2013"}
{"reviewerID": "A4AF29Y2BHYEY", "asin": "0972683275", "reviewerName": "Kadambari Kiranmayi", "helpful": [0, 0], "reviewText": "Too Heavy and Poor weld quality .Lot of blow holes in welding, though painting was made nice to cover it or else it was made with inefficient welder. I think this is is not well designed by experts. Hope no calculations are involved in making it. Just copied the shape forms some other manufacturer.", "overall": 3.0, "summary": "Too Heavy and Poor weld quality,", "unixReviewTime": 1376784000, "reviewTime": "08 18, 2013"}
{"reviewerID": "A6FGKXU6ZPW64", "asin": "0972683275", "reviewerName": "Kado", "helpful": [0, 0], "reviewText": "i bought a funky double hinged wall mount from amazon and it did not work. I went to best buy and they said to purchase this $350 wall mount they had, I snagged a pic of the measurements and extension ability from the box, came home and found this one to be near similar. Needless to say I now have my 47 in LG flat screen securely mounted and sitting pretty in the corner of my living room.", "overall": 5.0, "summary": "Fantastic Mount for Corners", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A1463ASM7QMU2I", "asin": "0972683275", "reviewerName": "Kazap \"Steeler Fan\"", "helpful": [0, 0], "reviewText": "I have 3 swivel mounts and this one is not the best. If you don't use the swivel feature frequently or don't place it where it may be bumped it will do the job. I prefer the strength and stability offered by mounts which have TWO arms extending from a longer wall bracket. These more stable brackets can be found at similar or slightly higher prices. Also look for a feature which allows the TV Bracket (and TV) to be lifted off the swivel arm more conveniently.", "overall": 3.0, "summary": "It's OK", "unixReviewTime": 1326412800, "reviewTime": "01 13, 2012"}
{"reviewerID": "A2BLGQ2SCSKCCY", "asin": "0972683275", "reviewerName": "KENANTHONYREPAIR", "helpful": [0, 0], "reviewText": "JUST IN STALL ANOTHER SAMSUNG 55&#34; LED FLAT SCREEN. OUTSIDE A  PATIO DECK AREA WHAT A DIFFERENCE THIS UNIT MADE.THE MOUNTING KIT WAS VERY EASY TO USE. AGAIN I DID UPGRADED TO  USING LONGER HEAVIER MOUNTING BOLTS. THAT WAS ONLY $1.00 MORE BUT IT'S WORTH IT IN THE LONG RUN. HERE IN EARTHQUAKE COUNTRY YOU NEES THAT SUPPORT. YOUR FLATSCREEN TV RETRACTS A FEW INCHES OFF THE WALL PLUS IT WILL LOOK SWEET FROM 2&#34; TO 24&#34; FROM WALL AREA", "overall": 5.0, "summary": "SWING ARM WALL MOUNT", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
{"reviewerID": "A21OS6PWQG5YOO", "asin": "0972683275", "reviewerName": "Kevin B.", "helpful": [0, 0], "reviewText": "For a good wall mount of a smaller TV, this is perfect. Much cheaper than similar in various stores, and actually is more flush/compact than I have seen on others with all the adjustments you could want.Only gripe is that the included wrench to tighten the wall bolts is pretty weak and strips itself almost immediately, but it'll work to get it on at least. All hardware needed is included, I had to use a few adapter pieces on my first TV. Getting ready to hook a second one up on another rooms wall, both are 32\" screens. I feel confident they will be there until I decide to remove em.Wall stud mounting required, but depending on the stud size, you may only get two of the three wall bolts into the stud. Should be enough though.", "overall": 5.0, "summary": "Liked it so much I bought another", "unixReviewTime": 1337904000, "reviewTime": "05 25, 2012"}
{"reviewerID": "A1OYA1IESSJ8F6", "asin": "0972683275", "reviewerName": "Kevin", "helpful": [0, 0], "reviewText": "I use this arm to mount my 39 inch Vizio. I'm surprised my TV has a 100x100 mount thingy. It can tilt left and right, up and down. I do wish it swiveled the TV so that it wasn't crooked. When the bolts get loose, my TV looks crooked.", "overall": 5.0, "summary": "Good arm", "unixReviewTime": 1390262400, "reviewTime": "01 21, 2014"}
{"reviewerID": "AA81KFW4X8UIH", "asin": "0972683275", "reviewerName": "Kevin", "helpful": [0, 0], "reviewText": "Was a perfect fit for my 32&#34; flat screen TV.  I would recommend this wall mount for that size tv", "overall": 5.0, "summary": "Good Purchase", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}
{"reviewerID": "A317RWPY08I5QX", "asin": "0972683275", "reviewerName": "King Nguyen", "helpful": [0, 0], "reviewText": "Good wall mount. Sturdy and does what it is supposed to do. In fact, it even held a larger TV than what it was listed as capable of holding. I believe I mounted a 42&#34; television with this one. Not a flat-flat one either. I mounted an older heavy thick one.", "overall": 5.0, "summary": "Very good tv mount", "unixReviewTime": 1383523200, "reviewTime": "11 4, 2013"}
{"reviewerID": "A39WT88YZXIJTB", "asin": "0972683275", "reviewerName": "Kmill", "helpful": [0, 0], "reviewText": "This was half the price of the TV mounts at Costco and perfectly fits a Vizio 37&#34; TV for the spare bedroom. It will work with many different brands so in my book that is great. Strong, sturdy and robust.", "overall": 5.0, "summary": "Great inexpensive TV mount", "unixReviewTime": 1395705600, "reviewTime": "03 25, 2014"}
{"reviewerID": "A3UYI01GLEYZSP", "asin": "0972683275", "reviewerName": "Krissy", "helpful": [0, 0], "reviewText": "This is possibly one of the best mounting kits I've ever purchased. I like the fact that there are pieces so the mounting kit can cater to all models of TV. (Whether they have a rounded or flat back). Mine had a flat back so I didn't need the extra piece, but once that step was cleared it was only a matter of minutes before it went up on my wall.  The adjustable arm is nice, as it is setup in our bedroom. At night the TV is angled towards the bed and makes it super easy for both of us to see up on the wall, and during the day its turned in another direction towards my desk - also making the ability to view the TV while working.The material is very strong, hubby did a pull up on the bar and it didn't even budge.  This thing seems as though it will last quite a long time.  It's already been up for over a month and it was a wonderful addition to my master bedroom, I'll be purchasing more over time for the other rooms in the home with larger model TVs.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1361232000, "reviewTime": "02 19, 2013"}
{"reviewerID": "AP7LSRPXT3ZL8", "asin": "0972683275", "reviewerName": "Kyle", "helpful": [0, 0], "reviewText": "Exactly as described.Very heavy duty.Lots of parts to make any installation work.Excellent value.Fits various monitors and tvs.", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1357171200, "reviewTime": "01 3, 2013"}
{"reviewerID": "AP3XMM1077I50", "asin": "0972683275", "reviewerName": "kyle", "helpful": [0, 0], "reviewText": "I bought three of these mounts for all the bedrooms in my house. I love all three of them. All mounts have different tv's on them, One is a 50&#34;, 40&#34; and a 32&#34;. Product comes with multiple screw for different tvs. Outstanding product for the price. All tv's have been mount for a little over a year. This product is a full motion mount for $29.99!! and it is Prime!", "overall": 5.0, "summary": "Tv Wall mount", "unixReviewTime": 1385769600, "reviewTime": "11 30, 2013"}
{"reviewerID": "A1038957GWRBP375RU5T", "asin": "0972683275", "reviewerName": "leo", "helpful": [0, 0], "reviewText": "Awesome price and quality. Simple and easy to install and fully equipped for installation. If you need a swing arm mount for medium size tv this is one I'd recommend.", "overall": 5.0, "summary": "Great item", "unixReviewTime": 1353542400, "reviewTime": "11 22, 2012"}
{"reviewerID": "A7R4R9THNELTP", "asin": "0972683275", "reviewerName": "LG", "helpful": [14, 19], "reviewText": "I mounted this in my RV and it holds a 26\" LCD TV / DVD combo.  Installation was very easy and the mount works GREAT!  I was prepared to pay 5 times the price for a mount that would work as I wanted.  I couldn't be happier.", "overall": 5.0, "summary": "Excellent, at any price", "unixReviewTime": 1285804800, "reviewTime": "09 30, 2010"}
{"reviewerID": "A2RU0H9MD4IH5M", "asin": "0972683275", "reviewerName": "Light", "helpful": [0, 1], "reviewText": "Got my TV mounted with this above my PC and its been on the wall for a year now. No problems with it holds the TV well and its study. Way cheaper than store bought and its perfect for what I got i got a 37 inch HDTV", "overall": 5.0, "summary": "Great Wall Mount", "unixReviewTime": 1367107200, "reviewTime": "04 28, 2013"}
{"reviewerID": "A2U9XX4Q5NQBG6", "asin": "0972683275", "reviewerName": "LinuxKing", "helpful": [0, 0], "reviewText": "I really like the action on this mount.  I purchased a 27&#34; monitor for my wife and this mount really frees up the desktop real estate.  I would purchase again.", "overall": 5.0, "summary": "Works as advertised", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"}
{"reviewerID": "A212REVB5AFP02", "asin": "0972683275", "reviewerName": "Manfried \"Ruffmouse\"", "helpful": [0, 0], "reviewText": "I have an older very heavy 36&#34; Samsung High Def TV that weighs substantially more than my new 42&#34;. I replaced my old basement CRT tv with it, installed the VideoSecu mount easily and it does the job. I was amazed, the price from Amazon was only $30 dollars and with prime I got free 2 day shipping. The original price was $149. Wow, what a reduction!", "overall": 4.0, "summary": "Sturdy and easy to install", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}
{"reviewerID": "A3SXYB8JPQ44LN", "asin": "0972683275", "reviewerName": "Marcel", "helpful": [3, 4], "reviewText": "Used this for a Panasonic 32\" LCD TV.  Mount works fine, instructions were minimal.  I was able to use the supplied hardware to attach the TV and to attach the mount to the wall.  I did have a problem hanging the TV, per the instructions you have to mount the unit and now attach the TV, this was not very easy so I removed the mounting plate at the pivor point and took it off the wall mount, mounted this on the TV and now re-attached to the TV mount, this was a lot easier.", "overall": 4.0, "summary": "Good product, poor instructions", "unixReviewTime": 1342483200, "reviewTime": "07 17, 2012"}
{"reviewerID": "A3LSVS4YA2CEAX", "asin": "0972683275", "reviewerName": "Maria David \"MD\"", "helpful": [0, 1], "reviewText": "The product is good and as described.I have a 32&#34; Vizio TV and somehow, this wall mount seems to be a little too weak for my TV. I still managed to mount my TV just fine, but gets a little paranoid that it will give in within the next few months because the mount won't be able to carry it.But the full motion swing feature is amazing! Especially if you are in a larger room.", "overall": 3.0, "summary": "I have a 32\" Vizio TV", "unixReviewTime": 1382313600, "reviewTime": "10 21, 2013"}
{"reviewerID": "A3TAT80JCWYGB4", "asin": "0972683275", "reviewerName": "Mark A. Myers", "helpful": [0, 0], "reviewText": "The TV is still hanging from the wall so that's a good thing. The info for this wall mount says it is good for up to 66 LBS. Our old Phillips 37&#34; flat screen weighs 58 LBS (including the stand) and after 3 weeks the TV and mount are secured to the wall via a vertical 2 x4&#34; frame member. The mount came with almost every imaginable combination of nuts, bolts and spacers and straps to fit various size and brand TVs. I had no problem coming up with the right combination for my big and heavy old Phillips.", "overall": 5.0, "summary": "Still Standing", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A2KUEGMSLHUNNP", "asin": "0972683275", "reviewerName": "Mark G", "helpful": [0, 0], "reviewText": "Bought this mount for a 32inch Panasonic LED TV. The mount may look cheap, but I found it to be extremely sturdy and a great buy for the price. I strongly recommend it to everyone.", "overall": 5.0, "summary": "Great buy", "unixReviewTime": 1353974400, "reviewTime": "11 27, 2012"}
{"reviewerID": "A2YF3QW52PBL3C", "asin": "0972683275", "reviewerName": "Mat", "helpful": [1, 2], "reviewText": "", "overall": 5.0, "summary": "Works perfectly for 400 x 200 VESA mount Hiteker 37\" TV to wood paneled wall.", "unixReviewTime": 1357776000, "reviewTime": "01 10, 2013"}
{"reviewerID": "A7V9WIUIB02OI", "asin": "0972683275", "reviewerName": "Matt", "helpful": [0, 0], "reviewText": "Good, strong mount and quality hardware. Includes all the different size screws required to attach to TV if yours doesn't have them (or if you lost them).  There is just the right amount of resistance in the joints for it to stay where you want it but still easy to move around.  I mounted a shelf above the TV to get the cable box out of the way and avoid having to run a long HDMI cable through the wall.I took a star only because I received a different unit than the one pictured, It has 2 thick arms, rather than the 2-1 that is shown.  Honestly I think what I got is more attractive, but I believe that Amazon vendors should not substitute different products without authorization.  My unit also did not come with the extender arms in the picture, it has a mounting plate with all of the VESA mounting holes in the correct configuration.  My TV is 26&#34; so it fit perfectly.  I am sure my 55&#34; would fit on it too, but I have a different mounting configuration for that one.", "overall": 4.0, "summary": "Strong, attractive, and highly functional", "unixReviewTime": 1380844800, "reviewTime": "10 4, 2013"}
{"reviewerID": "A2TOUTL6Z74SMQ", "asin": "0972683275", "reviewerName": "mbb", "helpful": [0, 0], "reviewText": "Very solid...we mounted our flat panel in the bedroom. Like the tipping feature and love the articulating feature.We checked prices at stores, big boxes, etc. best price of all including Costco...", "overall": 5.0, "summary": "mbb", "unixReviewTime": 1305590400, "reviewTime": "05 17, 2011"}
{"reviewerID": "A8THC8D64F5E3", "asin": "0972683275", "reviewerName": "Mbk", "helpful": [0, 0], "reviewText": "I bought this tv swing arm mount for my tv from amazon.Its been a good one its built heavy duty to hold pretty big tv .I would have anyone of my friends buy this same mount for their tv. It lets you hang it up and out of the way and also you can turn it out or in adjustable to see it from anywhere I set in my living room. This unit is easy to mount on wall and put together by yourself but if you have an extra person around it would make it a little better when holding the tv up when it clips in at top then screw and tighten and adjustments and like everything else I've bought from amazon it ships fast right to your door step.", "overall": 4.0, "summary": "My new tv wall mount", "unixReviewTime": 1364428800, "reviewTime": "03 28, 2013"}
{"reviewerID": "A1RI8HAZRUWZM6", "asin": "0972683275", "reviewerName": "Michael A. Raney", "helpful": [0, 0], "reviewText": "Easy to attach. Easy to adjust. Very Solid and secure. Used on a clients 29&#34; LED with built in DVD.", "overall": 5.0, "summary": "Best buy for your buck.", "unixReviewTime": 1384041600, "reviewTime": "11 10, 2013"}
{"reviewerID": "A3IZFW84VV75XS", "asin": "0972683275", "reviewerName": "Michael Hardaway", "helpful": [0, 0], "reviewText": "I have my 32 inch Tv on the wall and it works great. Easy to install and came with all the parts. The screws that it comes with for the TV will not fit but you can buy some for 2 dollars.", "overall": 5.0, "summary": "Works", "unixReviewTime": 1365465600, "reviewTime": "04 9, 2013"}
{"reviewerID": "A3AKVALGT4Y02G", "asin": "0972683275", "reviewerName": "MICHAEL", "helpful": [5, 6], "reviewText": "For the money you can't go wrong. Yes, it has a litlle play in the mechanism but, you can adjust your mounting to accomodate that. It works great and frees up counter space. I would do it all again. Why spend 3 times more.", "overall": 4.0, "summary": "can't beat it for the price", "unixReviewTime": 1203379200, "reviewTime": "02 19, 2008"}
{"reviewerID": "A2I8J6GW1H6LWU", "asin": "0972683275", "reviewerName": "Michael", "helpful": [7, 9], "reviewText": "I love this mount! All the adjustments for tilt and extension are awesome! Holds a Sony 32in Ex-3000 just fine even fully extended. Even bought another. A++Mike", "overall": 5.0, "summary": "Great low cost mount!", "unixReviewTime": 1285459200, "reviewTime": "09 26, 2010"}
{"reviewerID": "AY796UUSZ2ZVA", "asin": "0972683275", "reviewerName": "Michael J. Torpey", "helpful": [0, 0], "reviewText": "I have this mounted on my wall in my editing studio.  It holds a 27\" LCD monitor (about 20-25lbs).  It's been up for a week and I don't expect that it will fall down anytime soon.", "overall": 5.0, "summary": "Works Great!", "unixReviewTime": 1346803200, "reviewTime": "09 5, 2012"}
{"reviewerID": "A2NOXTG05AHVB3", "asin": "0972683275", "reviewerName": "microtute", "helpful": [0, 0], "reviewText": "My students and I used to huddle around laptops to discuss projects. Now I have a 47&#34; TV for display and this mount makes it possible to put it on any wall and swivel it in any direction depending on how many people need to see the screen. Really stable, no wiggling", "overall": 5.0, "summary": "Great for office", "unixReviewTime": 1372377600, "reviewTime": "06 28, 2013"}
{"reviewerID": "A2KR372GZW00MJ", "asin": "0972683275", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "It is a good value, but is not top notch quality. If you extend both arms in the same direction, the TV (30 inch) tilts. However if the arm goes right, then left, the play in the hinges offset each other and it works great.", "overall": 4.0, "summary": "Good value", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
{"reviewerID": "A2BLRT79WUTLXW", "asin": "0972683275", "reviewerName": "M. Merriken", "helpful": [0, 0], "reviewText": "The mount itself seems fine, it just didn't work with the Phillips tv we bought....the 'x' arm things did not line up and if they did then the 'x' parts would have covered the holes for the inputs...........we ended up using one we had had around here.......seems to be built well though and sturdy", "overall": 3.0, "summary": "tv mounts", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}
{"reviewerID": "A3PR648T8RDRS", "asin": "0972683275", "reviewerName": "m m smits", "helpful": [0, 0], "reviewText": "Got this to replace a Peerless Paramount wall mount when I got my new TV.  Let me start off by saying it works as advertised.  But that won't get you 5 stars.  The problem is installation.  Maybe it's my own fault for thinking all TV wall mounts worked like the Peerless I had.  See, that one has a separate TV plate that you screw to the TV first.  Then you have the second piece (the actual wall mount) that you screw to the wall.  Once that's done, using the bracket mounted on the TV, you hang the TV on the wall mount and secure it with a single bolt.  One person can easily put a TV on the wall.Not so much with this one.  Yes, I will admit that once it's mounted, it's a more secure connection, but it's the mounting that's the problem.  You can't do it alone.  Depending on the weight of the TV, you will need at least one helper.  This mount is one piece, which means that you have to hold the TV to the wall-mounted plate while attaching it with screws.  That can get tricky, especially with heavier TVs (I used it for a while with my old LCD TV which weighs 40+ pounds).  They do get kudos for providing all the screws for all VESA types as well as a regular and an Allen wrench.Three stars for ease of installation, five stars for usability, for a combined four stars.  Make sure you get help when installing.", "overall": 4.0, "summary": "Get a helper when installing", "unixReviewTime": 1344988800, "reviewTime": "08 15, 2012"}
{"reviewerID": "A6TWN9W9WSAV0", "asin": "0972683275", "reviewerName": "Monkey 5", "helpful": [0, 0], "reviewText": "It is up know and should work fine, but it was hard to get it to fit my TV due to the bulge on the bottom, but I made it work and it is on the wall.", "overall": 4.0, "summary": "Hard to fit my TV", "unixReviewTime": 1356912000, "reviewTime": "12 31, 2012"}
{"reviewerID": "AZFF4CX9MQ4AE", "asin": "0972683275", "reviewerName": "mrd", "helpful": [0, 0], "reviewText": "Very strong for any tv, but I wish that it was little longer I am very happy with it and very strongly recommended.", "overall": 5.0, "summary": "mrd", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AH7DLKHSGZKCR", "asin": "0972683275", "reviewerName": "M. Swartz", "helpful": [0, 0], "reviewText": "Easy install!! Looks great and works great for what we need!! Purchased for game room, took 5 min. to install and 1 min. to set TV on. Great!!", "overall": 5.0, "summary": "Great Product -Easy install 5 min. to install. TV looks great on the wall. can move around easily", "unixReviewTime": 1363996800, "reviewTime": "03 23, 2013"}
{"reviewerID": "A2HI35H2BOCV9R", "asin": "0972683275", "reviewerName": "MTBrider", "helpful": [0, 0], "reviewText": "It is a solid mount and I doubt that it will ever fail to hold the 22\" LED TV that is mounted on it.  My only complaint is that the bolt that attaches the arm to the wall plate is smaller then the hole in the wall plate so when the TV is anything other than parallel to the wall it leans (up to 1.25\" from one side of the TV to the other ~16\") but for the price I can live with that.", "overall": 3.0, "summary": "Solid", "unixReviewTime": 1301356800, "reviewTime": "03 29, 2011"}
{"reviewerID": "A11IFJDOZ0T6Z2", "asin": "0972683275", "reviewerName": "MT", "helpful": [0, 0], "reviewText": "The mount works, but it is unrefined compared to other brands out there. Purchased because it was on sale. just ok.", "overall": 3.0, "summary": "just ok", "unixReviewTime": 1358640000, "reviewTime": "01 20, 2013"}
{"reviewerID": "A15K7HV1XD6YWR", "asin": "0972683275", "reviewerName": "Musawir Karim", "helpful": [5, 7], "reviewText": "I consider myself to be a good DIYer. I've installed mounts for my 2 Samsung 46\" and 55\" LED TVs with no problems for 5 years. So, for this VideSecu mount, inspite of poor installation instructions, I carfeully measured all domensions to fit my new 32\" Samsung LED SmartTV in a limited kitchen space. My mistake was, based on the diagrams, I assumed that the length of both the swinging arms of the mount (the single and the double arms) were of the same length. What a disaster! After installing the mount when I mounted the TV and folded the arms the TV did not center itself to the wall side of the mount! It was then that I noticed the inner length of the 2 arms is about 4\" longer than the outer single arm. In other words once the arms on the mount were fully folded in towards the wall my TV was not centered in the limited space that I had and looked awful. I don't know why the manufacturer did not keep both arms the same length. At least they shd have mentioned it in the instructions.This to me is a major product defect. Luckily with Amazon I was able to return this mount but had to pay return S&H;.", "overall": 1.0, "summary": "Beware the TV will not center....folding arm lengths not same", "unixReviewTime": 1360713600, "reviewTime": "02 13, 2013"}
{"reviewerID": "A1HMK1KMWQBDTT", "asin": "0972683275", "reviewerName": "M. Woole", "helpful": [0, 0], "reviewText": "Works great for a cheap mount. Worked great on a 32&#34; Emerson LCD tv. Does everything as advertised! Can tighten or loosen joints for easier movement.", "overall": 5.0, "summary": "Good buy for price.", "unixReviewTime": 1387929600, "reviewTime": "12 25, 2013"}
{"reviewerID": "A1S8E2JSVXHIPB", "asin": "0972683275", "reviewerName": "Nancy", "helpful": [0, 0], "reviewText": "We needed something to Extend our tv away from the hot pipe for the winter and this wall mount did the trick. It went up with no a problems. It worked out very well!", "overall": 5.0, "summary": "Great Wall mount!!", "unixReviewTime": 1378857600, "reviewTime": "09 11, 2013"}
{"reviewerID": "A2QBJEHKTD7R6O", "asin": "0972683275", "reviewerName": "Nathan", "helpful": [0, 0], "reviewText": "its a little flimsy and not the easiest to put together, for the price it works.  But for the quality i'd go with Cheetah.", "overall": 3.0, "summary": "difficult mount", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}
{"reviewerID": "A3S1BO0SLFC5H", "asin": "0972683275", "reviewerName": "NDM", "helpful": [0, 0], "reviewText": "We needed a wall mount for a 32&#8221; TV that was going to be in the screened in porch.  This was one of the brands recommended by the guy that was going to install out wall mount.  I can&#8217;t speak to the ease or difficulty of installation but it looks great and we can swivel it if necessary for best viewing angle.  It's also pretty sleek so it doesn't butt out too much.  It arrived quickly and it didn&#8217;t take the installer long but of course he was a professional.  Looks great!", "overall": 5.0, "summary": "Great mount", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A81NVWL4MMVT8", "asin": "0972683275", "reviewerName": "nick m", "helpful": [0, 0], "reviewText": "It works for the tv I bought but I had to use some of my own washers for the screws.  I thought it would have everything.", "overall": 4.0, "summary": "Good", "unixReviewTime": 1380326400, "reviewTime": "09 28, 2013"}
{"reviewerID": "A3EP4YIS9W1LR1", "asin": "0972683275", "reviewerName": "Nitkad", "helpful": [0, 0], "reviewText": "I have mounted a 42 inch old LCD. Easy to install. Easy to swivel, there is tilt option but it has to be locked by nuts(it can not be changed without loosing the nuts).", "overall": 5.0, "summary": "Good for price", "unixReviewTime": 1358121600, "reviewTime": "01 14, 2013"}
{"reviewerID": "AHPRCZ59P9RU0", "asin": "0972683275", "reviewerName": "Nooga Shooter", "helpful": [0, 0], "reviewText": "I wanted to put my mac in the wall and leave it. This does that well.  I don't move it often it seems strong and well built. If you want to move it a lot get something different you have to keep an Allen wrench and a crescent wrench in the desk drawer if you plan on moving it a lot. The articulation is sketchy. For my uses and the cheap price this was perfect.", "overall": 5.0, "summary": "It works for me", "unixReviewTime": 1294704000, "reviewTime": "01 11, 2011"}
{"reviewerID": "A38LYJ7NQ65G5L", "asin": "0972683275", "reviewerName": "NP Diver", "helpful": [0, 0], "reviewText": "I have purchased a total of 4 HDTV wall mounts from the VideoSecu companyand they are all quality products at a very reasonable price.-Tilt TV Mount: for stationary TVs up to 65 inches.-Articulating:  corner mount for SMALL TVs-Long Arm:  corner or high mobility mount for LARGER TVsAll of them are excellent products, and very easy to install.", "overall": 5.0, "summary": "SIMPLE....SOLID......GOOD VALUE!!", "unixReviewTime": 1391040000, "reviewTime": "01 30, 2014"}
{"reviewerID": "A6GYEDCEU2LKG", "asin": "0972683275", "reviewerName": "O1D NO 7", "helpful": [0, 0], "reviewText": "Received this item quickly and well packaged (But not so well that I was infuriated trying to open it)Everything was in perfct order. Strong, handsome appearance. Installation Kit is perfectly in order and gives a ton of options for different senarios.  Couldn't possibly be happier with this product.", "overall": 5.0, "summary": "Perfect Everything!", "unixReviewTime": 1304553600, "reviewTime": "05 5, 2011"}
{"reviewerID": "A3TCV19D652GPU", "asin": "0972683275", "reviewerName": "one4one", "helpful": [0, 0], "reviewText": "Could offer a little more in flexibility of installation, but once in place the set can be placed in just the right position repeatedly.", "overall": 4.0, "summary": "Very sturdy.", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "A1N7QSP1U513KJ", "asin": "0972683275", "reviewerName": "Panama Red", "helpful": [0, 0], "reviewText": "The directions stink. Just remember the spacers go under the arms if you have to use them and you will be ok.", "overall": 5.0, "summary": "Awesome and cheap. The directions stink. Just remember the spacers go under the arms if you have to use them and you will be ok.", "unixReviewTime": 1361059200, "reviewTime": "02 17, 2013"}
{"reviewerID": "AQIBGC2OCCAHQ", "asin": "0972683275", "reviewerName": "Patricia Murray \"trader54\"", "helpful": [0, 0], "reviewText": "It is better than spending twice the money on this going into a brick and mortar store. Was very pleased.", "overall": 5.0, "summary": "Good", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
{"reviewerID": "A1EAXVLKPVL8W5", "asin": "0972683275", "reviewerName": "Patt in Ft. Lauderdale \"PATTSDESK\"", "helpful": [0, 0], "reviewText": "Good quality.  Must mount on a stud.  I mounted to a metal stud by cutting a rectangle hole in wall, adding a 2 ft 2x4 in the metal stud track, patched the hole and then put up the mount.  Holds a 37&#34; TV without a problem,even added a DVD player to the bottom of the TV and it is still on the wall after about 8 months.  Price on this item was great and it was sent with FREE FREIGHT!", "overall": 5.0, "summary": "A real SWINGER", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A32QNGGSX3YTAH", "asin": "0972683275", "reviewerName": "Paul Lesperance", "helpful": [0, 0], "reviewText": "This item didn't disappoint. It's sturdy, has all the screws included for different flat screen models and yes, it works well.", "overall": 5.0, "summary": "very good value", "unixReviewTime": 1289952000, "reviewTime": "11 17, 2010"}
{"reviewerID": "A1FFCR74WU1E6Z", "asin": "0972683275", "reviewerName": "Pen Name", "helpful": [1, 1], "reviewText": "This worked perfect.  The universal design would fit 99.9% of the TV's as advertised.  Easy to mount and very durable.", "overall": 5.0, "summary": "Exactly what I wanted", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}
{"reviewerID": "A2GGS3I5BY7R1A", "asin": "0972683275", "reviewerName": "Questors", "helpful": [1, 1], "reviewText": "I have a full 42&#34; HD flat screen mounted on this. Not only does everything look better than strapped to a table, but the adjustability makes this mount a pleasure to have.  It was simple to attach to the wall and has a small footprint, being a single stud wall mount.  The other major point of this mount is how many sized TV or monitors the mount can be adjusted to accept.  My TV mounts solidly and the mount itself is solid, yet adjusts with little effort.  This is just plainly a good and solid product that is well worth the money.", "overall": 5.0, "summary": "Excellent Product", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}
{"reviewerID": "A326UIIB1O2UUR", "asin": "0972683275", "reviewerName": "Rachel Maggert", "helpful": [0, 0], "reviewText": "had a couple of guys put this up for me, but they said it was easy to install. I like the fact that I can move it around easily and tilt it anyway I want it to be.", "overall": 5.0, "summary": "easy to install", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"}
{"reviewerID": "A2RE73VUCARNE0", "asin": "0972683275", "reviewerName": "Ramon Pereyra", "helpful": [0, 0], "reviewText": "This product is user friendly and versatile.It is easy to install and comes with everything needed for installation.Adding bidding could drill and bit", "overall": 5.0, "summary": "Very good", "unixReviewTime": 1361750400, "reviewTime": "02 25, 2013"}
{"reviewerID": "A3KHBD3YRNY5WO", "asin": "0972683275", "reviewerName": "Randy Williams", "helpful": [1, 1], "reviewText": "it was so easy to install.  the instructions were simple and so was the process.  i was putting off the project for fear.  i should have hung the TV long ago.", "overall": 5.0, "summary": "perfect in every way", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A3VWY3CDC423UM", "asin": "0972683275", "reviewerName": "Rebecca", "helpful": [0, 0], "reviewText": "works great was pretty easy to put up and does the trick. it is my sons room and really works great.", "overall": 5.0, "summary": "mount", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
{"reviewerID": "A1L7JCX9IKGKIQ", "asin": "0972683275", "reviewerName": "Reisetante", "helpful": [0, 0], "reviewText": "I am very happy with this affordable wall mount for my Sony 32\" Internet TV. One nice feature ist that you can swivel the mounted TV depending on where you are seated.", "overall": 5.0, "summary": "TV Wall mount", "unixReviewTime": 1332201600, "reviewTime": "03 20, 2012"}
{"reviewerID": "A2Y4H3PXB07WQI", "asin": "0972683275", "reviewerName": "Richard S. Sims", "helpful": [0, 0], "reviewText": "I have a 26\" LCD monitor mounted on unit.Seems sturdy enough, would prefer a more fluid motion and a way to adjust the pivot of the screen without tools.  As it is I keep it loose and it is reasonbly adjustable.For the price I certanily can't complain and would recommend this unit.", "overall": 4.0, "summary": "Works as advertised.", "unixReviewTime": 1292457600, "reviewTime": "12 16, 2010"}
{"reviewerID": "A3HAWAR6KX3ENU", "asin": "0972683275", "reviewerName": "Rickgum", "helpful": [0, 0], "reviewText": "Easy to install, and works great. Television moves with ease and always feels secure. Doesn't loosen over time like other television mounts.", "overall": 5.0, "summary": "Nice Peice", "unixReviewTime": 1373760000, "reviewTime": "07 14, 2013"}
{"reviewerID": "A2EBPFXZNLL753", "asin": "0972683275", "reviewerName": "Rob A. Frese", "helpful": [0, 0], "reviewText": "This was for a 32 inch LCD.  Easy to install and works great.  I am very satisfied with this wall mount.", "overall": 5.0, "summary": "Good price good product", "unixReviewTime": 1345939200, "reviewTime": "08 26, 2012"}
{"reviewerID": "A1OY33KGOG3IX8", "asin": "0972683275", "reviewerName": "Robert Brasseur", "helpful": [0, 0], "reviewText": "Fits many different size TV's,  is very solid, and was easy to install.  I would recommend to anyone is even slightly handy.", "overall": 4.0, "summary": "Good Product", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A2WH3Y3YZVTHY2", "asin": "0972683275", "reviewerName": "Robert", "helpful": [0, 0], "reviewText": "I'm using this with my 32\" tv and I love it. The price is significantly lower than what you can find for monitor wall mounts in the retail stores (walmart, best buy).I found this to be an easy install and very secure. The swivel is smooth and I can orient my television perfectly. It also has plenty of VESA mount patterns so it will hold just about any TV.", "overall": 5.0, "summary": "Good Price, Great Quality", "unixReviewTime": 1332979200, "reviewTime": "03 29, 2012"}
{"reviewerID": "A3945ZO3MNKVMO", "asin": "0972683275", "reviewerName": "Rob", "helpful": [0, 0], "reviewText": "For such a cheap mount, it works well. I installed in in about 20 minuets and use it to hole a 32\" Vizio LED.", "overall": 5.0, "summary": "Works well", "unixReviewTime": 1331424000, "reviewTime": "03 11, 2012"}
{"reviewerID": "A2UAS6OGCR8IUG", "asin": "0972683275", "reviewerName": "Robin", "helpful": [0, 0], "reviewText": "This was a present for myself, my son installed it, in about 25 minutes, and I couldn't be happier.  I wasn't sure this was for me as it for my bedroom, but my husband and I love it.  So easy to move the TV no matter where you are in the room.  A great buy.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "A1BKKEWFMHS7XU", "asin": "0972683275", "reviewerName": "R. Peck", "helpful": [0, 0], "reviewText": "Mounting the TV after mounting on wall can be a handful.  It would have been nice to have some type of slide in mount for the TV so you did not have to hold it while putting in 4 screws.  That would make DIY one person installation easier.", "overall": 5.0, "summary": "Good mount for medium size TV", "unixReviewTime": 1335744000, "reviewTime": "04 30, 2012"}
{"reviewerID": "A1FGK3N8GZHGZJ", "asin": "0972683275", "reviewerName": "RRichardson", "helpful": [0, 0], "reviewText": "When we first bought our bedroom tv, we looked at the mounts in the store and almost fell over from shock at the prices.  This is one of the best prices I have found on mounts.  This mount went up easy and moves in all directions to get the perfect viewing angle.  it comes with everything you need but the drill and tv!  You won't be disappointed with this brand.", "overall": 5.0, "summary": "awesome!", "unixReviewTime": 1361404800, "reviewTime": "02 21, 2013"}
{"reviewerID": "A2ZDMIP49N36UJ", "asin": "0972683275", "reviewerName": "Russell Lekberg \"R. Lekberg\"", "helpful": [0, 0], "reviewText": "If I need to order another, this will be the one.  I used this to mount a TV to the wall in my basement and it allows me to pull the tv out from the wall and turn it towards my desk so I can watch TV while working on the PC, nearly a 90 degree angle.  My TV is only a 32&#34; and I could see that this would work up to a 40&#34; or so, but if you don't need to turn the TV 90 degrees, you could get by with a larger TV.", "overall": 5.0, "summary": "Easy install, great price", "unixReviewTime": 1362873600, "reviewTime": "03 10, 2013"}
{"reviewerID": "A14R4K86STZFD2", "asin": "0972683275", "reviewerName": "RussiaDad", "helpful": [0, 0], "reviewText": "I was hesitant about mounting my larger flat screen (47&#34; LG) onto the wall - what happens if it falls off!  After looking at mounts at Target and Best Buy that were $100+, would this possibly work?Fast forward...  The mount took about 20 minutes to install (too longer to locate the studs than mount it).  The TV is on the wall and works wonderfully.  Very solid mount and good articulation.My only comments are the cord clips included are very weak.  I will be replacing them with black cable ties.  Also - they do need to have a second locking screw where you hang the TV on the articulating mount - I can wiggle my screen (tilt) by about 1/4&#34; since there is only a screw on the bottom.Overall, I liked the narrow wall mount and the 20&#34; extension.  Definitely would recommend for a TV that is 47&#34;.", "overall": 5.0, "summary": "Great mount for my 47\" flat screen", "unixReviewTime": 1375833600, "reviewTime": "08 7, 2013"}
{"reviewerID": "ABU4LUKJU2QOY", "asin": "0972683275", "reviewerName": "Rusty Sly", "helpful": [0, 0], "reviewText": "Easy to install, with extra hardware for installing your TV. However, my TV had a curved back, so I used the included spacers to space the bars on the back of the TV. I was skeptical of the two lag bolts attaching the bracket to the stud under the drywall, so I added two 5/16&#34; lags, under washers holding the inside edges of the mounting brackets.After installing the Swing Arm wall mount, I grabbed the end of the bracket, fully extended. The bracket didn't sag a bit. I concluded that the supplied two lag bolts would have been sufficient.I've swung my TV out and exercised the various angles available, and found the swing arm not giving a millimeter.I fully recommend this wall mount. I've a few other VideoSecu mounting brackets for wall mounted and floor stand speakers and one for an 80-inch Sharp TV. All are quality products.", "overall": 5.0, "summary": "No sag or twist with a 39-inch flat screen TV", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "A11ZP93TJED4T6", "asin": "0972683275", "reviewerName": "Ryan", "helpful": [1, 8], "reviewText": "The fact that the pivot point on this TV mount was not built straight caused the TV to tilt slightly when it was swung out.  there is no adjustment for it, so i had to make a choice for the tv to either be straight and level when it was pushed against the wall, or when it was out.  i do not recommend this wall mount.to it's benefit though, it was reasonably sturdy and easy to install.", "overall": 2.0, "summary": "poor manufacture quality..", "unixReviewTime": 1285891200, "reviewTime": "10 1, 2010"}
{"reviewerID": "A114Z5X6UH93GT", "asin": "0972683275", "reviewerName": "Ryan P Muller", "helpful": [0, 0], "reviewText": "Purchased for my sister to hang her TV on a wall and she and her boyfriend reported back to me that mount works great with the 42&#34; Vizio TV she got for Christmas and was up securely in no time.  I looked around in the retail stores and found that this mount was of similar quality at a much lower price.  What can I say, it does what it is supposed to do, was easy to setup, and is of good value.", "overall": 5.0, "summary": "Great price compared to brick and mortar stores and seems to be good quality too.", "unixReviewTime": 1358553600, "reviewTime": "01 19, 2013"}
{"reviewerID": "A23S2XCWFZM976", "asin": "0972683275", "reviewerName": "Sauce On Side", "helpful": [1, 1], "reviewText": "This was needed to mount a 32\" LCD that weighs 27 lbs in my bedroom. I looked at another mount by the same company but it did not articulate so I was worried I wouldn't be able to achieve the viewing angles that I needed. So I found this one & went w/ it based on the high reviews. I could not be more pleased.1) PRICE - If you were to go to the big electronics store (BB) or the big box monster (WM) you would pay hundreds. I can't fathom those more expensive mounts doing anything that this one does not. Does it cook dinner for me? Why pay $100-$250 for a mount when you can get this one for $29.99 & oh, by the way have the confidence in 898 customer reviews averaging 4.5 stars at the time of this writing?2) FUNCTION - This mount is solid. It articulates to the left, to the right. It pans, it tilts. One small negative.....the plastic clips for routing wires are nearly useless. I took them off.3) WHATS IN THE BOX - Normally I would not comment on what an item comes with but in this case I was so impressed I felt it was worth mentioning. It comes w/ everything you need in neatly sealed and labeled plastic sleeves. It comes w/ lag bolts that everyone will use to mount to the wall stud. (mounting to a wall stud is required unless you are mounting to concrete) Then it has 9 different screw sets to mount the plate to the back of your TV. It has 2 washer sets for the mounting plate (based on if your TV has a flat or curved back). Then it has a spanner wrench for tightening the screw of the mounting plate. Then it also has 2 plastic anchors for mounting to a concrete wall. Last but not least are the VESA adaptors (which I did not need)4) WHAT YOU NEED THAT ISN'T INCLUDED -  Pencil / Level / Stud finder / Phillips screwdriver / Drill w/ a 7/32 drill bit / Socket wrench w/ a 13mm attachment.5) CONCLUSION - This is a no brainer. I have another 32\" that needs mounted. I think as soon as I click publish for this review I will be ordering another one. If you find yourself reading reviews on TV mounts and you have found this one your search is over, just click buy already.", "overall": 5.0, "summary": "Awesome TV mount", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A1N9QB2BECD6TS", "asin": "0972683275", "reviewerName": "Seany B. \"Football fan\"", "helpful": [0, 0], "reviewText": "This is mounted in a doorway between two rooms in my basement with a 40 inch TV attached to it.  I can move it to either room and still keep the doorway open plenty wide enough to pass through.  Perfect for my needs.", "overall": 5.0, "summary": "Awesome range of motion", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
{"reviewerID": "A11EKN3A8FUEDC", "asin": "0972683275", "reviewerName": "Sergio E", "helpful": [0, 0], "reviewText": "Sturdy and durable craftsmanship. Bought for my grandma in Mexico, had it installed and works great. Has awesome mobility to enjoy your television from countless angles in your room.", "overall": 5.0, "summary": "Works Perfectly", "unixReviewTime": 1366416000, "reviewTime": "04 20, 2013"}
{"reviewerID": "A1THJB1ORM3U2I", "asin": "0972683275", "reviewerName": "shadowlander1_1", "helpful": [1, 1], "reviewText": "If you want a wall mount that is universal and can be moved in all directions this is the one to get.  My 42&#34; Samsung 3D tv mounted easily and the extensions were not required.  I mounted it to a stud and it seems to be very secure.  I am able to swing the tv to watch from my bed or from the lazyboy chair without a problem.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "A1G5508T5XY1RS", "asin": "0972683275", "reviewerName": "S. Hardy \"RuffRyd\"", "helpful": [1, 1], "reviewText": "Great wall mount at a great price.  Already fully assembled out of the box and seems built to last.  I really like the swivel and tilt as we need it when laying down in the bedroom.  Easy instructions (I'm not a carpenter).  I used this on a 32\" Samsung LED TV.", "overall": 5.0, "summary": "Just as expected!", "unixReviewTime": 1353283200, "reviewTime": "11 19, 2012"}
{"reviewerID": "APRP1LWB08YG8", "asin": "0972683275", "reviewerName": "SkipB", "helpful": [0, 0], "reviewText": "Very simple set up and ease of installation. I followed the advice of another reviewer and removed the top hex-screw of one of the center connections (thus disconnecting the wall plate from the plate attached to the TV)so that I could install the plate to the wall and the plate to the back of the TV as separate processes. Both simple and quite easy. Then it was simply a matter of slipping the two back together and re-installing the hex-screw. I was able to install a 32\" RCA TV, without any help in less than 20 minutes.Manufacturer provided a good assortment of screws and other hardware, as well as a hex wrench, a small open wrench and a level.", "overall": 4.0, "summary": "Solid product", "unixReviewTime": 1324771200, "reviewTime": "12 25, 2011"}
{"reviewerID": "A1HBNCPHMW87Y0", "asin": "0972683275", "reviewerName": "so cal", "helpful": [0, 0], "reviewText": "got this to hang a 32\" sony lcd in my bedroom.  used my stud finder to locate the studs, drilled 6 pilot holes and hung it up.  and extra set of hands is helpful when hanging the mount and mounting the tv.  holes on mount lined up perfectly with my tv.  screws fit just right.no complaints.", "overall": 5.0, "summary": "works perfectly with my 32\" sony lcd", "unixReviewTime": 1336348800, "reviewTime": "05 7, 2012"}
{"reviewerID": "A38VUSBYQZCKUQ", "asin": "0972683275", "reviewerName": "Stanley A. Kaminsky", "helpful": [0, 0], "reviewText": "used it for vizio 42&#34; tv. easy to install. fit perfectly. what is there else to say? strongly recommend for everyone.", "overall": 5.0, "summary": "excelent", "unixReviewTime": 1374537600, "reviewTime": "07 23, 2013"}
{"reviewerID": "A27K5RT7VDB7BU", "asin": "0972683275", "reviewerName": "Stephan", "helpful": [70, 92], "reviewText": "I purchased this mount for my 37 inch LCD TV.  Installation was easy...  The trouble I encountered was due to a bad wall stud finder.  Make sure you have one when you install this mount because you need to screw the mount into a wall stud or at least have one screw into a wall stud.The arm of the mount sags after I hooked up my 37in. LCD TV to the mount.  My TV is within the weight limit of this mount (less than 55lbs.) but the arm still sags due to the weight of the TV.  I guess as long as it supports my TV, the sagging shouldn't be an issue.  It just looks funny from the side.  I do retract the arm inward towards the wall to minimize the sagging and it also gives me the warm fuzzy feeling that the arm will be less likely to break off.Overall, for the price this mount is a great deal and works but I would suggest purchasing it for flat screen TVs less than 37 inches.  I would not hesitate to buy this mount again but for a 32 inch TV at most.", "overall": 3.0, "summary": "It Works But Could Be Better", "unixReviewTime": 1292025600, "reviewTime": "12 11, 2010"}
{"reviewerID": "A1KXONFPU2XQ5K", "asin": "0972683275", "reviewerName": "Stephanie Manley", "helpful": [0, 0], "reviewText": "I thought this was a great value for a wall mount.  I have installed a 32 inch tv in my bathroom with this unit.  It worked well with the Visio TV that I bought.  It looked it it could accomodate many other tvs because there were a variety of holes on the mounting bracket.  Is it the best quality ever, no.  It is decent quality, and it worked well for me.", "overall": 4.0, "summary": "Effective and inexpensive", "unixReviewTime": 1341446400, "reviewTime": "07 5, 2012"}
{"reviewerID": "A19H6TQ0NFXKVT", "asin": "0972683275", "reviewerName": "Stephen Bruder", "helpful": [0, 0], "reviewText": "my tv! Couldn't ask for more. Thanks. These reviews require too many words. I could have said what I meant in three.", "overall": 5.0, "summary": "Holds...", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
{"reviewerID": "A3MY0WAP1OB7F8", "asin": "0972683275", "reviewerName": "Stephen Kline", "helpful": [1, 1], "reviewText": "This TV mount is easy to install.  Just follow the directions included.  I installed this near the ceiling and I'm using every bit of the 15 degree downward tilt.  Properly installed, the product is rock solid.  I installed a 32\" tv on it.  I know it can hold much more.  The articulating arms are easily adjustable and if you want to tighten it down and lock it in position you can do that, too.", "overall": 5.0, "summary": "Robust Articulating TV Mount", "unixReviewTime": 1337040000, "reviewTime": "05 15, 2012"}
{"reviewerID": "A19FCOXA6VVR9Z", "asin": "0972683275", "reviewerName": "STFlow", "helpful": [0, 0], "reviewText": "This is the second VideoSecu product I have ordered. They are rock-solid, and with the range of fasteners and extra hardware they include in the package, it's hard to imagine any speaker or TV that these systems won't fit.", "overall": 5.0, "summary": "He Shoots, He Scores", "unixReviewTime": 1322611200, "reviewTime": "11 30, 2011"}
{"reviewerID": "A2FWAYS1GIOEX4", "asin": "0972683275", "reviewerName": "Surfer0114", "helpful": [0, 0], "reviewText": "For the price it can't be beat.  The mount is strong and sturdy.  Two sets of hands are mandatory for mounting, three would be ideal.  Once up though, it's better than most of our friends mounts.  It has full articulation, and I can swing the arm out and angle it towards my kitchen.  This is highly important while cooking buffalo wings and trying to keep tabs on football games.", "overall": 5.0, "summary": "Not the easiest to mount, but we LOVE it.", "unixReviewTime": 1374364800, "reviewTime": "07 21, 2013"}
{"reviewerID": "A2K3WCT5GZY4FN", "asin": "0972683275", "reviewerName": "SW", "helpful": [0, 0], "reviewText": "I originally bought this for a Sony 40&#34; TV, but installed it with a Vizio 42&#34; instead.  I did this because the Sony is an older model TV and weighs a little over 50lbs (which is still within this mounts rating) and the Vizio only weights 23lbs.  I have a Sanus extended articulating mount that I bought a few years ago and paid over $100 dollars for it.  (It now costs over $150) The Sanus is much stouter in construction than this VideoSecu mount is, so by reading some of the reviews on here and not knowing exactly how this mount was going to measure up pre-install, I swapped out TV's to match mounts accordingly.Now that installation is complete, I'm sure this mount would handle either TV just fine.  Is it the same quality as the Sanus? No, but it has enough quality to perform its advertised claims.  I saw some reviews on here complaining about mount sag after install.  Now this is based on the 23 lb TV, but I'm not experiencing this problem.  The mount has 4 pivot points and after installation, ALL need to be tightened to the point that movement is allowed with intentional moderate force.  Out of the box, this mount would have sagged like others complained, but I'm guessing its left slightly loose to help ease the installation process.I won't hesitate to buy another one in the future if the need arises.  An excellent price ($30) for a good quality mount.  If you want a mount that you can do pull ups on after install, buy the Sanus (and pay 5x more to do it).  If you want a mount that you can safely hang and secure your TV on, save some cash and buy this mount.", "overall": 5.0, "summary": "Well worth the money", "unixReviewTime": 1389744000, "reviewTime": "01 15, 2014"}
{"reviewerID": "A25BHOP1LA4XDA", "asin": "0972683275", "reviewerName": "S. Wright", "helpful": [0, 0], "reviewText": "I am using this with a 40 inch Samsung smart tv.  The extended bars were not needed.  This is very easy to mount to a wall stud with just two bolts.  Many bolts are provided to fit with your television.  It is very sturdy and able to be positioned in many different ways.  Highly recommended.", "overall": 5.0, "summary": "Works great", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
{"reviewerID": "A25RTRAPQAJBDJ", "asin": "0972683275", "reviewerName": "Ted", "helpful": [1, 1], "reviewText": "This mount is heavy, strong and already in one piece. Almost no directions were needed. The only issue I would have: After the mount is installed I had to lift the TV to the mount and screw the screws in while holding the TV up with one hand. I checked the instructions to make sure I wasn't being stupid. The directions confirmed to lift the TV and screw in the screws. Other mounts have a bracket installed on the wall and TV, then I just lift the TV and click it right in. The sturdiness of the mount makes up for this defect in my opinion.", "overall": 5.0, "summary": "A great TV mount", "unixReviewTime": 1329523200, "reviewTime": "02 18, 2012"}
{"reviewerID": "A1USUT1GJPMNAN", "asin": "0972683275", "reviewerName": "The Engineer \"DIY expert\"", "helpful": [0, 0], "reviewText": "This mount is sturdy, easy to install, and easy to mount the TV to.  The included hardware was heavy duty also.  The action is good, and tension is adjustable.  The tilt can be adjusted by using the knob in lieu of one of the bolts, or locked in place (which makes it more difficult for someone to remove the TV unless they have a wrench with).  I mounted the 27\" TV on our lanai, so a little theft-proofing is a good thing.  The TV is now visible either on the lanai, or from the patio.I RECENTLY BOUGHT A SECOND ONE, AND THEY HAVE CHANGED.  STILL STURDY, BUT LACKING THE QUICK MOUNT FEATURE! NOW YOU MUST HOLD THE TV IN PLACE WHILE INSERTING THE TINY SCREWS THROUGH THE BACK.", "overall": 5.0, "summary": "Excellent mount for my 27\" LED", "unixReviewTime": 1289865600, "reviewTime": "11 16, 2010"}
{"reviewerID": "AGY0KH2D5G9WH", "asin": "0972683275", "reviewerName": "Thomas \"TC\"", "helpful": [18, 23], "reviewText": "Do not listen to other reviewers, screws that this came with are concrete only, there are no wood or dry wall screws. You will!!!! need a stud finder!!! There are 8 holes in total on a mounting plate, so it is plenty enough if you hit the center of a stud. Sturdy,good looking. There is a whole set of machine screws for(my guess)all TV types plus couple of tools that you will need.", "overall": 5.0, "summary": "Excellent mount", "unixReviewTime": 1286841600, "reviewTime": "10 12, 2010"}
{"reviewerID": "A2JDDUN6YNRYKU", "asin": "0972683275", "reviewerName": "Time2Ride", "helpful": [3, 3], "reviewText": "I purchased this mount based on others comments beforehand and i appreciate the guidance. The problem with wall mounting flat screen TV's is to make sure the hole pattern of the mount lines up with the hole pattern on the TV you buy. I'm using this mount with a VIZIO E320ME 32-inch and it works perfect.", "overall": 5.0, "summary": "Very good value, paired with VIZIO E320ME 32-inch", "unixReviewTime": 1325203200, "reviewTime": "12 30, 2011"}
{"reviewerID": "AMAR6CIOZUQO4", "asin": "0972683275", "reviewerName": "T. McKendry", "helpful": [3, 4], "reviewText": "I'm using this to mount an older SyncMaster 191T above my desk and was pleasantly surprised at how sturdy it is for the price.  Installation was simple, though I used the screws from the original monitor mount for the plate attachment, as none of those included would work with my monitor.  The tilt mechanism requires loosening a bolt and then adjusting the monitor to the desired angle.  I would have preferred another 10-15 degrees of vertical tilting capability, but what is available will be fine for most applications.  I posted a couple of photos that shows it mounted.Overall I'm very pleased with the purchase and would buy again should I need to mount another small display.", "overall": 4.0, "summary": "Sturdy and an excellent value ...", "unixReviewTime": 1284768000, "reviewTime": "09 18, 2010"}
{"reviewerID": "AHWVTOXGM4SZ9", "asin": "0972683275", "reviewerName": "Tofael", "helpful": [0, 0], "reviewText": "Its sturdy, holds my tv really good, its adjustable & really really easy to install. An excellent product. I would definitely recommend it.", "overall": 5.0, "summary": "wow!", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}
{"reviewerID": "A1C00XXCYWEKK1", "asin": "0972683275", "reviewerName": "Tombo", "helpful": [0, 0], "reviewText": "I got this for mounting a tv on the wall in my home office. Price was good and it worked. The adjustments on it work well, and it has a gizmo to hold the cables in place. Don't hesitate to buy. I think I am using this with a 38&#34; tv.", "overall": 5.0, "summary": "Very happy with it", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "A162MNFD5CGQ03", "asin": "0972683275", "reviewerName": "tomes275", "helpful": [0, 0], "reviewText": "It does the job and it wasn't too hard to install so i'm a happy tv viewer. Nothing bad to say about it. Came with a bunch of bolt options for different make and model TV's", "overall": 5.0, "summary": "Works well, fairly easy to install", "unixReviewTime": 1392768000, "reviewTime": "02 19, 2014"}
{"reviewerID": "AY1IDZTQDM2D7", "asin": "0972683275", "reviewerName": "Tommy H", "helpful": [0, 0], "reviewText": "I have this wall mount installed outside. I have a 32&#34; hanging on it in my backyard. Easy to install and have had no problems what so ever..", "overall": 5.0, "summary": "Good Mount", "unixReviewTime": 1355616000, "reviewTime": "12 16, 2012"}
{"reviewerID": "A299PV3CRFH3C5", "asin": "0972683275", "reviewerName": "Tracy  Stanton", "helpful": [0, 1], "reviewText": "We had to &#34;shave&#34; a little off the wall mount plate to get this product to work for us, but after doing so it has served it's purpose on our 24&#34; tv.", "overall": 3.0, "summary": "Wall Mount", "unixReviewTime": 1356566400, "reviewTime": "12 27, 2012"}
{"reviewerID": "ALB2U20GGGJWU", "asin": "0972683275", "reviewerName": "Tulsa Jim", "helpful": [0, 0], "reviewText": "This unit has worked perfectly in holding a 40&#34; TV in an extended position for months - without sagging or failing.  Very happy with the purchase", "overall": 5.0, "summary": "Well Built", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"}
{"reviewerID": "A25M2X8KHSS2NC", "asin": "0972683275", "reviewerName": "Ultimate Ducky \"Ultimate Ducky\"", "helpful": [8, 15], "reviewText": "Unfortunately, I'm returning this mount.Though I like the look of it, particularly the two part plastic piece that clips to the wall mount portion to cover the bolts, I feel that the one I ordered wasn't well made.I purchased it to mount aLG 26LE5300 26-Inch 720p 60Hz LED LCD HDTVin our kitchen.The mount arrived quickly and was well packaged. Unfortunately, the arm was welded to the wall bracket at a slight angle, meaning that regardless of how it would mount it and the LCD would never be level.Also, the powder coating near one of the bolts had come off and I could see some rust already forming.I decided to see if the mount would be the right fit for the tv before returning, figuring I would just get a replacement and hope for the best. I'm glad I did because this led me to find two other issues.The first one I blame on the manufacturers, the second I would consider a design flaw of the LG lcd.The first issue is that the screws supplied to attach the bracket to the tv are too few and two short. The screws are only 12mm long, and would barely catch in the threads of the TV if they weren't recessed at all. Most mounting threads on lcds and plasmas are partially recessed. I stopped by my local Lowes and picked up two packs of similar screws (M4-70 or something to that affect). $0.80 a packet so not much of an expenditure, just a big hassle. I needed 20mm long screws to mount this to the tv, so a pretty fair difference over what was supplied. The manufacturer supplies several different thread and gauge options, but only one shallow length of each set.The second issue is that this universal mount covered the power and HDMI ports on the back of the 26le5300. Again, I think this is more of an issue with the tv then the mount, as they're situated rather high and central. Either way, it's something you'll want to check on your tv before ordering this product.I actually returned this and in its stead purchased a similar mount from the same company. TheVideoSecu Swing LCD Wall Mount 20 inch Extension 55 lb loading capacity for LCD TV Monitor Flat Screen VESA 75mm/100 mm 1USgets very high marks from me. It's basically the same arm with a 75x75 to 100x100 VESA head on it. This second arm did not have any of the manufacturing errors of the previous model and fit the back of my tv perfectly.I understand that it's a very affordable mount, and that most of my issues may have been resolved with a replacement. However, I just can't give this mount any higher rating than I have.", "overall": 2.0, "summary": "Poor Quality Control, May Block the Ports on Your TV", "unixReviewTime": 1283558400, "reviewTime": "09 4, 2010"}
{"reviewerID": "A1XSSIGIY4WGX5", "asin": "0972683275", "reviewerName": "VA Patriot \"VA Patriot\"", "helpful": [0, 0], "reviewText": "I must admit, I'm very cautious of what I buy especially when I've seen this identical bracket in the electronic stores priced three to four times than this one.  Bracket arrived much faster then what Amazon estimated and was well packaged.  The directions were adequate but I'm very mechanically inclined so used them as a quick guide and had this bracket installed with my Sony 37\" LCD in under a half hour.  My hats off to the marketing folks with this manufacturer as they did their homework and included additional hardware and brackets to meet any possible configuration out there.  Including mounting tools and level were also an exceptional idea.  And tossing in a 7' HDMI cable was the icing on the cake.", "overall": 5.0, "summary": "Better than advertised!", "unixReviewTime": 1322870400, "reviewTime": "12 3, 2011"}
{"reviewerID": "A2ZMEHV9S4FXV5", "asin": "0972683275", "reviewerName": "venividivici", "helpful": [14, 19], "reviewText": "If less money had been spent on packaging and more on quality, it might be a good product.The product was double-boxed.  The included level was broken. I would prefer to use my own level and have good hardware instead of junk on both counts.  One of the pivots on the arm was so badly rusted out of the box it seemed to compromise the whole system.  Despite 6 huge lag screws and strong arms, the joints are not strong enough to keep the mount level as it extends and articulates.  Each time I moved it it had to be re-adjusted to be level.  The hardware had to be tightened so much to keep it from wobbling, it made moving it very difficult.  I used a 26\" tv.The whole thing went back in the box for a refund.", "overall": 1.0, "summary": "Junk, sags, wobbles, crooked, Rusted", "unixReviewTime": 1307577600, "reviewTime": "06 9, 2011"}
{"reviewerID": "A3JD55EKK0KJKV", "asin": "0972683275", "reviewerName": "WhoseAnthony", "helpful": [0, 1], "reviewText": "I bought this mount for our bedroom in order to swing and tilt the TV based on our viewing angle.  In order to move it I had to loosed the screws each and every time.  I had it connected to a 27in vizio LCD which is pretty light.  Could not find a tension to keep it where we wanted it.  Had to return", "overall": 1.0, "summary": "very difficult to tilt and swing", "unixReviewTime": 1354147200, "reviewTime": "11 29, 2012"}
{"reviewerID": "A2S4X009TZ0C26", "asin": "0972683275", "reviewerName": "WyattC", "helpful": [0, 0], "reviewText": "Worked great. Easy mounting and setup. 2007 Vizio 42&#34; LCD hung perfectly. It is a heavier TV, around 50lbs and it mounted up great.", "overall": 5.0, "summary": "Works with 2007 Vizio 42\" LCD", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "A1L0MEXMESE4C4", "asin": "0972683275", "reviewerName": "Xpert", "helpful": [0, 0], "reviewText": "received the product and got it installed today. for the most part I am pretty happy with the hardware except the materials being used to make screws or other parts. the screws get very easily damaged by the most commonly used screw drivers that you can find for $1 per piece.  Once I put the bolt into the LCD TV and mount it with the plate, I found myself having a hardtime removing the screw because the tread mark on the screw head is already messed by by the screw driver, which makes me doubt about the material being used on the mount and arms.  is the material used on the mount going to deliver the same quality as the bolts and nuts?", "overall": 3.0, "summary": "just got it installed", "unixReviewTime": 1356739200, "reviewTime": "12 29, 2012"}
{"reviewerID": "A2H1U31KRK5X5L", "asin": "0972683275", "reviewerName": "Zam Bigger \"ZB\"", "helpful": [2, 2], "reviewText": "Mounting a 42 inch LG TV weighing 33 poundsPROLess expensivePrevious purchase of VideoSecu productAppeared solid and strongHad tilt and various adjustmentsMount on single studCONSagging..this is amazing that it sags and does so at different angles based on how far the TV is pulled out from the wallTherefore one cannot keep the TV properly aligned because any movement changes the tilt or other angles.Mounting is a pain because the mounting bracket never comes apart from the articulation armCritical bolt attachment for the mount from the TV to the articulation arm does not get tight!  This is amazing. It is not stripped but it does will not stay tight even from the first use.  This makes the product unsafe.I am amazingly frustrated bordering on angry because of the time put into this and now holes in the wall.  I need to get a different one.  My prior experience was with a VideoSecu MW380B TV wall articulating mount, which is far superior for a larger TV.  I bought this other one because I wanted a tight fit to the wall.Can I send a bill for my time and work putting it up and taking it down?????", "overall": 1.0, "summary": "Sags Sags Sags....and the hardware does not work properly.", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
{"reviewerID": "A3LDPF5FMB782Z", "asin": "1400501466", "reviewerName": "Alan  Houston", "helpful": [3, 4], "reviewText": "The Nook Tablet, in both the 16gb version and 8 gb version, are the best color e-readers of 2012.  Both are bargains when purchased at the discounted price Barnes & Noble provides to its members.However, they are designed for reading...if you want a gaming tablet, a Skype video tablet, or need access to thousands of apps, you need an I-Pad.I have owned a \"Brand X\" color e-reader for about a year, but seldom use it for reading because it causes eye strain. I have a Nook Simple Touch e-reader that is wonderful for books, but its e-ink screen is black on white only, which does not work well for colorful magazines such as \"Automobile\" or \"National Geographic\".Barnes & Noble has an offer that enables its members to buy the Nook tablet for MUCH less than the price quoted by internet vendors, so I took advantage of their offer...plus the staff of my neighborhood Barnes & Noble were very helpful, and invited me to classes they provide to teach new owners the in's and out's of their new tablet. Mine is the 8gb version, which works as well as the 16gb version. I added a 32gb memory card, so my Nook has more storage for books than I could ever fill.The Nook Tablet is the best of both worlds. It is easy on the eyes for long reading sessions because its screen was designed to prevent eye strain. The fonts are very clear, very sharp, and have very high contrast, enabling you to read with the screen set at a very low brightness level, eliminating eye strain. Independent tests have verified that the Nook tablet has less reflection and glare than any color e-reader or color tablet, because the screen's glass cover is bonded directly to the LCD, eliminated the air gap that causes glare.The vivid color makes magazines \"pop\" even more than their paper versions. Barnes & Noble adds a special \"text only\" option for magazine articles that make it easy to read the text by enlarging the fonts and putting the text of the article in a single long file.The Nook \"shop\" does not work as well as the Nook website on the internet for searching for specific books or categories of books. So, I downloaded the Dolphin HD browser from the Nook shop and use it to look at the Nook shop's book inventory. The Dolphin browser uses tabs, so I can put two or three books I am considering in their own tab, and switch back and forth.The Nook Tablet has Pandora Radio installed, so I can listen to my favorite music while I read books. The sound is weak through the Nook tablet's puny speaker, but wonderful through good earbuds. I also transferred about fifty of my favorite CD's to the Nook's memory card, so I can listen to music even when I am not near an internet connection.When I get tired of reading, the Nook tablet lets me watch movies and tv shows on Netflix or TV.Com. Movies on Netflix look wonderful, because the color balance on the Nook tablet is superior to that of any seven inch tablet currently available. Skin tones are difficult to get \"right\", but the Nook tablet does a great job.Many reviewers make the error of comparing the Nook Tablet to full-blown tablets, such as the Apple I-Pad. The Nook Tablet is designed to be an e-reader, and for that purpose, it is superior to any of its seven inch competition. The fact that it includes Pandora Radio and Netflix is a bonus...but it IS an e-reader. The Nook Shop has a relatively small number of apps, each of which has been tested to verify it works well with the Nook tablet's seven inch screen...most Android apps are designed for a three inch or four inch screen.The reading apps for children are impressive. Last week I downloaded a free children's book that combined the best of the \"book world\" and the \"video world\". The book played music in the background...as a character walked through a field, the flowers were swaying in the wind. The book provided an option to have a character read the book out loud, and an option to turn the voice off, so your child can read the book to herself. Many of the children's reading apps are free, or cost less than $5, a bargain compared with the $15 or $20 children's books sell for in stores.The Nook website offers a \"book of the day\" for adults and a \"book of the day\" for children. The illustrations in the children's books take advantage of the Nook's color screen. Yesterday's children's book was \"Mary Poppins\", a bargain for $2...but the REAL Mary Poppins seems a bit scary compared with the Julie Andrew's Disney version.For people who want MORE than just the world's best e-reader, Amazon.com sells a $35 SD card that converts the Nook Tablet into a conventional Android tablet with full access to Google Play and its vast array of Android apps. Just put the N2A card into the Nook's card slot, and restart the Nook. When you want to use it as just an e-reader, take the N2A card back out. Best of both worlds...the best seven inch color e-reader becomes a very good seven inch Android tablet.", "overall": 5.0, "summary": "The BEST Color E-Reader - With Bonus Features", "unixReviewTime": 1336003200, "reviewTime": "05 3, 2012"}
{"reviewerID": "A9HYSJ3D0D6I2", "asin": "1400501466", "reviewerName": "Al", "helpful": [1, 2], "reviewText": "I saw this product on Amazon and thought \"what a great deal\" because this is a 16GB version of the same tablet that Barnes & Noble is selling for $250 dollars.It mostly works, and the screen is great for reading books.  I have had problems with the browser since 2 weeks of owning and the Apps have issues loading and playing some games.  If I could, I would return this product and just pay out the money for a brand new one.", "overall": 3.0, "summary": "possible lemon", "unixReviewTime": 1336435200, "reviewTime": "05 8, 2012"}
{"reviewerID": "A3EOHF2YSVZA9L", "asin": "1400501466", "reviewerName": "Amazon Customer", "helpful": [1, 1], "reviewText": "Now I have like four different kendels and I am such a Fan.  My darling Daughter n law requested this.  No way, says I.  Then I see these reconditioned ones with a warranty, cases n protective films, new chargers and 16 gb HD.  Had to get it or her.  Only cause she gave me the worlds best gran babies ...and I guess I love her like mad too.", "overall": 5.0, "summary": "Loved it", "unixReviewTime": 1376524800, "reviewTime": "08 15, 2013"}
{"reviewerID": "ASH6NHZ1Z2O51", "asin": "1400501466", "reviewerName": "Amazon Customer", "helpful": [1, 1], "reviewText": "this is excellent tablet, excellent touch screen response and button controls. When you hold it in your hand, you will feel that its built tough and can withstand rough handling(my 17m old tosses it sometimes out of excitement and its still holding good). Battery is also good, last about 8+ hours; the old drawback is that there are very limited apps on Noon web, but I heard there's a way to sideload adds from Amazon that I haven't tried yet. But yes, I would highly recommend it.", "overall": 5.0, "summary": "Excellent tablet, great performance", "unixReviewTime": 1329264000, "reviewTime": "02 15, 2012"}
{"reviewerID": "A3R2US71Y3CV9R", "asin": "1400501466", "reviewerName": "Amazon Customer \"pkchainsaw\"", "helpful": [0, 1], "reviewText": "I love nooks. Kindle fire is OK, but nooks are easy to root and install cyanogen mod foe a full android experience.", "overall": 5.0, "summary": "love the nook", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A1A5KUIIIHFF4U", "asin": "1400501466", "reviewerName": "Anonymous \"Anonymous\"", "helpful": [4, 9], "reviewText": "Have no idea why people love this thing so much, you can't load any applications unless they are from the Barnes & Noble store and you can't even download the free version of Angry Birds.Apparently Barnes & Noble is worse than Apple at remotely disabling Nooks they deemed rooted by end users. You have less control of this thing than you would your TV.The root kits are useless for this OS version 1.4.2 and the instructions to root / jailbreak it read worse than rocket instructions from annoying geeks !It is an overpriced Barnes & Noble franchise in your dumb little hands and you're well served keeping your receipt and refunding it.", "overall": 1.0, "summary": "This thing is a junk kids toy.", "unixReviewTime": 1332547200, "reviewTime": "03 24, 2012"}
{"reviewerID": "A2UL4M5SXL7L0A", "asin": "1400501466", "reviewerName": "basieswings", "helpful": [11, 11], "reviewText": "I bought this for my husband for his birthday after trying it out in BN and seeing how amazingly responsive it is. I did a lot of research and put a lot of thought into it, almost buying him a kindle fire because I thought it was more \"manly\" looking. After much consideration and comparison of hardware, I opted to get this one. The big selling point for me the fact that it can boot from the SD card. I have seen the N2A (Nook2Android) SD cards here on Amazon and wanted him to have that functionality but didn't want to pay that much for one, so I did some googling and figured out how to make one myself. I purchased a 16GB micro SD card and in about an hour and a half, had the thing booting to CM7 from the SD card, and now it has full tablet functionality. It runs AWESOME, super smooth and very responsive, full tablet capabilities including running 3rd party apps and access to the google play store, and all without rooting or voiding the warranty. All he has to do to put it back to stock is remove the SD card (which he never does! It is pretty much useless in its stock form unless you only do light web browsing and read ebooks) My husband LOVES it and couldn't be happier with it. He uses it every day. The only thing it doesn't have that I consider a negative is a camera. MY tablet (Acer Picasso) has a camera and I do actually use it quite a bit, but my husband says he wouldn't use one  on a tablet so it doesn't bother him anyway. He also dowloaded Kingsoft Office and now uses this for work as well. Unbeatable hardware at an unbeatable price.... and don't let the restrictive stock software stop you from buying it... just go around it!!!", "overall": 5.0, "summary": "Excellent hardware, boot from SD for full tablet functionality", "unixReviewTime": 1342310400, "reviewTime": "07 15, 2012"}
{"reviewerID": "A2XIOXRRYX0KZY", "asin": "1400501466", "reviewerName": "B.L.", "helpful": [0, 0], "reviewText": "When B&N; designed this one, they were putting together a reading device that also happened to have some tablet features. As a result, what you get is pretty limited.It's a fairly sturdy device by feel, and not difficult to hold for a while and use. The quality of the screen is pretty good and it's not difficult to read for extended periods of time (so long as you're not out in the sun anyway, almost all LCD screens perform poorly there).Very little of the space on the device is available for sideloaded content by default, so you need to use microsd cards to add more if you want to do too much with that.You can sideload content from any source that uses Adobe DRM for epubs, and also epubs that don't have DRM at all. This means that getting ebooks from the library is pretty simple. You can install an Overdrive app and do it directly without going through a computer if your library uses overdrive.You can root it to get access to more apps. If you want to run a more pure version of Android, you can go for either putting together a Cyanogenmod card yourself or purchase one already made from Nook2Android.B&N; gives away a book and an app every Friday on their blog, so that's worth checking in on regularly.On the whole, this is an okay device for reading and can be a kind of nice semi-tablet to give to someone who normally tends to load their computers/tablets up with viruses by being carelessness. It's locked-down state works in your favor from that perspective.For more general tablet use, this is a pretty poor choice. Also, as of mid-2013 the later devices (Nook HD/HD+) have been radically marked down, so if you're going to buy one of these you should look to get it pretty cheap. Otherwise, it'd almost certainly make more sense to hold out for something more full-featured.", "overall": 3.0, "summary": "Decent Little Reader, Poor Tablet", "unixReviewTime": 1371686400, "reviewTime": "06 20, 2013"}
{"reviewerID": "A1S2BTVDZV4PYD", "asin": "1400501466", "reviewerName": "catherine kendall", "helpful": [0, 1], "reviewText": "this is such a great tablet. one time didn't work. acted weird really weird. needed to be cleaned. now I keep eyeglass cleaning clothes (disposable) for it. has worked like a charm since. hooks up to the computer without the shelves going away. book reading is great too. I use it for an ereader with games that I sometimes play, but mostly as an ereader. recommended.", "overall": 5.0, "summary": "a good e reader.", "unixReviewTime": 1385683200, "reviewTime": "11 29, 2013"}
{"reviewerID": "A1HLEJA9NGG4O4", "asin": "1400501466", "reviewerName": "cricket", "helpful": [0, 0], "reviewText": "Great product  works just as described have had no problems with it since I got it thanks for a great product", "overall": 5.0, "summary": "Great love it", "unixReviewTime": 1361923200, "reviewTime": "02 27, 2013"}
{"reviewerID": "A2K4IDHREI1GLM", "asin": "1400501466", "reviewerName": "Douglas M. \"Douglas M.\"", "helpful": [1, 1], "reviewText": "I do not understand people, they are comparing this $100 tablet with $500 Ipad, of course it is not gonna be the same. I would recommend this tablet to everyone especially for the kids.", "overall": 5.0, "summary": "Great for the price!", "unixReviewTime": 1393632000, "reviewTime": "03 1, 2014"}
{"reviewerID": "A2FHM5FB0BXKGA", "asin": "1400501466", "reviewerName": "Dr. Elaine O. Chaika \"book, movie, tech lover\"", "helpful": [17, 19], "reviewText": "Months later, I am still happy with this Tablet, but you should know 2 things. One is, you'll get it for $224 if you're a B&N; member.  Also, if you go online, often they have a deal such that if you buy a year's subscription to the NY Times, they reduce the price of the Tablet.  To get the member's discount, you're better off going to a B&N; store.  BUT THE BIG THING is, if you already own Kindle books, Barnes and Noble stupidly don't provide a Kindle app, HOWEVER, you can buy the cheapest n2a card, either on Amazon or on n2a.com.  This allows you to boot your Tablet up as a full Android tablet (like the $500 ones), and you can get the Kindle app on that.  There's no problem accessing your Kindle books on the Nook.  Since, as noted below, the Nook eReader is beautifully designed, much better in my opinion than any Kindle, so I use my n2a card only when I'm reading a Kindle book.  I find B%N and Amazon charge about the same for books. There are some books on Nook that Kindle doesn't have, and some on Kindle that Nook doesn't have.  However, only Nook has the Page Perfect editions and the Enhanced editions of books with embedded video, audio clips, and animations.One other thing: the Nook has a tab for \"My Stuff\" so you can download music, pictures, videos and documents easily onto the Nook. You don't have to buy music for it.  Use what's on your PC or what you rip from disk. I am doing a project of editing and making slide shows of over 4,000 pictures.  For that, I bought a 32 disk san drive for the Nook to download the pictures to and to work on them using a Nook app.  I don't know how you could do that on the 8 gig Fire. I don't know if you can put pictures on the Cloud for the Fire.  However, I can make many different slide shows and digital albums on the Nook Tablet without any Cloud.I got this and the Kindle Fire on November 16, 2012.  Then came days of comparing them side by side.  You can see my review of the Fire on its page's customer reviews, so, how about the Nook?  First of all, if you want one, get it from Barnes and Noble. It cost $199 with a year's subscription to the NY Times.  Even without that discount, it costs $249 with free shipping (and, this month the NOOKcolor Tablet is only $149!)Hands down, for the money there is no finer Tablet than this Nook.  Some reviewers say they're going to get a Sony or a Galaxy for their features. I have no quarrel with that, but you pay for those features.  Sony and Galaxy are fine tablets--I've tried them out, too.  However, the Sony is on sale for $399.99 this month, and the 32 bit is on sale for $499.99.  Comparing it side by side with the Nook, the Sony salesperson said, \"Wow! it's as good as the Sony!\"  Yes, and for about the half the price.Another salesman lamented that the Sony doesn't have the Netflix app, which comes with the Nook. Of course, Sony wants you to buy their movies.  Barnes & Noble just wants you to buy their books, which is fine for a Bookaholic like me.  B&N; has 2,500,000 titles available, over 1,000,000 free.  Since they have a lot of earlier editions of books, Book Freaks like me can purchase those or get them free.  They even have a Page Perfect series which are facsimiles of beautifully designed books. What you see on your screen is what a reader in 1867 or 2007 saw, brilliantly illustrated and unusually printed books.  You'd pay a fortune for them in their original editions, not $3.99. Many children's classics are in this series, but also adult books, like Butterflies.The Nook also has Enhanced Editions with audio and video clips embedded in the text.  Some of the old books are also Enhanced.  Changes because of misprints or other errors in the original are underlined.  You touch them, and can see what the original had. One of my Nook Books is a collection of Kafka.  You touch underlined passages and up pops a picture of the street Kafka has mentioned, or of a notable person he's alluded to.  In general, eBooks are superior to paper if they are on a Tablet with access to the Web.  You read in more depth, and can envision what the author is writing about without interrupting your reading experience. The Nook's connection to the Web is as fast as your wifi and is accessible with two clicks: Look up and Google (or Wikipedia).The Nook comes with Pandora and you can also download music from your computer using the USB cord which comes with the Nook.  Pictures, videos and documents can all be downloaded to the Nook, which has built-in folders for each, and, if the 16 Gig iof the Tablet is  not enough for you, you  can put a 32 Gig or smaller SD card.That's not all!  If you're App happy, you  can buy the N2A card for the Nook Tablet, which gives you every App in the Android Marketplace without rooting it and voiding the warranty.  I myself have been happy so far with the thousand or more apps available for the Nook, with new ones being added each week.  Truthfully, if it's apps that are what you want most in a tablet, the way to go is the iPad--for $600-$700 at the least.I gave my granddaughter a Nook Tablet.  Many of her friends have iPads; however, she says, she can get the same apps as her friends do. Using the Drawing app, she designed her birthday party invites on her Nook and then emailed them also using her Nook eMail.  She says she prefers Angry Birds on the Nook.  I can't comment. Angry Birds don't tempt me, but I do play some games on my  Nook.The Nooks have no cameras or Face Time, but with the money you save by buying the Nook, you can get an iPhone which does  have both.  If you want features like that in a Tablet, it costs $500 or more plus monthly data fees. No data fees with the Nook, of course, although you can browse the Web with ease and speed, depending on your router.You can stream movies and TV stories with ease on the Nook.  The picture quality is excellent if your wifi is.  I'm in a rural area with no 4G, but I still get crisp, clear movies with my wifi device.  Apps standard on the Nook are Hulu, Smithsonian, Showtime, and Netflix.  There may be more sources of flicks on it, but, truthfully, I haven't looked--and, since they add apps every week, you have to keep looking.If, like me, your primary use for a Tablet is reading, the Nook is tops.  Their eReader is elegantly designed and beautifully intuitive.  It even tells you how many pages are left in the chapter you'e on.  Notice, it displays page numbers, not \"locations\" like the Fire.  If you can't remember  who a character is, put your finger lightly on the name. 5 popups show instantly.  Touch Find, and in a second you have a page which lists every page that word has been on, complete with it sentence. (You can do this with place names as well.)  The other choices are Highlight, Note, Share, Look Up.  The Share lets you highlight a passage and send it to your Contacts--not social networking sites.  For those, you use the Share option in the menu at the bottom of the screen.  My friends tell me they love getting these passages from me.  Of course, I choose those  that are witty or relevant to a discussion we've had.  Other reading options are Go to Page, Back, Find (for when you want to type in the search screen), Contents, Text options, Brightness and Discover.  This last shows you other books on the subject you're reading about or by the same author.In short, as an eReader, the Nook is tops. As a Tablet, it does well, although not as well as those that are way more expensive.  Actually, everything it does do, it does very well.  It just doesn't have certain features--but that is true of every Tablet I've seen except the iPad.  As of now, the iPad's picture quality is not as good as the Nook's or, for that matter, the Fire's.  The iPad3 will have hi def, however.", "overall": 5.0, "summary": "Outstanding 7\" Tablet", "unixReviewTime": 1329350400, "reviewTime": "02 16, 2012"}
{"reviewerID": "A2749BTS2KRMVH", "asin": "1400501466", "reviewerName": "ECN \"Memphis lady\"", "helpful": [1, 1], "reviewText": "You would be crazy to buy here... its cheaper anywhere else.  UPDATE  I see amazon is now selling at the same price as the rest of the world so I retract...Also discovered another negative... When browsing the web the nook works fine on all sites EXCEPT AMAZON, now fancy that.  It will stay on amazon about 30 seconds then pop back to where ever I was before web browsing.  I've tried it over and over does it every time.Thanks to all who commented about the ability to still root the nook.  it is more complicated now but doable.  I'm debating about giving it a try.  Updated 1/22/12There are things to like about the nook, BUTNo android marketB&N; wants your credit card to download FREE apps -  ain't gonna happenstuff that is free on Android Market cost money at the B&N; app store.  I.E. Angry Birds costs 2.99 but is free from Android Market.I bought this Nook because it was root-able... but no longer with the latest update B&N; blocks attempt to root the device.BOO HISS ON B&N.;I never buy anything Apple because of the closed system.  I totally believe in Open architecture for electronic devices.  The closed system ONLY benefits the seller not the user.If all you want is a reader, email and the web.  then hey go for it.  but I truly disappointed and may return it.", "overall": 2.0, "summary": "Does less than my cell phone", "unixReviewTime": 1325548800, "reviewTime": "01 3, 2012"}
{"reviewerID": "A1G9SOE51HET8E", "asin": "1400501466", "reviewerName": "Frank", "helpful": [1, 1], "reviewText": "I bought this ebook (16G) for my Kindergarten and elementary children to read books on trips and my old child to check email. It does the jobs well until now. I personally like it very much for its excellent hardware performance. With low price, fast response, and light weight, book size, and Barn and Nobles support, It is the best device for children when you want to have something as an alternative for your computer.I am a fan of Amazon.com and meant to buy a kindle for my children. but the displayed sample on my local Bestbuy store showed me that the nook tablet responded much faster than kindle fire. It could not be generally true, but based on the displayed tablets, I had to choose the nook.Until now, I have had mainly happy experiences with it. It has apps for children, one of them has many Smithsonian videos that my small children love the most. My college age child also use it to check email at home because it responds in second to wake up, and we do not have to turn it off for many days before it runs slow. After you turn it off and restart it (hold the power button for seconds for on and off), it become fast again.I just found last day it has a recipe App with more than 17,000 recipes. It has pictures for most of the products.My children have asked me to buy the istory app for 3.99 dollars, but it contends 24 or more story books for children that it reads to my children. Wonderful! The American history app is excellent too, It costs me 1 dollar or so (not remember exactly now).Problems: It did start after my children left it idled for hours while a game was running. After the battery was charged for a whole night, it still refused to start. When I tried again in the afternoon, it started but took more than 10 minutes. I guess the software was damaged and repaired. It is now as good as it was before. I am still wondering what was wrong with it.It is not a computer and can not be connected to TV. only one or two of my children can use it in the same time. We still have to use computers when we want to enjoy movies or photos together.It was designed for you to buy their books. but I think the prices of most books are not low enough for me to purchase e version. I would rather buy some hard copies instead. However, one of my children loves the classical books which are free or only one dollar each. She is happy with the books.As a summary, the machine is excellent, sturdy, fast, and convenient for emails and web browsing. The books are not priced low enough for me to purchase although there are some old free books. Apps for children are wonderful. My children love it.", "overall": 5.0, "summary": "Excellent toy and tool for children", "unixReviewTime": 1338336000, "reviewTime": "05 30, 2012"}
{"reviewerID": "A6VFSC0BW75Y0", "asin": "1400501466", "reviewerName": "Frederick J. Haab", "helpful": [5, 5], "reviewText": "I pulled the trigger on three of these on pre-order back in November.  I'd cancelled my order for as many Kindle Fires because I felt the technical specs justified the extra $50 for the Nook Tablet.  I also appreciated more onboard storage and expandability since we're a four person family and I drive ... all three were for my wife and kids and not me, and I expected they'd be used on the road a lot.I think that by the time anyone reads this they should know that the tablets (both Kindle and Nook, to be fair) are tied to their respective distributors.  That didn't come as any surprise to me, I fully expected it.  I knew that, without modifying the device (not really acceptable for your average person, if you ask me), I would be stuck with B&N;'s app store.  What I didn't know was how woefully limited that app store really is; it pales in comparison to Amazon's and doesn't even register when compared to the android marketplace.My daughter got hers first (a late birthday present).  For the most part, she was satisfied with it.  I made sure wifi was available throughout the house; we downloaded a couple of apps (Angry Birds, of course, and a drawing program).  The first thing to notice is that the B&N; app store has a tiny selection of free apps.  The ad-sponsored version of Angry Birds can't be found, but for a couple of bucks I didn't mind paying - I paid for the non-ad version for my phone, too.Netflix works as well on the tablet as it does on any other device in my home (PS3 and a bluray player, both hardwired networking) as long as wifi connection is good.  Her other use was email, and since she hardly gets any, the built in app was OK.The other two tablets I purchased were for Christmas for my wife and son, and that's where the problems started.  My wife gets copious amounts of email from several different accounts and likes to keep it as neat as possible... she also uses her smartphone and computer and doesn't want to have to delete things three times.  The built in email application absolutely sucks.  You can't even empty the trash to completely delete messages you don't want.  We experienced this on our phones and installed the highest rated email app we could find on the android marketplace, which also happened to be a FREE app.  B&N; makes nothing by distributing free apps in their marketplace, so this app was not available at all, and the selection was slim for other apps.  Even the touchpad app that people were using to syncronize with Microsoft Exchange servers apparently doesn't work (and is very expensive for an app).As I mentioned, I knew I'd be limited to B&N; app store - I just didn't realize how limited that app store was.My wife then started getting a bunch of free samples of books, and bought several of them.  They all downloaded except one stubborn one.  That book would load just fine on all the other Nooks in our house (the other two Tablets and we have two original Nooks, as well).  I sent an email to technical support and received the usual \"we got your request and will reply as soon as possible\" message, along with the addition that they are experiencing a high volume of help requests.  That was a week ago and we still have not heard back.  After a few days, though, we physically took the Nook to the store to get help.  Nothing worked; off/on, archive/unarchive, even de and re-registered the device (losing our wifi and email configs in the process).  This book still will not load.We finally \"side loaded\" the book, which required installing a program on my wife's PC (which is very annoying in itself) and we were required to create an Adobe ID (how much spam will we get from them, I wonder?).  After side-loading the book, it has no cover art... more annoyance.  That book still won't download correctly, even after they told us it'd be fixed in 48 hours (that was five days ago).I am not one to \"root\" products like these (especially since they aren't \"mine,\" as I won't be the one using them).  As the \"guy,\" it seems I'm responsible for all technical support in the house and didn't want to deal with the ramifications (or, frankly, even take the time to run through all those steps to do it).  It's not that I can't, it's that it's a pain in the buttocks and I simply shouldn't have to.  We were not asking for the world, we were asking for a table that had Nook e-reader software and allowed a few other niceties.  I wasn't expecting an iPad for $250, but I was expecting working software and a functional email program.It's technically not a bad tablet - the screen is bright and clear and responsive; the UI is decent (although I prefer the four buttons on my android phone over the single big \"n\" button on the Nook).  It's solidly built and sturdy; with Angry Birds and Netflix as my only benchmarks I can say they both run much better than they do on my phone, with no pauses (that I saw) in Angry Birds at all.However, the accumulation of annoyances was a bit too much for me (let's say there was a nagging voice coming from somewhere... the other side of the bed).  I am returning all three - luckily B&N; has a holiday policy that will allow me to return them, which is very cool of them.  They have not lost me as a customer; I have my books purchased from them and will continue to buy.I hope them the best in the future; it was a nice try.  If they just weren't so tight fisted about control over content (especially apps, in this case) I'd have stuck with it.  Technically speaking, the device is quite good and, at the current time, IMO, the hardware is worth the price tag.  I wouldn't mind being limited to the B&N; app store if they actually offered more apps... a LOT more, as they have practically nothing compared to what's available for the android community at large.  Again, I'm not asking for an iPad; I know the iPad can do some really cools things this Tablet can't, just something to make the \"tablet\" part of the Nook Tablet more worthwhile.I imagine they'll fix glitches with the download problem, too.  I'm not the only person who had a problem, but I think everyone else managed to find a solution (besides side-loading).  Keep in mind I generally know what I'm doing and tried everything, and the \"expert\" at the brick-and-mortar store couldn't fix it, either.  The lady from Glee didn't come out and entertain us while they fixed our tablet, either... that was disappointing.So that's my review - it's decent hardware hamstrung by a few bugs and tight fisted control over content.  Some will argue that it's not meant to be a tablet, it's meant to be an e-reader, but let's be honest - it's marketed as a tablet; it's called the Nook TABLET.  It doesn't have to be an iPad, but it should work a lot better than it does at being a tablet.", "overall": 2.0, "summary": "People shouldn't be surprised about what it is, but still disappointing.", "unixReviewTime": 1325635200, "reviewTime": "01 4, 2012"}
{"reviewerID": "AQNEQQ96MKX3Y", "asin": "1400501466", "reviewerName": "Gojira Neko (godzilla cat) \"widowpress\"", "helpful": [6, 6], "reviewText": "I went to a few places just to try testing them out, best place to test them out first hand was BN. The people at Walmart didn't want you near them, and didn't know ANYTHING about them. Best Buy was pretty much the same, except you could 'sorta' test them out. BN though had people trained to know EVERYTHING about them, even the stuff that was not listed about them on the BN website.First thing not listed: if the Nook Colour can do it, so can the Nook Tablet. (for instance... read .cbz files without installing any extra apps)The 16gb model was much more responsive than the 8gb, so to me it was well worth the extra 50 bucks.Add to that that currently if you buy one at BN and don't like it, you have 2 weeks to return it for a full refund as long as it is still in new condition (so no attempting to root the device, which from what the rep told me will brick it unlike the Colour)that pretty much sold me, I found a place with micro SD cards on sale, bought a few, and took my Nook home.Pros:The screen is AWESOME! I use it for reading .cbz comics and .pdf files more than anything. The missing gap between the glass and screen made reading much better. Also the response on the touch screen was great.much better response time at turning pages, launching apps and using the inet that other tablets in the budget rangenative flash supportnative .cbz support (main reason I bought it)supports almost every popular ebook format except for .mobi (which can be converted to epub or .pdf anyway)good size for holding one handed for reading and lightweight (under a pound)battery life... 11 hours+ with wifi off, 8+ with it on, I tried it out and watched lots of movies and did some reading on it without it coming close to dying on me.a test drive opportunity if you buy it at BN and dont scratch it up or anything. I like the idea that I was able to take it home and so if it actually does everything that I want it to do wihtout a fear that I'm stuck with it for good.also if you buy it from BN you can buy an 'oops' return warranty (which means if you spill coffee on it or drop it, it can be replaced)affordable if you go without things like eating out 2x a week for awhileCons:lack of Android Market, lack of some apps I would like to see on the BN market (such as Google Music app) no sideloading apps at the moment either. That being said, this also means that apps available from BN will actually work with your Nook, there isnt a quantity over quality in the app store either. This means that if you've bought an app from Android market, you will have to buy it again if you want to use it on the Nook.The screen. trust me, I love it. But unlike other tablets where if you crack the glass you just have to replace the glass, on the Nook if you crack it, the screen is toastno front facing camera (or any camera for that matter). The ability to use Skype would have been nice, but wasn't a complete necessity. I've had many friends with tablets that had a camera that swear they never used it even once, and thinking about it, I wuld seldom use it either since most places outsite of my house that I will use it are places where video chatting would be frowned on, like Starbucks or the libraryno bluetooth, which to me didn't matter, but it seems to be an issue for some people. There IS bluetooth, but it's disabled and there isn't a way to enable itno GPS, this would be nice, unlike bluetooth, I would actually use it.mono speaker instead of stereo, again seems to be an issue for other people, I plug it into the minijack on my surround sound at home or the jack in my car stereo when I'm on the road though and its just fine. I use headphones if I'm out and about. Why on earth would I care about speakers that I never use anyway?no .flac support. a good chunk of my digital music now is .flac. it does have .ogg support thoughno .avi support. again, a massive portion of my movies etc are all in .avi format. It does have .mkv and .mp4 support though, so from here on out I will just have to rip my video files in those formats if I plan on watching them on it.lack of decent accessories selection. lets face it, the case market seems to be geared toward people that worship at the church of Steve, and the availability of accessories shows it.", "overall": 4.0, "summary": "GREAT .cbz (comic file) reader an more!", "unixReviewTime": 1330300800, "reviewTime": "02 27, 2012"}
{"reviewerID": "AHU88DJO03XZ7", "asin": "1400501466", "reviewerName": "J. Hernandez", "helpful": [0, 0], "reviewText": "And what is it? Why it's an outdated B&N; Tablet! A friend of mine purchased this after seeing my 9in HD+ tablet, but wanted the smaller 7in version. It works fine for what it is, but it caused her much confusion as it did not seem \"as nice\" to her as my 9in concerning screen quality.And that's because this is not the NEW Nook HD with a 1440X900 screen resolution and upgraded hardware, firmware, and software which has been on sale everywhere since the B&N; Father's Day Sale was extended indefinitely. This is the OLD Nook color with a standard 1024X768 resolution screen and minus the upgraded hardware and OS.IOW this is the old model :)So if looking for that \"new, on sale\" tablet by B&N; like my friend was, well, this ain't it. She will be returning hers and getting what she wanted initially.As for this one it looks fine and works fine for what it was, but comes up short these days, period.", "overall": 3.0, "summary": "Ok For What It Is", "unixReviewTime": 1372896000, "reviewTime": "07 4, 2013"}
{"reviewerID": "AHEP4N0XIJR1K", "asin": "1400501466", "reviewerName": "jlt246", "helpful": [1, 2], "reviewText": "The nook tablet is great.I have used it to check e-mail,browse and look at books,and also transferred one from my p.c.I like the way it will sync with the direction its rotated,and I love the touch screen.Thanks Amazon!", "overall": 5.0, "summary": "New Nook H D", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "A2BD5KVPI6CSPU", "asin": "1400501466", "reviewerName": "Justaguy", "helpful": [0, 0], "reviewText": "Check your SN with Barnes & Noble's 800 number. Mine was used from BuyAccessories. I paid $70 too much as used is under $30 these days.", "overall": 1.0, "summary": "Used NOT new", "unixReviewTime": 1392681600, "reviewTime": "02 18, 2014"}
{"reviewerID": "A1ES2Z4ZX6IWBK", "asin": "1400501466", "reviewerName": "KC1234", "helpful": [0, 0], "reviewText": "I read all the reviews and decided to buy this Barnes and Noble Nook for my Grandson for Christmas it was used but with original box and accesories  through EZ CORPS!!!  And I'm happy to say this Barnes and Noble is the best I ever invested in the picture and color is beautiful. Let's put it this way my niece that has the kindle was checking out the Barnes and Noble nook and compared it to her kindle said that the Barnes and Noble Nook has a clear picture than her kindle and more apps!!! And I told her I did my homework and looked this Nook up and it had the best reputation as far as for a kid,Young teen, Best nook ever invested in money and used at that but I will only order used if the item says like New with original Box with Accesories . And  I will only order anything used through EZ CORPS!! Best company to ever order anything from on Amazon fast professional customer service and love there shipping and handling !! And there all there used products are tested before selling which is a plus. I would Highly recommend this company any day to any one , Friends,Family,etc,Yes this Barnes & Noble Nook is well worth ordering used or new. Thank you Kristen Cates.", "overall": 5.0, "summary": "Barnes & Noble Nook  Tablet 16gb (Color,BNTV250)", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
{"reviewerID": "AH9FCFS4PCUVE", "asin": "1400501466", "reviewerName": "Kenneth", "helpful": [0, 0], "reviewText": "I could not be more pleased with - or impressed by - the Nook Tablet! I know that Amazon is \"enemy territory\", but the NT does a much better job of meeting my needs than would a Kindle Fire.Not only can I use my NetFlix account but I also have full access to the Amazon Prime website to watch films and videos!The screen is incredible - bright and colorful and very fast due to both the fast processor and the full Gig of RAM. I popped-in a 16G micro SDHC card and have more than enough room for my entire library of sideloaded epubs, pdfs, mp3s, and mp4 videos.And, of course, the primary use: It's now much easier to read in bed at night. The backlit screen means no more glare from an external reading light.", "overall": 5.0, "summary": "The perfect choice!", "unixReviewTime": 1334793600, "reviewTime": "04 19, 2012"}
{"reviewerID": "A1WRXACOKPITBQ", "asin": "1400501466", "reviewerName": "Leiah \"So, I Read This Book Today . . .\"", "helpful": [2, 3], "reviewText": "I have tried the IPad, the Kindle, and the Sony, and nothing has worked better than this Nook Tablet. It's light, the screen resolution is amazing for movies, and the applications I use work beautifully. Even the speakers are excellent for what they are. No complaints at all.", "overall": 5.0, "summary": "Best out there", "unixReviewTime": 1329350400, "reviewTime": "02 16, 2012"}
{"reviewerID": "AW3LX47IHPFRL", "asin": "1400501466", "reviewerName": "Lologuy \"cracked PDA\"", "helpful": [3, 3], "reviewText": "Nice specs with nice screen. Not worth the price with just the stock operating system, might as well save the bucks and buy the cheaper color model. You cannot use the larger 16gb internal memory to load your own files as the bad boys at B&N; restricts your access to only 1gb of that memory. UPDATE: Because of the unhappy owners B&N; will relax this restriction when you take the unit into their store and reserved space will be changed so you get 8gb free space.As is, the unit is SEVERELY crippled from making full use of its outstanding specs. Turn this baby into a great Android tablet by \"rooting\" it - easily and painlessly done by buying one of those SD card based kits. I got a 32 GB card with the root kit and I now have full access to Android apps with the ability to revert back to stock is if desired. You can now get all these capabilities on a really good performing tablet for well under $130 (like new used) but remember you get a unit that's a generation old and doesn't have bluetooth, gps, and hdmi out like most other newer tablets have.", "overall": 5.0, "summary": "Great if rooted", "unixReviewTime": 1339804800, "reviewTime": "06 16, 2012"}
{"reviewerID": "A1E3OB6QMBKRYZ", "asin": "1400501466", "reviewerName": "MagnumMan", "helpful": [6, 6], "reviewText": "If all you want is a tablet for reading B&N; books and periodicals and maybe playing the occasional cheesy game, this is for you.  Otherwise, pass.This is listed as an Android tablet but it's not.  It's Android on the surface but it can't access Google Play and instead uses the B&N; app store.  This means paying for apps that are free elsewhere.Also, my unit takes an incredibly slow 2 minutes to boot, drops wireless signals that are strong and includes a browser that has the speed of a 90s drug store computer.Wonder where the camera is?  It's at the factory -- there isn't one.  Forget Skype or face to face video chatting.Spend your $200 on a real tablet.By the way, not a slap at Amazon, just the tablet itself.", "overall": 1.0, "summary": "Not a Real Tablet", "unixReviewTime": 1350086400, "reviewTime": "10 13, 2012"}
{"reviewerID": "A3OYMK6UMM871F", "asin": "1400501466", "reviewerName": "oldcandyeater", "helpful": [0, 0], "reviewText": "This thing has been through so much. Closed in doors, thrown across the room, been the object of desire in a toddler tug of war and it still keep working. It i just fantastic! To any one complaining that he app store for barns and noble is too small I say just sideload google play with the root kit. It is easy and doecker skills to do.", "overall": 5.0, "summary": "The ultimate kid proof tablet", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"}
{"reviewerID": "AJIHWX6ITBI9G", "asin": "1400501466", "reviewerName": "OmLz \"Omar\"", "helpful": [0, 0], "reviewText": "I'm happy, satisfied and proud of myself by selecting such a wonderful tablet like my NOOK.  Honestly it worths more than a five star rating.I will recall a phrase in a movie, it came to a certain point when I had to decide between style and substance...That's right! I got both on this Tablet.The product arrived two weeks ago, I did charge the battery and afterwards registreded the product so I immediately starting getting books, nowadays I have plenty of Nook Books to read ahead.My co-workers and friends love the aesthetics of the Nook look, as I love all the features in the device.Pros: All of them.- The screen is so clear (\"Wows!\" me all the time), fast response to tasks, easy menu, fast processor, Micro SD card slot added 32GB extra fun (big smile), lightweight, long life battery. etc.Cons: None", "overall": 5.0, "summary": "Nook Tablet is more, meaning MORE than a five star tablet.", "unixReviewTime": 1353196800, "reviewTime": "11 18, 2012"}
{"reviewerID": "A19N3S7CBSU6O7", "asin": "1400501466", "reviewerName": "OregonBay \" OregonBay - 1999 to 2014\"", "helpful": [33, 39], "reviewText": "The Nook Tablet is a solid hybrid tablet/eBook reader.  It excels at eBook reading, and has many functions as a tablet as well.  This is a minor upgrade for Nook Color owners, but a major upgrade for those going from the Nook or Kindle eInk display reader.Pros:7\" VividView IPS touchscreen, bonded for glare reduction.  This is the best IPS screen on the market in this class of device.MicroSD card slot, for up to 32GB of extra storage.Built-in Microphone for voice recording, particularly usefull to \"read\" books to your children without having to physically be there.Reliable Wifi card.1 GB built in RAM for smooth, fast video.Netflix and Hulu.eReader bests the competitions.Easy to root, if that is something you would do.Cons:It's $50 more than some low end hybrids.Much like the other low end tablet's, it runs on Android, which is not the best tablet experience.Limited apps, although the list expands almost daily.Overall, this is a great device and although it is $50 more than some of the competitors models, it is also a far more refined product which doesn't have many of the problems of the others.Highly recommended!", "overall": 5.0, "summary": "Nook Tablet", "unixReviewTime": 1322697600, "reviewTime": "12 1, 2011"}
{"reviewerID": "A1BZ18U2EF4FAI", "asin": "1400501466", "reviewerName": "PD", "helpful": [0, 0], "reviewText": "the nook color is a great tablet. it sometimes is very slow but it is still a good tablet. i have dropped it a few times and it is still okay.", "overall": 5.0, "summary": "very good", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "AD4XKDR0MD7JO", "asin": "1400501466", "reviewerName": "Ron from Michigan", "helpful": [2, 2], "reviewText": "For the price this is a great tablet. It lacks a camera, GPS, and bluetooth, but that still leaves a lot, between web browsing and running lots of Android apps. Barnes and Noble did cripple these with limited software through their store but I did get around that by rooting mine.That said, I was sort of surprised to see this pop up as something recommended by Amazon today. The newer version is faster, has a higher resolution screen, is lighter despite same screen size, and has bluetooth. (Still no camera or GPS). B&N; also is now allowing access to the Google Play Store. It is available on the newer version but I don't know if they updated the software for this one to allow access. I suspect they didn't but this would be something to check on if considering purchasing.If you want a tablet for web browsing, checking email, ebooks, video, and many other apps and this is as much as you want to spend, then it isn't a bad deal. I would recommend paying more for the newer version--the Nook HD. (They also make a version with a larger screen, the HD+)Also note that there are third party programs available which will allow you to boot a rooted Android system off of an SD card. This will give more options but I found the original Nook Tablet to be sluggish running off such a card--possibly because I also went to Jelly Bean and this might have been too much for the older tablet. I wound up going back to running the rooted software directly off the tablet (but rooting is more work than inserting a card). The HD works well off a rooted Jelly Bean card.", "overall": 4.0, "summary": "Great, But New Version Is Even Better", "unixReviewTime": 1381104000, "reviewTime": "10 7, 2013"}
{"reviewerID": "AOHQVDAGYMV6J", "asin": "1400501466", "reviewerName": "sal \"salby\"", "helpful": [1, 1], "reviewText": "I have used several different 7 inch tablets. The best I used was the Galaxy Tab 7.0 plus. This is a less expensive tablet and very, very good. But rooting the Nook Tablet made it great.That is a fairly easy thing to do with a bit of patience and reading. There are step-by-step videos on how to do this and links to necessary files. All you need to get you started is Google \"root Nook Tablet\". Yes, when it is rooted it does void the Nook Tablet warranty, but it can be unrooted without problems.The screen is beautiful, it is fast and with the micro SD card slot, has plenty of room for storage. I bought my 16gb for $229. A great tablet for the price and I use it every day. Great purchase.The Galaxy Tabs are noted for audio quality and, of course, have some features that can be useful. But the Nook Tablet is mighty fine and a great investment for the price.", "overall": 5.0, "summary": "Nook Tablet -- Rooted", "unixReviewTime": 1336348800, "reviewTime": "05 7, 2012"}
{"reviewerID": "A1ZJF8YB4LZ356", "asin": "1400501466", "reviewerName": "SCCGAC", "helpful": [7, 13], "reviewText": "The customer support people at Barnes & Noble site are clueless. They are useless for providing help. If you buy tablet, you are on your own. In the store it is the same.", "overall": 1.0, "summary": "Tablet Good, support terrible", "unixReviewTime": 1324252800, "reviewTime": "12 19, 2011"}
{"reviewerID": "A2QYH0JNDSB7CT", "asin": "1400501466", "reviewerName": "Serena", "helpful": [2, 2], "reviewText": "If you want an e-reader, get an e-reader - the battery dies in a few hours (or a couple, depending on brightness settings). If you want a tablet, get a tablet. There are far better options for a similar price. If all you want to do is read magazines and buy a few apps, fine. But this thing is truly lacking. I've owned mine for 6 months, and haven't changed my mind about it yet.UPDATE: The product gets even worse with age. It will not fully charge, ever, and at 15% it goes crazy. It runs all sorts of apps, closes them, types things into the browser, and won't let you use the tablet at all. This may not seem like a big deal, but it is unacceptable. 15% should still be enough to read for a bit, rather than going psycho and taking over the device.", "overall": 1.0, "summary": "Nothing Special", "unixReviewTime": 1356393600, "reviewTime": "12 25, 2012"}
{"reviewerID": "A1R0ZOYR1ZCH6K", "asin": "1400501466", "reviewerName": "sgun73 \"Steve\"", "helpful": [1, 1], "reviewText": "Just picked up a refurbished Nook Tablet from newegg's website and its amazing. Only has a 1024 x 600 pixel screen but from a foot away you can't tell the different between this and a device with 1200 x 800 pixels or more. Reading is a pleasure. I've had all the Kindles and all the Nooks and for the best overall reading experience the Nook is better.Why? The Nook devices feel great to hold. The plastics are soft, all the buttons are in good places, and recharging takes no time at all. Also, the software layout and navigation is easy and logical. Next, the font choices, sizes, and other personalizations are all useful. And finally, no freaking ads. You can personalize your home screen and on the Nook Touch you can select your own photos for the screen saver.What's my problem then with Kindle? Couple things. The ads of course. Also, I personally don't care for the software. You are stuck in their software with no way to personalize it. Boring! Also, the buttons are in bad places so you can accidentally shut the device off. On the lower priced Kindles the font choices are fewer and the smaller size choices are useless unless you use a magnifying glass. And the devices aren't as nice to hold. At least on the Fires they took the idea from Nook on making the backs have a soft plastic.I'm pretty sure that anyone who takes the time to try both Nook and Kindle will like the Nook better. As reading devices go they just make more sense. As far as a full fledged tablet goes you'll have to look to Apple or Samsung in my opinion. Matter of fact I am writing this review on my iPad and shortly I will go back to reading on my Nook Tablet.", "overall": 5.0, "summary": "Best ebook reader under $150!", "unixReviewTime": 1362268800, "reviewTime": "03 3, 2013"}
{"reviewerID": "A2PQZH1SJGRV4Y", "asin": "1400501466", "reviewerName": "Shruti Dixit \"bookiefoodie\"", "helpful": [0, 0], "reviewText": "I love using this. It's light and easy and fast! LOVE that is has hte capability of Google Play on it! So hard to find things that are compatible", "overall": 5.0, "summary": "Amaizng", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "A2DN13HKY0A58L", "asin": "1400501466", "reviewerName": "stephen p brazzale", "helpful": [0, 0], "reviewText": "my wife was tired of dragging books around she loves the covienence of the tablet and can make the text larger", "overall": 5.0, "summary": "present for wife", "unixReviewTime": 1370908800, "reviewTime": "06 11, 2013"}
{"reviewerID": "A2ENZ4FESUXXMT", "asin": "1400501466", "reviewerName": "Steve Cohan", "helpful": [9, 10], "reviewText": "I was looking at expensive tablets that were more like mini notebook computers. I already have a high end notebook. I wanted something that was very portable and not combersome to take on trips, go to coffee shops and etc. I wanted the ability to get email, do limited surfing and read books. The Nook works flawlessly and the display is really nice. I have an N protocol router and the Nook is quick on the Net. I read some negative reviews here. They appear to be written by folks who want to take a $200 unit and turn it into a $500 unit with various apps and other applications. Here's a news flash for the naysayers. Go out and buy the $500 unit and quit complaining. If you want to read books, surf and get email, you'll like this unit.", "overall": 5.0, "summary": "GREAT TABLET, IT IS WHAT IT IS", "unixReviewTime": 1331510400, "reviewTime": "03 12, 2012"}
{"reviewerID": "A2ILMCJBXWF5TS", "asin": "1400501466", "reviewerName": "Steve \"Steve (Walnut Creek, CA, USA)\"", "helpful": [52, 57], "reviewText": "Update 2-Sep-13:Put on CM 10.2.2 (Android 4.2.2) last week.  I've got to say, it's nice.  Fonts are small, though one could choose dpi if they had visual issues (google this).  Netflix works, and the UI is really quite nice - pretty much no need for Button Savior, battery life is same as CM7.  In general I like it better than CM7.  My major hardware dislikes are headphone jack requires a little wiggling sometimes, no BT, no GPS.  Seems to charge fine with a normal cable.At this point I lean toward Samsung tablets - I like the IR and the microSD slot.===========================Update Jul 2012: I've installed Cyanogen 7, which works with button savior.  I had trouble installing from .zip booting into recovery but was able to install without a hitch using a bootable microSD card.  Fonts are sometimes a bit big, as is line spacing, but in general, CM7 frees you of the B&N; walled-ness, even as somewhat mitigated below.  Netflix doesn't work, and Google Chrome won't run on Android 2.3.  Headphone jack a bit intermittent - need to wiggle wire sometimes.===========================Original review, Dec. 2011.===========================First I give a summary, followed by the details if U are interested.  I hope people will read reviews here, as, if you say much at all on B&N;'s site, they don't post your review and don't allow you to modify it so that U can post it!:A Nook Tablet could be quite good if you only want to:-  Read ebooks purchased from B&N;-  Browse the web on a tablet-  Play a small selection of games, having to pay 3-4X normal Android/Apple pricesGet something else or modify it if U want to:-  Buy a full selection of games/apps-  Pay the same price for a game as U would on an iPhone/iPad, Android Phone buying from either the Android Marketplace or Amazon App Store.-  Play music where U can sort by artist, album, genre, etc.-  Play mpeg videos-  Watch YouTubeIf U are willing to do a bit of work, you can do all this by modifying the device.  I used it rooted with the modifications described below for 11 months, before installing Cyanogen 7.2 on it.  This is a huge improvement over rooted with the below modifications - it's essentially a normal 7\" Android tablet now.The Details:============My daughter got a Nook Tablet for Christmas 2011.  She'd been saving for an iPad (~$500) but at the rate she was saving, we took pity after a year and a half.While she does read (and so do us parents), she also wanted to use it as a music player, and a movie watching device while away from wireless in the car, on a plane, etc, and she wanted to play some games.I did my reading and we seriously considered an iPad for the family with each of our 2 kids putting in $150 or so.I read about the Kindle Fire and Nook Tablet - the Fire only had 8GB of onboard storage at the time, and no micro SD slot.  A deal-breaker.  This was pre Samsung GalaxyTab, Nexus, etc.  Since the Nook Tablet has 16GB and a micro SD slot, we went to a store to take a look.  Sales guy was good, and the device hardware shows well.  Once we got it home and were doing more reading about setup, we found the first of our issues:Issue #1: Onboard Memory========================Of the 16GB of storage, you can only place your own items in 1GB.  The rest is for B&N-purchased; content.  1GB is not enough for a music collection, or any significant amount of video.  A 32GB Class 4 micro-SD card was also in her stocking, having read about this ahead of time.Once she unwrapped it and we set it up (easy enough), annoyance #2 showed itself:Issue #2: App prices and quantity=================================2 Examples: Angry Birds and Fruit Ninja.-  BN Market: $2.99, $3.95.-  Amazon's Android Market: $0.99 (ad-free), with free ad-supported versions available-  Android Market, $0.99 for either, plus free, ad-supported versions available.-  Apple App Store, $0.99 and $0.99, plus free, ad-supported versions available.YouTube: free/pre-installed on all Android/Apple phones/tablets I know of, not available on the Nook Tablet, not in the Nook store.I didn't buy either game, but instead looked back to some of my pre-Christmas reading - U can load Amazon's Appstore without rooting the device, esp. if it's running v1.4.0 of the software.  I got that working and bought $0.99 ad-free Fruit Ninja and Angry Birds.  While I was at it, I side-loaded a few other apps by e-mailing them to myself and web-browsing to get them, and got usb drivers working on an XP laptop so I could sideload via adb over usb.I wasn't home for Christmas, but I did have my work laptop which has music on it.  I copied some over and began to use the music player....Issue #3: Built-in Music Player Limitations===========================================The built-in music player in Android is decent - has been since Android 1.5 - the first version I used.  U can, generally, sort by artist, album, etc, and the UI has dark backgrounds rather than white.  The Nook built-in music player doesn't allow sort. For this, I didn't want to buy a music player, so I went ahead and rooted the device and installed Honeycomb's (Android 3.0's) music player, which is free.  Also put the standard Android YouTube app on since I could now access the Android Market.  The problem wasn't quite solved, because changes to the SD card (adding files) weren't recognized.  I tried Winamp, Songbird and Android 4.0's music player when ICS came out.  They had the same issue.  TTPod does work - you can manually refresh at any time.  I now run Cyanogen, whose music player (modified stock android to add gesture support) works just fine.  They were aware of tablets when they wrote it.This is ironic - B&N; had to do actual work to make it much worse than using the normal android version, plus they had nice opportunities to improve on the experience of a phone due to the large screen - Cyanogen 7 Android supports gestures for music - do an arrow to the left like \"&lt;\", say, and it'll go back a track.  This would be great while driving.(Note that U can unroot by putting a copy of 1.4.0 on an SD card which, though I'm not sure, would probably allow you to return the device if U needed to).Issue #4: Built-in Video Player Limitations===========================================I'd also brought on my work laptop half a dozen videos I nabbed from our TiVos from which I stripped the commercials, saving them as mpg videos.  These wouldn't play with the built-in player.I solved this with MX Player, free version, which plays them fine. U can do this only if U've installed Amazon's App Store or rooted and can access the Android Market. People out there are selling PC software to convert videos to a format Nook Tablet can use. No need - just get another video player.  MX Player Tip: brightness control is an up/down swipe on the left hand side of the screen, volume on the right.Issue #5: UI Inflexibility==========================U can't add shortcuts to the desktop, and can't do much with the sliding apple-style bar either.  For this, I installed App Manager (tough to find a .apk to sideload using adb, so I needed rooting and then got it from Android Market).  This is a fantastic app and I don't use my GoLauncher screen much any more.Also, there's one physical button.  Standard android buttons such as menu (right-click) and back aren't always around in the UI, and holding home doesn't bring up a list of open applications as it does in carrier or stock android.  They should have put those standard 2 buttons on the device.  Update after a month rooted: use Button Savior, which gives soft buttons with a flyout.  Once in a while, you have to use NT Hidden Settings to check USB Debugging unless you use Cyanogen.  Update post Cyanogen: CM7 can have soft buttons (back, menu, home, etc) displayed all the time, if desired, and has Button Savior installed as well.Issue #6: Can only charge with their charger/cable==================================================Nothing more to say.  BlackBerries and Android phones in the house all can charge in the car or at all the computers by just connecting a cable.  It charge very slowly, even if it doesn't tell you it is, when connected to a PC because or other charger.  With some irony, B&N; has had to mail me both a charger and a cable this year due to breakage.  If they could charge with any micro-USB cable, they wouldn't have to.  Update post-Cyanogen: With Cyanogen, it charges with any micro-USB cable, though slowly unless it's the actual Nook stuff - there must be something in hardware.Issue #7: OTA update breaks all the niceness I've achieved==========================================================An OTA update, v1.4.1, will break the ability to mail yourself .apks to be used to enable non-BN apps to install and to enable debugging.  I imagine U could have done these steps while on 1.4.0 and gotten sideloading via PC/adb to work, but U can't disable OTA updates.  U can if you root, though, so I did, then used SQLite to modify a setting to only update when done manually. It'll never auto-update.  Update post-Cyanogen: irrelevant now.Goodness #1: Hardware is pretty sweet=====================================Snappy, installs apps fine, opens them quickly, videos are fairly smooth, scrolling is pretty good (but not as nice as Apple's).Screen is great from angles, clear and bright.It's lightweight and can be held easily in one hand.Speaker is pretty loud - louder than any of our phones except maybe BlackBerry.Goodness #2: the Reading Aspect===============================The reading end of the device is well-implemented, though I give Amazon's original Kindle and all subsequent ones and advantage - an order of a book on an original kindle appeared on the device in less time than it took me to back out of the purchase UI.  Doing so from the web is also very fast.  A web order using a computer of a B&N; sample appeared about an hour later, but quite snappily when done from the device.Goodness #3: Books with Videos/Sound====================================Yes, these are available on Kindle Fire and iPads. I know. I do like the talking kid's books (reminds me of a LeapFrog Tag pen, but without the ability to touch words and hear them), and the free cookbook sample had a video of making a chocolate sauce.  This is good for cooking!  U can see what each stage is supposed to look like.Goodness #4: Good if U Root it, for $250========================================When rooted, it's a nice tablet + it has the B&N; connection, and it cost $250.  It isn't an iPad (no cameras or BT), and it's half the price.  Update Nov 2012: There are now a multitude of 7\" tablets (ASUS, Samsung, Google) which get my recommendation.", "overall": 1.0, "summary": "Very Limited Unless You Modify It", "unixReviewTime": 1325462400, "reviewTime": "01 2, 2012"}
{"reviewerID": "A3PIPAS3M7YLQC", "asin": "1400501466", "reviewerName": "Stuart", "helpful": [3, 3], "reviewText": "I own the original Nook e-ink reader and the Nook tablet.  I have been happy with both.  When I read all the wonderful reviews about the Nook HD+ I couldn't wait to buy one.  The main reason that I bought the reader is that my vision has deteriorated over the years to where I need at least 16 point type.  The availability of different sized type on the reader devices is very welcome.  I use the tablet, not only for reading, but to watch Netflix movies while on my exercise bike.  The Nook tablet works okay for that, but the larger display of the HD+ seemed that it would be an improvement.  However, there are several problems with the current edition:There needed to be at least one more font size at the high-end.  I had to choose between too small and too large.The sound level was too low, even with headphones.  I could not find a Barnes and Noble application to provide better control over the volume.  There are a number of third-party applications which used to work on the Nook tablet that are now locked out by the current OS version.So, in spite of the beautiful display, I reluctantly returned the HD+ to my local store.  When planning future upgrades.  I would advise Barnes & Noble to consider the needs of older customers and people with disabilities.  We are not an insignificant market segment.", "overall": 3.0, "summary": "Not for senior citizens", "unixReviewTime": 1354320000, "reviewTime": "12 1, 2012"}
{"reviewerID": "ASPN95ORQQDS0", "asin": "1400501466", "reviewerName": "T", "helpful": [0, 1], "reviewText": "Rooted, and cyanogenmod installed, works awesome.  The Nook Tablet has a bit more memory than the original Nook Color, so that's why I got this one.", "overall": 5.0, "summary": "Perfect for rooting and cyanogenmod", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AW3KFYL19VZPL", "asin": "1400501466", "reviewerName": "T. R.", "helpful": [0, 0], "reviewText": "The B&N Nook is a great device. The hardware in it makes sure there is no lag or waits while watching videos, reading books, or surfing the web. The builtin apps are great, as well as the overall layout and options. The major drawback is the inability to load 3rd party apps...but roll back to firmware 1.4.0 and load all you want before upgrading. Or root it (although Amazon Instant Video will not work after rooting).", "overall": 5.0, "summary": "Fantastic product", "unixReviewTime": 1340582400, "reviewTime": "06 25, 2012"}
{"reviewerID": "A1I0MV8SWXSWDQ", "asin": "1400501466", "reviewerName": "William Karoly \"Bill Karoly\"", "helpful": [11, 20], "reviewText": "It accepts up to 32gb micro sd cards but does not work properly with a 32gb card. Mine would not boot because the card used too much energy. That was the only issue I had. Customer service told me to unplug the card before booting up and then insert the card. I returned it and purchased a Samsung Galaxy Tab 7.0 plus.Funny thing is Barnes and Noble rrjected my review.", "overall": 2.0, "summary": "Memory Card Issues", "unixReviewTime": 1322697600, "reviewTime": "12 1, 2011"}
{"reviewerID": "AL2XB3XNNUV9J", "asin": "1400501466", "reviewerName": "Wollytech", "helpful": [1, 1], "reviewText": "Let's just say this will never be iPad or anywhere close to it. That said, it is never meant to compete with iPad anyway! IF you compare this with Amazon's Fire, it's a closer comparison. Frankly, this is better than Fire. Hands down, NT has better hardware specs and it shows when you start browsing internet with heavy imagery or picture ebooks or emags. The complaints about NT's wall-garden OS restriction is very true...so is Amazon's Fire!It's not the end of the world, just root the device and you have in hand a functional tablet for $250 that is rather spiffy. This doesn't get a 5-star rate because 7-inch form factor is the biggest drawback compare to the OS lockdown. Personally, 7-in tablets is too small for serious computing usage. It is a good reading form factor though. I can't give this a 4-star rate because B&N;'s app store is too small...even when rooted, Google's Market Place is filled with crappy-junk apps.", "overall": 3.0, "summary": "It's a entry-level tablet for $250", "unixReviewTime": 1329350400, "reviewTime": "02 16, 2012"}
{"reviewerID": "A1089S59XSJT2T", "asin": "1400501466", "reviewerName": "Zachary Leingang", "helpful": [0, 0], "reviewText": "i got a 16gb microsd off of amazon for under $14.00 and it holds just little over 8k books, it was what swayed be over the kindle fire, that and the 1gb of ram vs 512mb. Now that they released a 8gb nook for $199.00 its price point is on par with the fire, and has the option of expansion, and  a simple hack allows for a custom android launcher, and i can easily install the amazon app store(and kindle app), android market place, and have a very decent wifi tablet, tbh i wasn't much of a analog book reader, but with this little nook tablet i've been averaging a book a week, along with .99-1.99 monthly magazine subscriptions.when the original nook first came out i purchased one and took it back 2hrs later, it was less then what i expected, but i think barnes and noble has come a long way and now this version is very impressive.battery life is decent, depending on your screen brightness preference and netflix usage, unless i am at home, i usually have the screen brightness at little less then half, and wifi off, and get about 6-9hrs of nonstop read time, 3 days of casual reading/standby.", "overall": 5.0, "summary": "amazing device vs kindle fire and better pricepoint then iPad", "unixReviewTime": 1329955200, "reviewTime": "02 23, 2012"}